[NoCoverage] BlockStatement
services/attendanceService.js:4:36
 // services/attendanceService.js
 // Pure helpers for attendance logic (no DB/Express)
 
-function rowToAttendance(r = null) {
-  if (!r) return null;
-  return {
-    id: r.id,
-    studentId: r.studentId,
-    courseId: r.courseId,
-    date: r.date,
-    status: r.status
-  };
-}
+function rowToAttendance(r = null) {}
 
 function isValidDateISO(dateStr) {

[NoCoverage] ConditionalExpression
services/attendanceService.js:5:7
 // Pure helpers for attendance logic (no DB/Express)
 
 function rowToAttendance(r = null) {
-  if (!r) return null;
+  if (true) return null;
   return {
     id: r.id,

[NoCoverage] BooleanLiteral
services/attendanceService.js:5:7
 // Pure helpers for attendance logic (no DB/Express)
 
 function rowToAttendance(r = null) {
-  if (!r) return null;
+  if (r) return null;
   return {
     id: r.id,

[Killed] BlockStatement
services/attendanceService.js:15:34
   };
 }
 
-function isValidDateISO(dateStr) {
-  if (typeof dateStr !== 'string') return false;
-  const m = /^\d{4}-\d{2}-\d{2}$/.exec(dateStr);
-  if (!m) return false;
-  const d = new Date(dateStr);
-  if (Number.isNaN(d.getTime())) return false;
-  return d.toISOString().slice(0, 10) === dateStr;
-}
+function isValidDateISO(dateStr) {}
 
 function parseCsv(content = '') {
killedBy: attendanceService isValidDateISO detects valid/invalid
statusReason: expected undefined to be true

[Killed] EqualityOperator
services/attendanceService.js:16:7
 }
 
 function isValidDateISO(dateStr) {
-  if (typeof dateStr !== 'string') return false;
+  if (typeof dateStr === 'string') return false;
   const m = /^\d{4}-\d{2}-\d{2}$/.exec(dateStr);
   if (!m) return false;
killedBy: attendanceService isValidDateISO detects valid/invalid
statusReason: expected false to be true

[Killed] ConditionalExpression
services/attendanceService.js:16:7
 }
 
 function isValidDateISO(dateStr) {
-  if (typeof dateStr !== 'string') return false;
+  if (true) return false;
   const m = /^\d{4}-\d{2}-\d{2}$/.exec(dateStr);
   if (!m) return false;
killedBy: attendanceService isValidDateISO detects valid/invalid
statusReason: expected false to be true

[Killed] Regex
services/attendanceService.js:17:13
 
 function isValidDateISO(dateStr) {
   if (typeof dateStr !== 'string') return false;
-  const m = /^\d{4}-\d{2}-\d{2}$/.exec(dateStr);
+  const m = /^\d{4}-\D{2}-\d{2}$/.exec(dateStr);
   if (!m) return false;
   const d = new Date(dateStr);
killedBy: attendanceService isValidDateISO detects valid/invalid
statusReason: expected false to be true

[Killed] BooleanLiteral
services/attendanceService.js:18:18
 function isValidDateISO(dateStr) {
   if (typeof dateStr !== 'string') return false;
   const m = /^\d{4}-\d{2}-\d{2}$/.exec(dateStr);
-  if (!m) return false;
+  if (!m) return true;
   const d = new Date(dateStr);
   if (Number.isNaN(d.getTime())) return false;
killedBy: attendanceService isValidDateISO detects valid/invalid
statusReason: expected true to be false

[Killed] ConditionalExpression
services/attendanceService.js:18:7
 function isValidDateISO(dateStr) {
   if (typeof dateStr !== 'string') return false;
   const m = /^\d{4}-\d{2}-\d{2}$/.exec(dateStr);
-  if (!m) return false;
+  if (true) return false;
   const d = new Date(dateStr);
   if (Number.isNaN(d.getTime())) return false;
killedBy: attendanceService isValidDateISO detects valid/invalid
statusReason: expected false to be true

[Killed] BooleanLiteral
services/attendanceService.js:20:41
   const m = /^\d{4}-\d{2}-\d{2}$/.exec(dateStr);
   if (!m) return false;
   const d = new Date(dateStr);
-  if (Number.isNaN(d.getTime())) return false;
+  if (Number.isNaN(d.getTime())) return true;
   return d.toISOString().slice(0, 10) === dateStr;
 }
killedBy: attendanceService isValidDateISO detects valid/invalid
statusReason: expected true to be false

[Killed] ConditionalExpression
services/attendanceService.js:20:7
   const m = /^\d{4}-\d{2}-\d{2}$/.exec(dateStr);
   if (!m) return false;
   const d = new Date(dateStr);
-  if (Number.isNaN(d.getTime())) return false;
+  if (false) return false;
   return d.toISOString().slice(0, 10) === dateStr;
 }
killedBy: attendanceService isValidDateISO detects valid/invalid
statusReason: Invalid time value

[Killed] ConditionalExpression
services/attendanceService.js:21:10
   if (!m) return false;
   const d = new Date(dateStr);
   if (Number.isNaN(d.getTime())) return false;
-  return d.toISOString().slice(0, 10) === dateStr;
+  return false;
 }
 
killedBy: attendanceService isValidDateISO detects valid/invalid
statusReason: expected false to be true

[Killed] MethodExpression
services/attendanceService.js:21:10
   if (!m) return false;
   const d = new Date(dateStr);
   if (Number.isNaN(d.getTime())) return false;
-  return d.toISOString().slice(0, 10) === dateStr;
+  return d.toISOString() === dateStr;
 }
 
killedBy: attendanceService isValidDateISO detects valid/invalid
statusReason: expected false to be true

[NoCoverage] StringLiteral
services/attendanceService.js:24:29
   return d.toISOString().slice(0, 10) === dateStr;
 }
 
-function parseCsv(content = '') {
+function parseCsv(content = "Stryker was here!") {
   const lines = content.split(/\r?\n/).map(l => l.trim()).filter(l => l.length > 0);
   const result = [];

[Killed] EqualityOperator
services/attendanceService.js:25:71
 }
 
 function parseCsv(content = '') {
-  const lines = content.split(/\r?\n/).map(l => l.trim()).filter(l => l.length > 0);
+  const lines = content.split(/\r?\n/).map(l => l.trim()).filter(l => l.length <= 0);
   const result = [];
   const errors = [];
killedBy: attendanceService parseCsv parses good CSV and reports errors for bad
statusReason: expected 1 to equal +0

[Killed] ArrowFunction
services/attendanceService.js:25:66
 }
 
 function parseCsv(content = '') {
-  const lines = content.split(/\r?\n/).map(l => l.trim()).filter(l => l.length > 0);
+  const lines = content.split(/\r?\n/).map(l => l.trim()).filter(() => undefined);
   const result = [];
   const errors = [];
killedBy: attendanceService parseCsv parses good CSV and reports errors for bad
statusReason: expected 1 to equal +0

[Killed] ArrayDeclaration
services/attendanceService.js:27:18
 function parseCsv(content = '') {
   const lines = content.split(/\r?\n/).map(l => l.trim()).filter(l => l.length > 0);
   const result = [];
-  const errors = [];
+  const errors = ["Stryker was here"];
   if (lines.length === 0) {
     errors.push('empty csv');
killedBy: attendanceService parseCsv parses good CSV and reports errors for bad
statusReason: expected 1 to equal +0

[Killed] EqualityOperator
services/attendanceService.js:28:7
   const lines = content.split(/\r?\n/).map(l => l.trim()).filter(l => l.length > 0);
   const result = [];
   const errors = [];
-  if (lines.length === 0) {
+  if (lines.length !== 0) {
     errors.push('empty csv');
     return { rows: result, errors };
killedBy: attendanceService parseCsv parses good CSV and reports errors for bad
statusReason: expected 1 to equal +0

[Killed] ConditionalExpression
services/attendanceService.js:28:7
   const lines = content.split(/\r?\n/).map(l => l.trim()).filter(l => l.length > 0);
   const result = [];
   const errors = [];
-  if (lines.length === 0) {
+  if (true) {
     errors.push('empty csv');
     return { rows: result, errors };
killedBy: attendanceService parseCsv parses good CSV and reports errors for bad
statusReason: expected 1 to equal +0

[NoCoverage] StringLiteral
services/attendanceService.js:29:17
   const result = [];
   const errors = [];
   if (lines.length === 0) {
-    errors.push('empty csv');
+    errors.push("");
     return { rows: result, errors };
   }

[NoCoverage] ObjectLiteral
services/attendanceService.js:30:12
   const errors = [];
   if (lines.length === 0) {
     errors.push('empty csv');
-    return { rows: result, errors };
+    return {};
   }
   const header = lines[0].split(',').map(h => h.trim());

[Killed] ArrowFunction
services/attendanceService.js:32:42
     errors.push('empty csv');
     return { rows: result, errors };
   }
-  const header = lines[0].split(',').map(h => h.trim());
+  const header = lines[0].split(',').map(() => undefined);
   const required = ['studentId','courseId','date','status'];
   const hasRequired = required.every(k => header.includes(k));
killedBy: attendanceService parseCsv parses good CSV and reports errors for bad
statusReason: expected 1 to equal +0

[Survived] MethodExpression
services/attendanceService.js:32:47
     errors.push('empty csv');
     return { rows: result, errors };
   }
-  const header = lines[0].split(',').map(h => h.trim());
+  const header = lines[0].split(',').map(h => h);
   const required = ['studentId','courseId','date','status'];
   const hasRequired = required.every(k => header.includes(k));

[Killed] StringLiteral
services/attendanceService.js:33:33
     return { rows: result, errors };
   }
   const header = lines[0].split(',').map(h => h.trim());
-  const required = ['studentId','courseId','date','status'];
+  const required = ['studentId',"",'date','status'];
   const hasRequired = required.every(k => header.includes(k));
   if (!hasRequired) {
killedBy: attendanceService parseCsv parses good CSV and reports errors for bad
statusReason: expected 1 to equal +0

[Survived] ArrayDeclaration
services/attendanceService.js:33:20
     return { rows: result, errors };
   }
   const header = lines[0].split(',').map(h => h.trim());
-  const required = ['studentId','courseId','date','status'];
+  const required = [];
   const hasRequired = required.every(k => header.includes(k));
   if (!hasRequired) {

[Killed] ArrowFunction
services/attendanceService.js:34:38
   }
   const header = lines[0].split(',').map(h => h.trim());
   const required = ['studentId','courseId','date','status'];
-  const hasRequired = required.every(k => header.includes(k));
+  const hasRequired = required.every(() => undefined);
   if (!hasRequired) {
     errors.push(`csv header must include: ${required.join(',')}`);
killedBy: attendanceService parseCsv parses good CSV and reports errors for bad
statusReason: expected 1 to equal +0

[Survived] MethodExpression
services/attendanceService.js:34:23
   }
   const header = lines[0].split(',').map(h => h.trim());
   const required = ['studentId','courseId','date','status'];
-  const hasRequired = required.every(k => header.includes(k));
+  const hasRequired = required.some(k => header.includes(k));
   if (!hasRequired) {
     errors.push(`csv header must include: ${required.join(',')}`);

[Killed] ConditionalExpression
services/attendanceService.js:35:7
   const header = lines[0].split(',').map(h => h.trim());
   const required = ['studentId','courseId','date','status'];
   const hasRequired = required.every(k => header.includes(k));
-  if (!hasRequired) {
+  if (true) {
     errors.push(`csv header must include: ${required.join(',')}`);
     return { rows: result, errors };
killedBy: attendanceService parseCsv parses good CSV and reports errors for bad
statusReason: expected 1 to equal +0

[Killed] BooleanLiteral
services/attendanceService.js:35:7
   const header = lines[0].split(',').map(h => h.trim());
   const required = ['studentId','courseId','date','status'];
   const hasRequired = required.every(k => header.includes(k));
-  if (!hasRequired) {
+  if (hasRequired) {
     errors.push(`csv header must include: ${required.join(',')}`);
     return { rows: result, errors };
killedBy: attendanceService parseCsv parses good CSV and reports errors for bad
statusReason: expected 1 to equal +0

[NoCoverage] StringLiteral
services/attendanceService.js:36:17
   const required = ['studentId','courseId','date','status'];
   const hasRequired = required.every(k => header.includes(k));
   if (!hasRequired) {
-    errors.push(`csv header must include: ${required.join(',')}`);
+    errors.push(``);
     return { rows: result, errors };
   }

[NoCoverage] ObjectLiteral
services/attendanceService.js:37:12
   const hasRequired = required.every(k => header.includes(k));
   if (!hasRequired) {
     errors.push(`csv header must include: ${required.join(',')}`);
-    return { rows: result, errors };
+    return {};
   }
   const idx = {};

[Killed] ArrowFunction
services/attendanceService.js:40:18
     return { rows: result, errors };
   }
   const idx = {};
-  header.forEach((h, i) => idx[h] = i);
+  header.forEach(() => undefined);
   for (let i = 1; i < lines.length; i++) {
     const line = lines[i];
killedBy: attendanceService parseCsv parses good CSV and reports errors for bad
statusReason: expected 2 to equal +0

[Killed] EqualityOperator
services/attendanceService.js:41:19
   }
   const idx = {};
   header.forEach((h, i) => idx[h] = i);
-  for (let i = 1; i < lines.length; i++) {
+  for (let i = 1; i <= lines.length; i++) {
     const line = lines[i];
     const cols = line.split(',').map(c => c.trim());
killedBy: attendanceService parseCsv parses good CSV and reports errors for bad
statusReason: Cannot read properties of undefined (reading 'split')

[Killed] ConditionalExpression
services/attendanceService.js:41:19
   }
   const idx = {};
   header.forEach((h, i) => idx[h] = i);
-  for (let i = 1; i < lines.length; i++) {
+  for (let i = 1; false; i++) {
     const line = lines[i];
     const cols = line.split(',').map(c => c.trim());
killedBy: attendanceService parseCsv parses good CSV and reports errors for bad
statusReason: expected +0 to equal 2

[Killed] ArrowFunction
services/attendanceService.js:43:38
   header.forEach((h, i) => idx[h] = i);
   for (let i = 1; i < lines.length; i++) {
     const line = lines[i];
-    const cols = line.split(',').map(c => c.trim());
+    const cols = line.split(',').map(() => undefined);
     const obj = {};
     for (const k of header) {
killedBy: attendanceService parseCsv parses good CSV and reports errors for bad
statusReason: expected 2 to equal +0

[Survived] MethodExpression
services/attendanceService.js:43:43
   header.forEach((h, i) => idx[h] = i);
   for (let i = 1; i < lines.length; i++) {
     const line = lines[i];
-    const cols = line.split(',').map(c => c.trim());
+    const cols = line.split(',').map(c => c);
     const obj = {};
     for (const k of header) {

[Killed] BlockStatement
services/attendanceService.js:45:29
     const line = lines[i];
     const cols = line.split(',').map(c => c.trim());
     const obj = {};
-    for (const k of header) {
-      obj[k] = cols[idx[k]] !== undefined ? cols[idx[k]] : '';
-    }
+    for (const k of header) {}
     // basic validation
     if (!obj.studentId || !obj.courseId) {
killedBy: attendanceService parseCsv parses good CSV and reports errors for bad
statusReason: expected 2 to equal +0

[Killed] EqualityOperator
services/attendanceService.js:46:16
     const cols = line.split(',').map(c => c.trim());
     const obj = {};
     for (const k of header) {
-      obj[k] = cols[idx[k]] !== undefined ? cols[idx[k]] : '';
+      obj[k] = cols[idx[k]] === undefined ? cols[idx[k]] : '';
     }
     // basic validation
killedBy: attendanceService parseCsv parses good CSV and reports errors for bad
statusReason: expected 2 to equal +0

[Killed] ConditionalExpression
services/attendanceService.js:46:16
     const cols = line.split(',').map(c => c.trim());
     const obj = {};
     for (const k of header) {
-      obj[k] = cols[idx[k]] !== undefined ? cols[idx[k]] : '';
+      obj[k] = false ? cols[idx[k]] : '';
     }
     // basic validation
killedBy: attendanceService parseCsv parses good CSV and reports errors for bad
statusReason: expected 2 to equal +0

[Killed] BooleanLiteral
services/attendanceService.js:49:9
       obj[k] = cols[idx[k]] !== undefined ? cols[idx[k]] : '';
     }
     // basic validation
-    if (!obj.studentId || !obj.courseId) {
+    if (obj.studentId || !obj.courseId) {
       errors.push(`line ${i+1}: missing studentId or courseId`);
       continue;
killedBy: attendanceService parseCsv parses good CSV and reports errors for bad
statusReason: expected 2 to equal +0

[Killed] ConditionalExpression
services/attendanceService.js:49:9
       obj[k] = cols[idx[k]] !== undefined ? cols[idx[k]] : '';
     }
     // basic validation
-    if (!obj.studentId || !obj.courseId) {
+    if (false) {
       errors.push(`line ${i+1}: missing studentId or courseId`);
       continue;
killedBy: attendanceService parseCsv parses good CSV and reports errors for bad
statusReason: expected +0 to be above +0

[Survived] ArithmeticOperator
services/attendanceService.js:50:27
     }
     // basic validation
     if (!obj.studentId || !obj.courseId) {
-      errors.push(`line ${i+1}: missing studentId or courseId`);
+      errors.push(`line ${i - 1}: missing studentId or courseId`);
       continue;
     }

[Killed] ConditionalExpression
services/attendanceService.js:53:9
       errors.push(`line ${i+1}: missing studentId or courseId`);
       continue;
     }
-    if (!isValidDateISO(obj.date)) {
+    if (true) {
       errors.push(`line ${i+1}: invalid date ${obj.date}`);
       continue;
killedBy: attendanceService parseCsv parses good CSV and reports errors for bad
statusReason: expected 2 to equal +0

[Killed] BooleanLiteral
services/attendanceService.js:53:9
       errors.push(`line ${i+1}: missing studentId or courseId`);
       continue;
     }
-    if (!isValidDateISO(obj.date)) {
+    if (isValidDateISO(obj.date)) {
       errors.push(`line ${i+1}: invalid date ${obj.date}`);
       continue;
killedBy: attendanceService parseCsv parses good CSV and reports errors for bad
statusReason: expected 2 to equal +0

[NoCoverage] ArithmeticOperator
services/attendanceService.js:54:27
       continue;
     }
     if (!isValidDateISO(obj.date)) {
-      errors.push(`line ${i+1}: invalid date ${obj.date}`);
+      errors.push(`line ${i - 1}: invalid date ${obj.date}`);
       continue;
     }

[Killed] LogicalOperator
services/attendanceService.js:57:21
       errors.push(`line ${i+1}: invalid date ${obj.date}`);
       continue;
     }
-    const status = (obj.status || '').toLowerCase();
+    const status = (obj.status && '').toLowerCase();
     if (!['present','absent'].includes(status)) {
       errors.push(`line ${i+1}: invalid status ${obj.status}`);
killedBy: attendanceService parseCsv parses good CSV and reports errors for bad
statusReason: expected 2 to equal +0

[Killed] ConditionalExpression
services/attendanceService.js:57:21
       errors.push(`line ${i+1}: invalid date ${obj.date}`);
       continue;
     }
-    const status = (obj.status || '').toLowerCase();
+    const status = (true).toLowerCase();
     if (!['present','absent'].includes(status)) {
       errors.push(`line ${i+1}: invalid status ${obj.status}`);
killedBy: attendanceService parseCsv parses good CSV and reports errors for bad
statusReason: (intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value).toLowerCase is not a function

[Killed] BooleanLiteral
services/attendanceService.js:58:9
       continue;
     }
     const status = (obj.status || '').toLowerCase();
-    if (!['present','absent'].includes(status)) {
+    if (['present', 'absent'].includes(status)) {
       errors.push(`line ${i+1}: invalid status ${obj.status}`);
       continue;
killedBy: attendanceService parseCsv parses good CSV and reports errors for bad
statusReason: expected 2 to equal +0

[Killed] ConditionalExpression
services/attendanceService.js:58:9
       continue;
     }
     const status = (obj.status || '').toLowerCase();
-    if (!['present','absent'].includes(status)) {
+    if (true) {
       errors.push(`line ${i+1}: invalid status ${obj.status}`);
       continue;
killedBy: attendanceService parseCsv parses good CSV and reports errors for bad
statusReason: expected 2 to equal +0

[NoCoverage] ArithmeticOperator
services/attendanceService.js:59:27
     }
     const status = (obj.status || '').toLowerCase();
     if (!['present','absent'].includes(status)) {
-      errors.push(`line ${i+1}: invalid status ${obj.status}`);
+      errors.push(`line ${i - 1}: invalid status ${obj.status}`);
       continue;
     }

[Killed] ObjectLiteral
services/attendanceService.js:65:10
     obj.status = status;
     result.push(obj);
   }
-  return { rows: result, errors };
+  return {};
 }
 
killedBy: attendanceService parseCsv parses good CSV and reports errors for bad
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] BlockStatement
services/attendanceService.js:68:66
   return { rows: result, errors };
 }
 
-function calculateAttendancePercentage(presentCount, totalCount) {
-  if (totalCount === 0) return 0;
-  return (totalCount === 0) ? 0 : Math.round((presentCount / totalCount) * 100 * 100) / 100;
-}
+function calculateAttendancePercentage(presentCount, totalCount) {}
 
 module.exports = {
killedBy: attendanceService calculateAttendancePercentage returns rounded percent
statusReason: expected undefined to equal 80

[Killed] ConditionalExpression
services/attendanceService.js:69:7
 }
 
 function calculateAttendancePercentage(presentCount, totalCount) {
-  if (totalCount === 0) return 0;
+  if (true) return 0;
   return (totalCount === 0) ? 0 : Math.round((presentCount / totalCount) * 100 * 100) / 100;
 }
killedBy: attendanceService calculateAttendancePercentage returns rounded percent
statusReason: expected +0 to equal 80

[Killed] EqualityOperator
services/attendanceService.js:69:7
 }
 
 function calculateAttendancePercentage(presentCount, totalCount) {
-  if (totalCount === 0) return 0;
+  if (totalCount !== 0) return 0;
   return (totalCount === 0) ? 0 : Math.round((presentCount / totalCount) * 100 * 100) / 100;
 }
killedBy: attendanceService calculateAttendancePercentage returns rounded percent
statusReason: expected +0 to equal 80

[Killed] ArithmeticOperator
services/attendanceService.js:70:47
 
 function calculateAttendancePercentage(presentCount, totalCount) {
   if (totalCount === 0) return 0;
-  return (totalCount === 0) ? 0 : Math.round((presentCount / totalCount) * 100 * 100) / 100;
+  return (totalCount === 0) ? 0 : Math.round((presentCount * totalCount) * 100 * 100) / 100;
 }
 
killedBy: attendanceService calculateAttendancePercentage returns rounded percent
statusReason: expected 8000 to equal 80

[Killed] ArithmeticOperator
services/attendanceService.js:70:46
 
 function calculateAttendancePercentage(presentCount, totalCount) {
   if (totalCount === 0) return 0;
-  return (totalCount === 0) ? 0 : Math.round((presentCount / totalCount) * 100 * 100) / 100;
+  return (totalCount === 0) ? 0 : Math.round(presentCount / totalCount / 100 * 100) / 100;
 }
 
killedBy: attendanceService calculateAttendancePercentage returns rounded percent
statusReason: expected 0.01 to equal 80
