[Killed] EqualityOperator
routes/attendance.js:7:7
 const db = require('../db');
 
 function isIntegerLike(v) {
-  if (v === null || v === undefined) return false;
+  if (v !== null || v === undefined) return false;
   if (typeof v === 'number' && Number.isInteger(v)) return true;
   if (typeof v === 'string') return /^\d+$/.test(v);
killedBy: Attendance Integration Tests (safe) POST /api/attendance → creates attendance record (201) and record retrievable
statusReason: expected 201 "Created", got 400 "Bad Request"

[Killed] EqualityOperator
routes/attendance.js:7:21
 const db = require('../db');
 
 function isIntegerLike(v) {
-  if (v === null || v === undefined) return false;
+  if (v === null || v !== undefined) return false;
   if (typeof v === 'number' && Number.isInteger(v)) return true;
   if (typeof v === 'string') return /^\d+$/.test(v);
killedBy: Attendance Integration Tests (safe) POST /api/attendance → creates attendance record (201) and record retrievable
statusReason: expected 201 "Created", got 400 "Bad Request"

[Killed] EqualityOperator
routes/attendance.js:8:7
 
 function isIntegerLike(v) {
   if (v === null || v === undefined) return false;
-  if (typeof v === 'number' && Number.isInteger(v)) return true;
+  if (typeof v !== 'number' && Number.isInteger(v)) return true;
   if (typeof v === 'string') return /^\d+$/.test(v);
   return false;
killedBy: Attendance Integration Tests (safe) POST /api/attendance → creates attendance record (201) and record retrievable
statusReason: expected 201 "Created", got 400 "Bad Request"

[Survived] LogicalOperator
routes/attendance.js:8:7
 
 function isIntegerLike(v) {
   if (v === null || v === undefined) return false;
-  if (typeof v === 'number' && Number.isInteger(v)) return true;
+  if (typeof v === 'number' || Number.isInteger(v)) return true;
   if (typeof v === 'string') return /^\d+$/.test(v);
   return false;

[Survived] EqualityOperator
routes/attendance.js:9:7
 function isIntegerLike(v) {
   if (v === null || v === undefined) return false;
   if (typeof v === 'number' && Number.isInteger(v)) return true;
-  if (typeof v === 'string') return /^\d+$/.test(v);
+  if (typeof v !== 'string') return /^\d+$/.test(v);
   return false;
 }

[Survived] Regex
routes/attendance.js:9:37
 function isIntegerLike(v) {
   if (v === null || v === undefined) return false;
   if (typeof v === 'number' && Number.isInteger(v)) return true;
-  if (typeof v === 'string') return /^\d+$/.test(v);
+  if (typeof v === 'string') return /^\D+$/.test(v);
   return false;
 }

[Killed] EqualityOperator
routes/attendance.js:23:16
     if (!payload.date) errors.push('date required');
     if (!payload.status) errors.push('status required');
   }
-  return { ok: errors.length === 0, errors };
+  return { ok: errors.length !== 0, errors };
 }
 
killedBy: Attendance Integration Tests (safe) POST /api/attendance → creates attendance record (201) and record retrievable
statusReason: expected 201 "Created", got 400 "Bad Request"

[Survived] LogicalOperator
routes/attendance.js:27:7
 }
 
 async function fetchCreated(database, maybeId, whereClause, params) {
-  if (maybeId !== undefined && maybeId !== null) {
+  if (maybeId !== undefined || maybeId !== null) {
     try {
       const byId = await database.get(`SELECT * FROM attendance WHERE id = ?`, [maybeId]);

[Survived] EqualityOperator
routes/attendance.js:27:7
 }
 
 async function fetchCreated(database, maybeId, whereClause, params) {
-  if (maybeId !== undefined && maybeId !== null) {
+  if (maybeId === undefined && maybeId !== null) {
     try {
       const byId = await database.get(`SELECT * FROM attendance WHERE id = ?`, [maybeId]);

[Killed] LogicalOperator
routes/attendance.js:42:21
   try {
     const database = db.getDb();
     const rows = await database.all('SELECT studentId, courseId, date, status, id FROM attendance ORDER BY date DESC');
-    return res.json(rows || []);
+    return res.json(rows && []);
   } catch (err) {
     console.error('GET /api/attendance error', err);
killedBy: Attendance Integration Tests (safe) POST /api/attendance → creates attendance record (201) and record retrievable
statusReason: expected undefined to exist

[Killed] LogicalOperator
routes/attendance.js:51:21
 
 router.post('/', async (req, res) => {
   try {
-    const payload = req.body || {};
+    const payload = req.body && {};
     const v = validateAttendancePayload(payload);
     if (!v.ok) return res.status(400).json({ errors: v.errors });
killedBy: Attendance Integration Tests (safe) POST /api/attendance → creates attendance record (201) and record retrievable
statusReason: expected 201 "Created", got 400 "Bad Request"

[Killed] ObjectLiteral
routes/attendance.js:53:44
   try {
     const payload = req.body || {};
     const v = validateAttendancePayload(payload);
-    if (!v.ok) return res.status(400).json({ errors: v.errors });
+    if (!v.ok) return res.status(400).json({});
 
     const studentId = isIntegerLike(payload.studentId) ? Number(payload.studentId) : payload.studentId;
killedBy: Attendance Integration Tests (safe) POST /api/attendance → validation: missing fields returns 400
statusReason: expected false to equal true

[Survived] LogicalOperator
routes/attendance.js:68:9
 
     // extract maybeId defensively
     let maybeId = null;
-    if (result && typeof result === 'object') {
+    if (result || typeof result === 'object') {
       if (result.lastID !== undefined) maybeId = result.lastID;
       else if (Array.isArray(result) && result[0] && result[0].lastID !== undefined) maybeId = result[0].lastID;

[Survived] EqualityOperator
routes/attendance.js:68:19
 
     // extract maybeId defensively
     let maybeId = null;
-    if (result && typeof result === 'object') {
+    if (result && typeof result !== 'object') {
       if (result.lastID !== undefined) maybeId = result.lastID;
       else if (Array.isArray(result) && result[0] && result[0].lastID !== undefined) maybeId = result[0].lastID;

[Survived] EqualityOperator
routes/attendance.js:69:11
     // extract maybeId defensively
     let maybeId = null;
     if (result && typeof result === 'object') {
-      if (result.lastID !== undefined) maybeId = result.lastID;
+      if (result.lastID === undefined) maybeId = result.lastID;
       else if (Array.isArray(result) && result[0] && result[0].lastID !== undefined) maybeId = result[0].lastID;
     }

[Killed] LogicalOperator
routes/attendance.js:70:16
     let maybeId = null;
     if (result && typeof result === 'object') {
       if (result.lastID !== undefined) maybeId = result.lastID;
-      else if (Array.isArray(result) && result[0] && result[0].lastID !== undefined) maybeId = result[0].lastID;
+      else if (Array.isArray(result) || result[0] && result[0].lastID !== undefined) maybeId = result[0].lastID;
     }
 
killedBy: Attendance Integration Tests (safe) POST /api/attendance → creates attendance record (201) and record retrievable
statusReason: expected 201 "Created", got 500 "Internal Server Error"

[Killed] LogicalOperator
routes/attendance.js:70:16
     let maybeId = null;
     if (result && typeof result === 'object') {
       if (result.lastID !== undefined) maybeId = result.lastID;
-      else if (Array.isArray(result) && result[0] && result[0].lastID !== undefined) maybeId = result[0].lastID;
+      else if (Array.isArray(result) && result[0] || result[0].lastID !== undefined) maybeId = result[0].lastID;
     }
 
killedBy: Attendance Integration Tests (safe) POST /api/attendance → creates attendance record (201) and record retrievable
statusReason: expected 201 "Created", got 500 "Internal Server Error"
