[Killed] EqualityOperator
routes/courses.js:11:26
   if (!payload) {
     errors.push('payload required');
   } else {
-    if (!payload.code || String(payload.code).trim() === '') errors.push('code required');
+    if (!payload.code || String(payload.code).trim() !== '') errors.push('code required');
     if (!payload.title || String(payload.title).trim() === '') errors.push('title required');
     // credits optional but if present should be numeric
killedBy: Attendance Integration Tests (safe) GET /api/attendance → returns array
statusReason: expected 201 "Created", got 400 "Bad Request"

[Survived] MethodExpression
routes/courses.js:11:26
   if (!payload) {
     errors.push('payload required');
   } else {
-    if (!payload.code || String(payload.code).trim() === '') errors.push('code required');
+    if (!payload.code || String(payload.code) === '') errors.push('code required');
     if (!payload.title || String(payload.title).trim() === '') errors.push('title required');
     // credits optional but if present should be numeric

[Killed] EqualityOperator
routes/courses.js:12:27
     errors.push('payload required');
   } else {
     if (!payload.code || String(payload.code).trim() === '') errors.push('code required');
-    if (!payload.title || String(payload.title).trim() === '') errors.push('title required');
+    if (!payload.title || String(payload.title).trim() !== '') errors.push('title required');
     // credits optional but if present should be numeric
     if (payload.credits !== undefined && payload.credits !== null) {
killedBy: Attendance Integration Tests (safe) GET /api/attendance → returns array
statusReason: expected 201 "Created", got 400 "Bad Request"

[Survived] LogicalOperator
routes/courses.js:12:9
     errors.push('payload required');
   } else {
     if (!payload.code || String(payload.code).trim() === '') errors.push('code required');
-    if (!payload.title || String(payload.title).trim() === '') errors.push('title required');
+    if (!payload.title && String(payload.title).trim() === '') errors.push('title required');
     // credits optional but if present should be numeric
     if (payload.credits !== undefined && payload.credits !== null) {

[Survived] EqualityOperator
routes/courses.js:14:9
     if (!payload.code || String(payload.code).trim() === '') errors.push('code required');
     if (!payload.title || String(payload.title).trim() === '') errors.push('title required');
     // credits optional but if present should be numeric
-    if (payload.credits !== undefined && payload.credits !== null) {
+    if (payload.credits === undefined && payload.credits !== null) {
       const c = Number(payload.credits);
       if (Number.isNaN(c)) errors.push('credits must be a number');

[Survived] LogicalOperator
routes/courses.js:14:9
     if (!payload.code || String(payload.code).trim() === '') errors.push('code required');
     if (!payload.title || String(payload.title).trim() === '') errors.push('title required');
     // credits optional but if present should be numeric
-    if (payload.credits !== undefined && payload.credits !== null) {
+    if (payload.credits !== undefined || payload.credits !== null) {
       const c = Number(payload.credits);
       if (Number.isNaN(c)) errors.push('credits must be a number');

[Survived] EqualityOperator
routes/courses.js:23:32
 }
 
 async function fetchCreatedCourse(database, maybeId, code, title) {
-  if (maybeId !== undefined && maybeId !== null) {
+  if (maybeId !== undefined && maybeId === null) {
     try {
       const byId = await database.get('SELECT * FROM courses WHERE id = ?', [maybeId]);

[Survived] LogicalOperator
routes/courses.js:23:7
 }
 
 async function fetchCreatedCourse(database, maybeId, code, title) {
-  if (maybeId !== undefined && maybeId !== null) {
+  if (maybeId !== undefined || maybeId !== null) {
     try {
       const byId = await database.get('SELECT * FROM courses WHERE id = ?', [maybeId]);

[Killed] LogicalOperator
routes/courses.js:38:21
   try {
     const database = db.getDb();
     const rows = await database.all('SELECT id, code, title, credits FROM courses');
-    return res.json(rows || []);
+    return res.json(rows && []);
   } catch (err) {
     console.error('GET /api/courses error', err);
killedBy: Courses Integration Tests (safe) POST /api/courses → creates course (201) and GET contains it
statusReason: expected undefined to exist

[Survived] ObjectLiteral
routes/courses.js:41:33
     return res.json(rows || []);
   } catch (err) {
     console.error('GET /api/courses error', err);
-    return res.status(500).json({ error: err.message });
+    return res.status(500).json({});
   }
 });

[Killed] ObjectLiteral
routes/courses.js:49:44
   try {
     const payload = req.body || {};
     const v = validateCoursePayload(payload);
-    if (!v.ok) return res.status(400).json({ errors: v.errors });
+    if (!v.ok) return res.status(400).json({});
 
     const code = String(payload.code).trim();
killedBy: Courses Integration Tests (safe) POST /api/courses → validation: missing title or code returns 400
statusReason: expected false to equal true

[Survived] MethodExpression
routes/courses.js:51:18
     const v = validateCoursePayload(payload);
     if (!v.ok) return res.status(400).json({ errors: v.errors });
 
-    const code = String(payload.code).trim();
+    const code = String(payload.code);
     const title = String(payload.title).trim();
     const credits = payload.credits !== undefined && payload.credits !== null ? Number(payload.credits) : null;

[Survived] MethodExpression
routes/courses.js:52:19
     if (!v.ok) return res.status(400).json({ errors: v.errors });
 
     const code = String(payload.code).trim();
-    const title = String(payload.title).trim();
+    const title = String(payload.title);
     const credits = payload.credits !== undefined && payload.credits !== null ? Number(payload.credits) : null;
 

[Survived] EqualityOperator
routes/courses.js:53:21
 
     const code = String(payload.code).trim();
     const title = String(payload.title).trim();
-    const credits = payload.credits !== undefined && payload.credits !== null ? Number(payload.credits) : null;
+    const credits = payload.credits === undefined && payload.credits !== null ? Number(payload.credits) : null;
 
     const database = db.getDb();

[Survived] EqualityOperator
routes/courses.js:53:54
 
     const code = String(payload.code).trim();
     const title = String(payload.title).trim();
-    const credits = payload.credits !== undefined && payload.credits !== null ? Number(payload.credits) : null;
+    const credits = payload.credits !== undefined && payload.credits === null ? Number(payload.credits) : null;
 
     const database = db.getDb();
