[NoCoverage] BlockStatement
services/courseService.js:4:30
 // services/courseService.js
 // Pure helpers for course logic (no DB)
 
-function rowToCourse(r = {}) {
-  if (!r) return null;
-  return {
-    id: r.id,
-    code: r.code || '',
-    name: r.name || '',
-    instructor: r.instructor || ''
-  };
-}
+function rowToCourse(r = {}) {}
 
 function normalizeCourseCode(code) {

[NoCoverage] ConditionalExpression
services/courseService.js:5:7
 // Pure helpers for course logic (no DB)
 
 function rowToCourse(r = {}) {
-  if (!r) return null;
+  if (true) return null;
   return {
     id: r.id,

[NoCoverage] BooleanLiteral
services/courseService.js:5:7
 // Pure helpers for course logic (no DB)
 
 function rowToCourse(r = {}) {
-  if (!r) return null;
+  if (r) return null;
   return {
     id: r.id,

[NoCoverage] ConditionalExpression
services/courseService.js:8:11
   if (!r) return null;
   return {
     id: r.id,
-    code: r.code || '',
+    code: false,
     name: r.name || '',
     instructor: r.instructor || ''

[NoCoverage] ConditionalExpression
services/courseService.js:8:11
   if (!r) return null;
   return {
     id: r.id,
-    code: r.code || '',
+    code: true,
     name: r.name || '',
     instructor: r.instructor || ''

[NoCoverage] ConditionalExpression
services/courseService.js:9:11
   return {
     id: r.id,
     code: r.code || '',
-    name: r.name || '',
+    name: true,
     instructor: r.instructor || ''
   };

[NoCoverage] LogicalOperator
services/courseService.js:9:11
   return {
     id: r.id,
     code: r.code || '',
-    name: r.name || '',
+    name: r.name && '',
     instructor: r.instructor || ''
   };

[NoCoverage] LogicalOperator
services/courseService.js:10:17
     id: r.id,
     code: r.code || '',
     name: r.name || '',
-    instructor: r.instructor || ''
+    instructor: r.instructor && ''
   };
 }

[NoCoverage] ConditionalExpression
services/courseService.js:10:17
     id: r.id,
     code: r.code || '',
     name: r.name || '',
-    instructor: r.instructor || ''
+    instructor: true
   };
 }

[Killed] BlockStatement
services/courseService.js:14:36
   };
 }
 
-function normalizeCourseCode(code) {
-  if (!code) return '';
-  return String(code).toUpperCase().replace(/\s+/g, '');
-}
+function normalizeCourseCode(code) {}
 
 function validateCoursePayload(payload = {}) {
killedBy: courseService normalizeCourseCode uppercases and removes spaces
statusReason: expected undefined to equal 'CS101'

[Killed] ConditionalExpression
services/courseService.js:15:7
 }
 
 function normalizeCourseCode(code) {
-  if (!code) return '';
+  if (true) return '';
   return String(code).toUpperCase().replace(/\s+/g, '');
 }
killedBy: courseService normalizeCourseCode uppercases and removes spaces
statusReason: expected '' to equal 'CS101'

[Killed] BooleanLiteral
services/courseService.js:15:7
 }
 
 function normalizeCourseCode(code) {
-  if (!code) return '';
+  if (code) return '';
   return String(code).toUpperCase().replace(/\s+/g, '');
 }
killedBy: courseService normalizeCourseCode uppercases and removes spaces
statusReason: expected '' to equal 'CS101'

[Killed] MethodExpression
services/courseService.js:16:10
 
 function normalizeCourseCode(code) {
   if (!code) return '';
-  return String(code).toUpperCase().replace(/\s+/g, '');
+  return String(code).toLowerCase().replace(/\s+/g, '');
 }
 
killedBy: courseService normalizeCourseCode uppercases and removes spaces
statusReason: expected 'cs101' to equal 'CS101'

[Killed] Regex
services/courseService.js:16:45
 
 function normalizeCourseCode(code) {
   if (!code) return '';
-  return String(code).toUpperCase().replace(/\s+/g, '');
+  return String(code).toUpperCase().replace(/\S+/g, '');
 }
 
killedBy: courseService normalizeCourseCode uppercases and removes spaces
statusReason: expected '   ' to equal 'CS101'

[Killed] BlockStatement
services/courseService.js:19:46
   return String(code).toUpperCase().replace(/\s+/g, '');
 }
 
-function validateCoursePayload(payload = {}) {
-  if (!payload) return { ok: false, reason: 'no payload' };
-  const code = (payload.code || '').toString().trim();
-  const name = (payload.name || '').toString().trim();
-  if (!code || !name) return { ok: false, reason: 'code and name required' };
-  return { ok: true };
-}
+function validateCoursePayload(payload = {}) {}
 
 function buildCourseRecord(payload = {}) {
killedBy: courseService validateCoursePayload fails on missing
statusReason: Cannot read properties of undefined (reading 'ok')

[Killed] BooleanLiteral
services/courseService.js:20:30
 }
 
 function validateCoursePayload(payload = {}) {
-  if (!payload) return { ok: false, reason: 'no payload' };
+  if (!payload) return { ok: true, reason: 'no payload' };
   const code = (payload.code || '').toString().trim();
   const name = (payload.name || '').toString().trim();
killedBy: courseService validateCoursePayload fails on missing
statusReason: expected true to be false

[Killed] ConditionalExpression
services/courseService.js:20:7
 }
 
 function validateCoursePayload(payload = {}) {
-  if (!payload) return { ok: false, reason: 'no payload' };
+  if (false) return { ok: false, reason: 'no payload' };
   const code = (payload.code || '').toString().trim();
   const name = (payload.name || '').toString().trim();
killedBy: courseService validateCoursePayload fails on missing
statusReason: Cannot read properties of null (reading 'code')

[Killed] LogicalOperator
services/courseService.js:21:17
 
 function validateCoursePayload(payload = {}) {
   if (!payload) return { ok: false, reason: 'no payload' };
-  const code = (payload.code || '').toString().trim();
+  const code = (payload.code && '').toString().trim();
   const name = (payload.name || '').toString().trim();
   if (!code || !name) return { ok: false, reason: 'code and name required' };
killedBy: courseService validateCoursePayload fails on missing
statusReason: Cannot read properties of undefined (reading 'toString')

[Survived] ConditionalExpression
services/courseService.js:21:17
 
 function validateCoursePayload(payload = {}) {
   if (!payload) return { ok: false, reason: 'no payload' };
-  const code = (payload.code || '').toString().trim();
+  const code = (false).toString().trim();
   const name = (payload.name || '').toString().trim();
   if (!code || !name) return { ok: false, reason: 'code and name required' };

[Killed] LogicalOperator
services/courseService.js:22:17
 function validateCoursePayload(payload = {}) {
   if (!payload) return { ok: false, reason: 'no payload' };
   const code = (payload.code || '').toString().trim();
-  const name = (payload.name || '').toString().trim();
+  const name = (payload.name && '').toString().trim();
   if (!code || !name) return { ok: false, reason: 'code and name required' };
   return { ok: true };
killedBy: courseService validateCoursePayload fails on missing
statusReason: Cannot read properties of undefined (reading 'toString')

[Survived] ConditionalExpression
services/courseService.js:22:17
 function validateCoursePayload(payload = {}) {
   if (!payload) return { ok: false, reason: 'no payload' };
   const code = (payload.code || '').toString().trim();
-  const name = (payload.name || '').toString().trim();
+  const name = (true).toString().trim();
   if (!code || !name) return { ok: false, reason: 'code and name required' };
   return { ok: true };

[Killed] ConditionalExpression
services/courseService.js:23:7
   if (!payload) return { ok: false, reason: 'no payload' };
   const code = (payload.code || '').toString().trim();
   const name = (payload.name || '').toString().trim();
-  if (!code || !name) return { ok: false, reason: 'code and name required' };
+  if (false) return { ok: false, reason: 'code and name required' };
   return { ok: true };
 }
killedBy: courseService validateCoursePayload fails on missing
statusReason: expected true to be false

[Killed] BooleanLiteral
services/courseService.js:23:36
   if (!payload) return { ok: false, reason: 'no payload' };
   const code = (payload.code || '').toString().trim();
   const name = (payload.name || '').toString().trim();
-  if (!code || !name) return { ok: false, reason: 'code and name required' };
+  if (!code || !name) return { ok: true, reason: 'code and name required' };
   return { ok: true };
 }
killedBy: courseService validateCoursePayload fails on missing
statusReason: expected true to be false

[NoCoverage] BooleanLiteral
services/courseService.js:24:16
   const code = (payload.code || '').toString().trim();
   const name = (payload.name || '').toString().trim();
   if (!code || !name) return { ok: false, reason: 'code and name required' };
-  return { ok: true };
+  return { ok: false };
 }
 

[Killed] BlockStatement
services/courseService.js:27:42
   return { ok: true };
 }
 
-function buildCourseRecord(payload = {}) {
-  const p = payload || {};
-  return {
-    code: (p.code || '').toString().trim(),
-    name: (p.name || '').toString().trim(),
-    instructor: (p.instructor || '').toString().trim(),
-    credits: Number.isFinite(Number(p.credits)) ? Number(p.credits) : 0
-  };
-}
+function buildCourseRecord(payload = {}) {}
 
 module.exports = {
killedBy: courseService buildCourseRecord builds and defaults credits
statusReason: Cannot read properties of undefined (reading 'code')

[Killed] LogicalOperator
services/courseService.js:28:13
 }
 
 function buildCourseRecord(payload = {}) {
-  const p = payload || {};
+  const p = payload && {};
   return {
     code: (p.code || '').toString().trim(),
killedBy: courseService buildCourseRecord builds and defaults credits
statusReason: expected '' to equal 'cs101'

[Killed] ConditionalExpression
services/courseService.js:28:13
 }
 
 function buildCourseRecord(payload = {}) {
-  const p = payload || {};
+  const p = true;
   return {
     code: (p.code || '').toString().trim(),
killedBy: courseService buildCourseRecord builds and defaults credits
statusReason: expected '' to equal 'cs101'

[Killed] ConditionalExpression
services/courseService.js:30:12
 function buildCourseRecord(payload = {}) {
   const p = payload || {};
   return {
-    code: (p.code || '').toString().trim(),
+    code: (false).toString().trim(),
     name: (p.name || '').toString().trim(),
     instructor: (p.instructor || '').toString().trim(),
killedBy: courseService buildCourseRecord builds and defaults credits
statusReason: expected 'false' to equal 'cs101'

[Killed] LogicalOperator
services/courseService.js:30:12
 function buildCourseRecord(payload = {}) {
   const p = payload || {};
   return {
-    code: (p.code || '').toString().trim(),
+    code: (p.code && '').toString().trim(),
     name: (p.name || '').toString().trim(),
     instructor: (p.instructor || '').toString().trim(),
killedBy: courseService buildCourseRecord builds and defaults credits
statusReason: expected '' to equal 'cs101'

[Survived] LogicalOperator
services/courseService.js:31:12
   const p = payload || {};
   return {
     code: (p.code || '').toString().trim(),
-    name: (p.name || '').toString().trim(),
+    name: (p.name && '').toString().trim(),
     instructor: (p.instructor || '').toString().trim(),
     credits: Number.isFinite(Number(p.credits)) ? Number(p.credits) : 0

[Survived] ConditionalExpression
services/courseService.js:31:12
   const p = payload || {};
   return {
     code: (p.code || '').toString().trim(),
-    name: (p.name || '').toString().trim(),
+    name: (true).toString().trim(),
     instructor: (p.instructor || '').toString().trim(),
     credits: Number.isFinite(Number(p.credits)) ? Number(p.credits) : 0

[Killed] LogicalOperator
services/courseService.js:32:18
   return {
     code: (p.code || '').toString().trim(),
     name: (p.name || '').toString().trim(),
-    instructor: (p.instructor || '').toString().trim(),
+    instructor: (p.instructor && '').toString().trim(),
     credits: Number.isFinite(Number(p.credits)) ? Number(p.credits) : 0
   };
killedBy: courseService buildCourseRecord builds and defaults credits
statusReason: Cannot read properties of undefined (reading 'toString')

[Survived] MethodExpression
services/courseService.js:32:17
   return {
     code: (p.code || '').toString().trim(),
     name: (p.name || '').toString().trim(),
-    instructor: (p.instructor || '').toString().trim(),
+    instructor: (p.instructor || '').toString(),
     credits: Number.isFinite(Number(p.credits)) ? Number(p.credits) : 0
   };

[Killed] ObjectLiteral
services/courseService.js:37:18
   };
 }
 
-module.exports = {
-  rowToCourse,
-  normalizeCourseCode,
-  validateCoursePayload,
-  buildCourseRecord
-};
+module.exports = {};
 
killedBy: courseService normalizeCourseCode uppercases and removes spaces
statusReason: c.normalizeCourseCode is not a function
