[Survived] Regex
routes/enrollments.js:9:37
 function isIntegerLike(v) {
   if (v === null || v === undefined) return false;
   if (typeof v === 'number' && Number.isInteger(v)) return true;
-  if (typeof v === 'string') return /^\d+$/.test(v);
+  if (typeof v === 'string') return /^\d+/.test(v);
   return false;
 }

[Killed] EqualityOperator
routes/enrollments.js:21:43
     if (!isIntegerLike(payload.studentId)) errors.push('studentId required and must be integer-like');
     if (!isIntegerLike(payload.courseId)) errors.push('courseId required and must be integer-like');
     // semester optional but if present must be string
-    if (payload.semester !== undefined && typeof payload.semester !== 'string') errors.push('semester must be a string');
+    if (payload.semester !== undefined && typeof payload.semester === 'string') errors.push('semester must be a string');
   }
   return { ok: errors.length === 0, errors };
killedBy: Enrollments Integration Tests (safe) POST /api/enroll → creates enrollment and GET contains it
statusReason: expected 201 "Created", got 400 "Bad Request"

[Killed] LogicalOperator
routes/enrollments.js:21:9
     if (!isIntegerLike(payload.studentId)) errors.push('studentId required and must be integer-like');
     if (!isIntegerLike(payload.courseId)) errors.push('courseId required and must be integer-like');
     // semester optional but if present must be string
-    if (payload.semester !== undefined && typeof payload.semester !== 'string') errors.push('semester must be a string');
+    if (payload.semester !== undefined || typeof payload.semester !== 'string') errors.push('semester must be a string');
   }
   return { ok: errors.length === 0, errors };
killedBy: Enrollments Integration Tests (safe) POST /api/enroll → creates enrollment and GET contains it
statusReason: expected 201 "Created", got 400 "Bad Request"

[Survived] LogicalOperator
routes/enrollments.js:27:7
 }
 
 async function fetchCreatedEnrollment(database, maybeId, studentId, courseId, semester) {
-  if (maybeId !== undefined && maybeId !== null) {
+  if (maybeId !== undefined || maybeId !== null) {
     try {
       const byId = await database.get('SELECT * FROM enrollments WHERE id = ?', [maybeId]);

[Survived] EqualityOperator
routes/enrollments.js:27:32
 }
 
 async function fetchCreatedEnrollment(database, maybeId, studentId, courseId, semester) {
-  if (maybeId !== undefined && maybeId !== null) {
+  if (maybeId !== undefined && maybeId === null) {
     try {
       const byId = await database.get('SELECT * FROM enrollments WHERE id = ?', [maybeId]);

[Survived] EqualityOperator
routes/enrollments.js:35:7
   }
   const params = [studentId, courseId];
   let where = 'studentId = ? AND courseId = ?';
-  if (semester !== undefined && semester !== null) {
+  if (semester === undefined && semester !== null) {
     where += ' AND semester = ?';
     params.push(semester);

[Survived] EqualityOperator
routes/enrollments.js:35:33
   }
   const params = [studentId, courseId];
   let where = 'studentId = ? AND courseId = ?';
-  if (semester !== undefined && semester !== null) {
+  if (semester !== undefined && semester === null) {
     where += ' AND semester = ?';
     params.push(semester);

[Killed] LogicalOperator
routes/enrollments.js:47:21
   try {
     const database = db.getDb();
     const rows = await database.all('SELECT id, studentId, courseId, semester FROM enrollments');
-    return res.json(rows || []);
+    return res.json(rows && []);
   } catch (err) {
     console.error('GET /api/enroll error', err);
killedBy: Enrollments Integration Tests (safe) POST /api/enroll → creates enrollment and GET contains it
statusReason: expected undefined to exist

[Survived] EqualityOperator
routes/enrollments.js:62:57
 
     const studentId = isIntegerLike(payload.studentId) ? Number(payload.studentId) : payload.studentId;
     const courseId  = isIntegerLike(payload.courseId) ? Number(payload.courseId) : payload.courseId;
-    const semester  = payload.semester !== undefined && payload.semester !== null ? String(payload.semester) : null;
+    const semester  = payload.semester !== undefined && payload.semester === null ? String(payload.semester) : null;
 
     const database = db.getDb();

[Survived] LogicalOperator
routes/enrollments.js:62:23
 
     const studentId = isIntegerLike(payload.studentId) ? Number(payload.studentId) : payload.studentId;
     const courseId  = isIntegerLike(payload.courseId) ? Number(payload.courseId) : payload.courseId;
-    const semester  = payload.semester !== undefined && payload.semester !== null ? String(payload.semester) : null;
+    const semester  = payload.semester !== undefined || payload.semester !== null ? String(payload.semester) : null;
 
     const database = db.getDb();
