[Killed] BlockStatement
services/studentService.js:4:46
 // services/studentService.js
 // Pure helpers & validators for student logic (no DB, no Express)
 
-function formatFullName(firstName, lastName) {
-  const f = firstName ? String(firstName).trim() : '';
-  const l = lastName ? String(lastName).trim() : '';
-  return `${f} ${l}`.trim();
-}
+function formatFullName(firstName, lastName) {}
 
 function validateStudentPayload(payload = {}) {
killedBy: studentService formatFullName trims and joins
statusReason: expected undefined to equal 'John Doe'

[Killed] MethodExpression
services/studentService.js:5:25
 // Pure helpers & validators for student logic (no DB, no Express)
 
 function formatFullName(firstName, lastName) {
-  const f = firstName ? String(firstName).trim() : '';
+  const f = firstName ? String(firstName) : '';
   const l = lastName ? String(lastName).trim() : '';
   return `${f} ${l}`.trim();
killedBy: studentService formatFullName trims and joins
statusReason: expected 'John  Doe' to equal 'John Doe'

[Killed] MethodExpression
services/studentService.js:6:24
 
 function formatFullName(firstName, lastName) {
   const f = firstName ? String(firstName).trim() : '';
-  const l = lastName ? String(lastName).trim() : '';
+  const l = lastName ? String(lastName) : '';
   return `${f} ${l}`.trim();
 }
killedBy: studentService formatFullName trims and joins
statusReason: expected 'John  Doe' to equal 'John Doe'

[Killed] MethodExpression
services/studentService.js:7:10
 function formatFullName(firstName, lastName) {
   const f = firstName ? String(firstName).trim() : '';
   const l = lastName ? String(lastName).trim() : '';
-  return `${f} ${l}`.trim();
+  return `${f} ${l}`;
 }
 
killedBy: studentService formatFullName trims and joins
statusReason: expected ' Smith' to equal 'Smith'

[Killed] BlockStatement
services/studentService.js:10:47
   return `${f} ${l}`.trim();
 }
 
-function validateStudentPayload(payload = {}) {
-  const errors = [];
-  if (!payload) {
-    errors.push('payload required');
-    return { valid: false, errors };
-  }
-  if (!payload.firstName || typeof payload.firstName !== 'string' || !payload.firstName.trim()) errors.push('firstName required');
-  if (!payload.lastName || typeof payload.lastName !== 'string' || !payload.lastName.trim()) errors.push('lastName required');
-  if (payload.email && typeof payload.email === 'string') {
-    const re = /^[^\s@]+@[^\s@]+\.[^\s@]+$/;
-    if (!re.test(payload.email)) errors.push('invalid email');
-  }
-  return { valid: errors.length === 0, errors };
-}
+function validateStudentPayload(payload = {}) {}
 
 function buildStudentRecord(payload = {}, now = Date.now()) {
killedBy: studentService validateStudentPayload returns errors for missing fields
statusReason: Cannot read properties of undefined (reading 'valid')

[Survived] ArrayDeclaration
services/studentService.js:11:18
 }
 
 function validateStudentPayload(payload = {}) {
-  const errors = [];
+  const errors = ["Stryker was here"];
   if (!payload) {
     errors.push('payload required');

[Killed] BlockStatement
services/studentService.js:12:17
 
 function validateStudentPayload(payload = {}) {
   const errors = [];
-  if (!payload) {
-    errors.push('payload required');
-    return { valid: false, errors };
-  }
+  if (!payload) {}
   if (!payload.firstName || typeof payload.firstName !== 'string' || !payload.firstName.trim()) errors.push('firstName required');
   if (!payload.lastName || typeof payload.lastName !== 'string' || !payload.lastName.trim()) errors.push('lastName required');
killedBy: studentService validateStudentPayload returns errors for missing fields
statusReason: Cannot read properties of null (reading 'firstName')

[Killed] BooleanLiteral
services/studentService.js:14:21
   const errors = [];
   if (!payload) {
     errors.push('payload required');
-    return { valid: false, errors };
+    return { valid: true, errors };
   }
   if (!payload.firstName || typeof payload.firstName !== 'string' || !payload.firstName.trim()) errors.push('firstName required');
killedBy: studentService validateStudentPayload returns errors for missing fields
statusReason: expected true to be false

[Killed] LogicalOperator
services/studentService.js:16:7
     errors.push('payload required');
     return { valid: false, errors };
   }
-  if (!payload.firstName || typeof payload.firstName !== 'string' || !payload.firstName.trim()) errors.push('firstName required');
+  if ((!payload.firstName || typeof payload.firstName !== 'string') && !payload.firstName.trim()) errors.push('firstName required');
   if (!payload.lastName || typeof payload.lastName !== 'string' || !payload.lastName.trim()) errors.push('lastName required');
   if (payload.email && typeof payload.email === 'string') {
killedBy: studentService validateStudentPayload returns errors for missing fields
statusReason: Cannot read properties of undefined (reading 'trim')

[Killed] ConditionalExpression
services/studentService.js:16:7
     errors.push('payload required');
     return { valid: false, errors };
   }
-  if (!payload.firstName || typeof payload.firstName !== 'string' || !payload.firstName.trim()) errors.push('firstName required');
+  if (false || !payload.firstName.trim()) errors.push('firstName required');
   if (!payload.lastName || typeof payload.lastName !== 'string' || !payload.lastName.trim()) errors.push('lastName required');
   if (payload.email && typeof payload.email === 'string') {
killedBy: studentService validateStudentPayload returns errors for missing fields
statusReason: Cannot read properties of undefined (reading 'trim')

[Killed] ConditionalExpression
services/studentService.js:17:7
     return { valid: false, errors };
   }
   if (!payload.firstName || typeof payload.firstName !== 'string' || !payload.firstName.trim()) errors.push('firstName required');
-  if (!payload.lastName || typeof payload.lastName !== 'string' || !payload.lastName.trim()) errors.push('lastName required');
+  if (false) errors.push('lastName required');
   if (payload.email && typeof payload.email === 'string') {
     const re = /^[^\s@]+@[^\s@]+\.[^\s@]+$/;
killedBy: studentService validateStudentPayload returns errors for missing fields
statusReason: expected true to be false

[Killed] ConditionalExpression
services/studentService.js:17:7
     return { valid: false, errors };
   }
   if (!payload.firstName || typeof payload.firstName !== 'string' || !payload.firstName.trim()) errors.push('firstName required');
-  if (!payload.lastName || typeof payload.lastName !== 'string' || !payload.lastName.trim()) errors.push('lastName required');
+  if (false || !payload.lastName.trim()) errors.push('lastName required');
   if (payload.email && typeof payload.email === 'string') {
     const re = /^[^\s@]+@[^\s@]+\.[^\s@]+$/;
killedBy: studentService validateStudentPayload returns errors for missing fields
statusReason: Cannot read properties of undefined (reading 'trim')

[NoCoverage] ConditionalExpression
services/studentService.js:18:24
   }
   if (!payload.firstName || typeof payload.firstName !== 'string' || !payload.firstName.trim()) errors.push('firstName required');
   if (!payload.lastName || typeof payload.lastName !== 'string' || !payload.lastName.trim()) errors.push('lastName required');
-  if (payload.email && typeof payload.email === 'string') {
+  if (payload.email && true) {
     const re = /^[^\s@]+@[^\s@]+\.[^\s@]+$/;
     if (!re.test(payload.email)) errors.push('invalid email');

[NoCoverage] BlockStatement
services/studentService.js:18:59
   }
   if (!payload.firstName || typeof payload.firstName !== 'string' || !payload.firstName.trim()) errors.push('firstName required');
   if (!payload.lastName || typeof payload.lastName !== 'string' || !payload.lastName.trim()) errors.push('lastName required');
-  if (payload.email && typeof payload.email === 'string') {
-    const re = /^[^\s@]+@[^\s@]+\.[^\s@]+$/;
-    if (!re.test(payload.email)) errors.push('invalid email');
-  }
+  if (payload.email && typeof payload.email === 'string') {}
   return { valid: errors.length === 0, errors };
 }

[NoCoverage] Regex
services/studentService.js:19:16
   if (!payload.firstName || typeof payload.firstName !== 'string' || !payload.firstName.trim()) errors.push('firstName required');
   if (!payload.lastName || typeof payload.lastName !== 'string' || !payload.lastName.trim()) errors.push('lastName required');
   if (payload.email && typeof payload.email === 'string') {
-    const re = /^[^\s@]+@[^\s@]+\.[^\s@]+$/;
+    const re = /^[^\s@]+@[^\s@]+\.[^\s@]$/;
     if (!re.test(payload.email)) errors.push('invalid email');
   }

[NoCoverage] Regex
services/studentService.js:19:16
   if (!payload.firstName || typeof payload.firstName !== 'string' || !payload.firstName.trim()) errors.push('firstName required');
   if (!payload.lastName || typeof payload.lastName !== 'string' || !payload.lastName.trim()) errors.push('lastName required');
   if (payload.email && typeof payload.email === 'string') {
-    const re = /^[^\s@]+@[^\s@]+\.[^\s@]+$/;
+    const re = /[^\s@]+@[^\s@]+\.[^\s@]+$/;
     if (!re.test(payload.email)) errors.push('invalid email');
   }

[NoCoverage] ConditionalExpression
services/studentService.js:20:9
   if (!payload.lastName || typeof payload.lastName !== 'string' || !payload.lastName.trim()) errors.push('lastName required');
   if (payload.email && typeof payload.email === 'string') {
     const re = /^[^\s@]+@[^\s@]+\.[^\s@]+$/;
-    if (!re.test(payload.email)) errors.push('invalid email');
+    if (true) errors.push('invalid email');
   }
   return { valid: errors.length === 0, errors };

[NoCoverage] BooleanLiteral
services/studentService.js:20:9
   if (!payload.lastName || typeof payload.lastName !== 'string' || !payload.lastName.trim()) errors.push('lastName required');
   if (payload.email && typeof payload.email === 'string') {
     const re = /^[^\s@]+@[^\s@]+\.[^\s@]+$/;
-    if (!re.test(payload.email)) errors.push('invalid email');
+    if (re.test(payload.email)) errors.push('invalid email');
   }
   return { valid: errors.length === 0, errors };

[Killed] BlockStatement
services/studentService.js:25:61
   return { valid: errors.length === 0, errors };
 }
 
-function buildStudentRecord(payload = {}, now = Date.now()) {
-  // returns a plain object ready to insert into DB (doesn't call DB)
-  const p = payload || {};
-  return {
-    admissionNo: (p.admissionNo || '').toString().trim(),
-    firstName: (p.firstName || '').toString().trim(),
-    lastName: (p.lastName || '').toString().trim(),
-    dob: (p.dob || '').toString().trim(),
-    email: (p.email || '').toString().trim(),
-    phone: (p.phone || '').toString().trim(),
-    address: (p.address || '').toString().trim(),
-    year: (p.year || '').toString().trim(),
-    notes: (p.notes || '').toString().trim(),
-    createdAt: now,
-    updatedAt: now
-  };
-}
+function buildStudentRecord(payload = {}, now = Date.now()) {}
 
 function rowToStudent(r = {}) {
killedBy: studentService buildStudentRecord produces expected object
statusReason: Cannot read properties of undefined (reading 'firstName')

[Killed] ConditionalExpression
services/studentService.js:27:13
 
 function buildStudentRecord(payload = {}, now = Date.now()) {
   // returns a plain object ready to insert into DB (doesn't call DB)
-  const p = payload || {};
+  const p = true;
   return {
     admissionNo: (p.admissionNo || '').toString().trim(),
killedBy: studentService buildStudentRecord produces expected object
statusReason: expected '' to equal 'A'

[Killed] ConditionalExpression
services/studentService.js:27:13
 
 function buildStudentRecord(payload = {}, now = Date.now()) {
   // returns a plain object ready to insert into DB (doesn't call DB)
-  const p = payload || {};
+  const p = false;
   return {
     admissionNo: (p.admissionNo || '').toString().trim(),
killedBy: studentService buildStudentRecord produces expected object
statusReason: expected '' to equal 'A'

[Killed] LogicalOperator
services/studentService.js:29:19
   // returns a plain object ready to insert into DB (doesn't call DB)
   const p = payload || {};
   return {
-    admissionNo: (p.admissionNo || '').toString().trim(),
+    admissionNo: (p.admissionNo && '').toString().trim(),
     firstName: (p.firstName || '').toString().trim(),
     lastName: (p.lastName || '').toString().trim(),
killedBy: studentService buildStudentRecord produces expected object
statusReason: Cannot read properties of undefined (reading 'toString')

[Survived] ConditionalExpression
services/studentService.js:29:19
   // returns a plain object ready to insert into DB (doesn't call DB)
   const p = payload || {};
   return {
-    admissionNo: (p.admissionNo || '').toString().trim(),
+    admissionNo: (true).toString().trim(),
     firstName: (p.firstName || '').toString().trim(),
     lastName: (p.lastName || '').toString().trim(),

[Killed] ConditionalExpression
services/studentService.js:30:17
   const p = payload || {};
   return {
     admissionNo: (p.admissionNo || '').toString().trim(),
-    firstName: (p.firstName || '').toString().trim(),
+    firstName: (false).toString().trim(),
     lastName: (p.lastName || '').toString().trim(),
     dob: (p.dob || '').toString().trim(),
killedBy: studentService buildStudentRecord produces expected object
statusReason: expected 'false' to equal 'A'

[Killed] ConditionalExpression
services/studentService.js:30:17
   const p = payload || {};
   return {
     admissionNo: (p.admissionNo || '').toString().trim(),
-    firstName: (p.firstName || '').toString().trim(),
+    firstName: (true).toString().trim(),
     lastName: (p.lastName || '').toString().trim(),
     dob: (p.dob || '').toString().trim(),
killedBy: studentService buildStudentRecord produces expected object
statusReason: expected 'true' to equal 'A'

[Killed] ConditionalExpression
services/studentService.js:31:16
   return {
     admissionNo: (p.admissionNo || '').toString().trim(),
     firstName: (p.firstName || '').toString().trim(),
-    lastName: (p.lastName || '').toString().trim(),
+    lastName: (false).toString().trim(),
     dob: (p.dob || '').toString().trim(),
     email: (p.email || '').toString().trim(),
killedBy: studentService buildStudentRecord produces expected object
statusReason: expected 'false' to equal 'B'

[Killed] ConditionalExpression
services/studentService.js:31:16
   return {
     admissionNo: (p.admissionNo || '').toString().trim(),
     firstName: (p.firstName || '').toString().trim(),
-    lastName: (p.lastName || '').toString().trim(),
+    lastName: (true).toString().trim(),
     dob: (p.dob || '').toString().trim(),
     email: (p.email || '').toString().trim(),
killedBy: studentService buildStudentRecord produces expected object
statusReason: expected 'true' to equal 'B'

[Killed] LogicalOperator
services/studentService.js:32:11
     admissionNo: (p.admissionNo || '').toString().trim(),
     firstName: (p.firstName || '').toString().trim(),
     lastName: (p.lastName || '').toString().trim(),
-    dob: (p.dob || '').toString().trim(),
+    dob: (p.dob && '').toString().trim(),
     email: (p.email || '').toString().trim(),
     phone: (p.phone || '').toString().trim(),
killedBy: studentService buildStudentRecord produces expected object
statusReason: Cannot read properties of undefined (reading 'toString')

[Survived] MethodExpression
services/studentService.js:32:10
     admissionNo: (p.admissionNo || '').toString().trim(),
     firstName: (p.firstName || '').toString().trim(),
     lastName: (p.lastName || '').toString().trim(),
-    dob: (p.dob || '').toString().trim(),
+    dob: (p.dob || '').toString(),
     email: (p.email || '').toString().trim(),
     phone: (p.phone || '').toString().trim(),

[Killed] ConditionalExpression
services/studentService.js:33:13
     firstName: (p.firstName || '').toString().trim(),
     lastName: (p.lastName || '').toString().trim(),
     dob: (p.dob || '').toString().trim(),
-    email: (p.email || '').toString().trim(),
+    email: (false).toString().trim(),
     phone: (p.phone || '').toString().trim(),
     address: (p.address || '').toString().trim(),
killedBy: studentService buildStudentRecord produces expected object
statusReason: expected 'false' to equal 'a@b.com'

[Killed] ConditionalExpression
services/studentService.js:33:13
     firstName: (p.firstName || '').toString().trim(),
     lastName: (p.lastName || '').toString().trim(),
     dob: (p.dob || '').toString().trim(),
-    email: (p.email || '').toString().trim(),
+    email: (true).toString().trim(),
     phone: (p.phone || '').toString().trim(),
     address: (p.address || '').toString().trim(),
killedBy: studentService buildStudentRecord produces expected object
statusReason: expected 'true' to equal 'a@b.com'

[Killed] LogicalOperator
services/studentService.js:34:13
     lastName: (p.lastName || '').toString().trim(),
     dob: (p.dob || '').toString().trim(),
     email: (p.email || '').toString().trim(),
-    phone: (p.phone || '').toString().trim(),
+    phone: (p.phone && '').toString().trim(),
     address: (p.address || '').toString().trim(),
     year: (p.year || '').toString().trim(),
killedBy: studentService buildStudentRecord produces expected object
statusReason: Cannot read properties of undefined (reading 'toString')

[Survived] ConditionalExpression
services/studentService.js:34:13
     lastName: (p.lastName || '').toString().trim(),
     dob: (p.dob || '').toString().trim(),
     email: (p.email || '').toString().trim(),
-    phone: (p.phone || '').toString().trim(),
+    phone: (true).toString().trim(),
     address: (p.address || '').toString().trim(),
     year: (p.year || '').toString().trim(),

[Killed] LogicalOperator
services/studentService.js:35:15
     dob: (p.dob || '').toString().trim(),
     email: (p.email || '').toString().trim(),
     phone: (p.phone || '').toString().trim(),
-    address: (p.address || '').toString().trim(),
+    address: (p.address && '').toString().trim(),
     year: (p.year || '').toString().trim(),
     notes: (p.notes || '').toString().trim(),
killedBy: studentService buildStudentRecord produces expected object
statusReason: Cannot read properties of undefined (reading 'toString')

[Survived] ConditionalExpression
services/studentService.js:35:15
     dob: (p.dob || '').toString().trim(),
     email: (p.email || '').toString().trim(),
     phone: (p.phone || '').toString().trim(),
-    address: (p.address || '').toString().trim(),
+    address: (false).toString().trim(),
     year: (p.year || '').toString().trim(),
     notes: (p.notes || '').toString().trim(),

[Killed] LogicalOperator
services/studentService.js:36:12
     email: (p.email || '').toString().trim(),
     phone: (p.phone || '').toString().trim(),
     address: (p.address || '').toString().trim(),
-    year: (p.year || '').toString().trim(),
+    year: (p.year && '').toString().trim(),
     notes: (p.notes || '').toString().trim(),
     createdAt: now,
killedBy: studentService buildStudentRecord produces expected object
statusReason: Cannot read properties of undefined (reading 'toString')

[Survived] ConditionalExpression
services/studentService.js:36:12
     email: (p.email || '').toString().trim(),
     phone: (p.phone || '').toString().trim(),
     address: (p.address || '').toString().trim(),
-    year: (p.year || '').toString().trim(),
+    year: (true).toString().trim(),
     notes: (p.notes || '').toString().trim(),
     createdAt: now,

[Killed] LogicalOperator
services/studentService.js:37:13
     phone: (p.phone || '').toString().trim(),
     address: (p.address || '').toString().trim(),
     year: (p.year || '').toString().trim(),
-    notes: (p.notes || '').toString().trim(),
+    notes: (p.notes && '').toString().trim(),
     createdAt: now,
     updatedAt: now
killedBy: studentService buildStudentRecord produces expected object
statusReason: Cannot read properties of undefined (reading 'toString')

[Survived] ConditionalExpression
services/studentService.js:37:13
     phone: (p.phone || '').toString().trim(),
     address: (p.address || '').toString().trim(),
     year: (p.year || '').toString().trim(),
-    notes: (p.notes || '').toString().trim(),
+    notes: (true).toString().trim(),
     createdAt: now,
     updatedAt: now

[Killed] BlockStatement
services/studentService.js:43:31
   };
 }
 
-function rowToStudent(r = {}) {
-  if (!r) return null;
-  return {
-    id: r.id,
-    admissionNo: r.admissionNo || '',
-    firstName: r.firstName || '',
-    lastName: r.lastName || '',
-    fullName: formatFullName(r.firstName, r.lastName),
-    dob: r.dob || '',
-    email: r.email || '',
-    phone: r.phone || '',
-    address: r.address || '',
-    year: r.year || '',
-    notes: r.notes || '',
-    createdAt: r.createdAt || null,
-    updatedAt: r.updatedAt || null
-  };
-}
+function rowToStudent(r = {}) {}
 
 module.exports = {
killedBy: studentService rowToStudent maps row correctly
statusReason: Cannot read properties of undefined (reading 'fullName')

[Survived] ConditionalExpression
services/studentService.js:47:18
   if (!r) return null;
   return {
     id: r.id,
-    admissionNo: r.admissionNo || '',
+    admissionNo: true,
     firstName: r.firstName || '',
     lastName: r.lastName || '',

[Survived] ConditionalExpression
services/studentService.js:47:18
   if (!r) return null;
   return {
     id: r.id,
-    admissionNo: r.admissionNo || '',
+    admissionNo: false,
     firstName: r.firstName || '',
     lastName: r.lastName || '',

[Survived] ConditionalExpression
services/studentService.js:48:16
   return {
     id: r.id,
     admissionNo: r.admissionNo || '',
-    firstName: r.firstName || '',
+    firstName: true,
     lastName: r.lastName || '',
     fullName: formatFullName(r.firstName, r.lastName),

[Survived] ConditionalExpression
services/studentService.js:48:16
   return {
     id: r.id,
     admissionNo: r.admissionNo || '',
-    firstName: r.firstName || '',
+    firstName: false,
     lastName: r.lastName || '',
     fullName: formatFullName(r.firstName, r.lastName),

[Survived] LogicalOperator
services/studentService.js:49:15
     id: r.id,
     admissionNo: r.admissionNo || '',
     firstName: r.firstName || '',
-    lastName: r.lastName || '',
+    lastName: r.lastName && '',
     fullName: formatFullName(r.firstName, r.lastName),
     dob: r.dob || '',

[Survived] ConditionalExpression
services/studentService.js:49:15
     id: r.id,
     admissionNo: r.admissionNo || '',
     firstName: r.firstName || '',
-    lastName: r.lastName || '',
+    lastName: true,
     fullName: formatFullName(r.firstName, r.lastName),
     dob: r.dob || '',

[Survived] LogicalOperator
services/studentService.js:51:10
     firstName: r.firstName || '',
     lastName: r.lastName || '',
     fullName: formatFullName(r.firstName, r.lastName),
-    dob: r.dob || '',
+    dob: r.dob && '',
     email: r.email || '',
     phone: r.phone || '',

[Survived] ConditionalExpression
services/studentService.js:51:10
     firstName: r.firstName || '',
     lastName: r.lastName || '',
     fullName: formatFullName(r.firstName, r.lastName),
-    dob: r.dob || '',
+    dob: true,
     email: r.email || '',
     phone: r.phone || '',

[Survived] ConditionalExpression
services/studentService.js:52:12
     lastName: r.lastName || '',
     fullName: formatFullName(r.firstName, r.lastName),
     dob: r.dob || '',
-    email: r.email || '',
+    email: true,
     phone: r.phone || '',
     address: r.address || '',

[Survived] LogicalOperator
services/studentService.js:52:12
     lastName: r.lastName || '',
     fullName: formatFullName(r.firstName, r.lastName),
     dob: r.dob || '',
-    email: r.email || '',
+    email: r.email && '',
     phone: r.phone || '',
     address: r.address || '',

[Survived] ConditionalExpression
services/studentService.js:53:12
     fullName: formatFullName(r.firstName, r.lastName),
     dob: r.dob || '',
     email: r.email || '',
-    phone: r.phone || '',
+    phone: true,
     address: r.address || '',
     year: r.year || '',

[Survived] ConditionalExpression
services/studentService.js:53:12
     fullName: formatFullName(r.firstName, r.lastName),
     dob: r.dob || '',
     email: r.email || '',
-    phone: r.phone || '',
+    phone: false,
     address: r.address || '',
     year: r.year || '',

[Survived] ConditionalExpression
services/studentService.js:54:14
     dob: r.dob || '',
     email: r.email || '',
     phone: r.phone || '',
-    address: r.address || '',
+    address: false,
     year: r.year || '',
     notes: r.notes || '',

[Survived] ConditionalExpression
services/studentService.js:54:14
     dob: r.dob || '',
     email: r.email || '',
     phone: r.phone || '',
-    address: r.address || '',
+    address: true,
     year: r.year || '',
     notes: r.notes || '',

[Survived] LogicalOperator
services/studentService.js:55:11
     email: r.email || '',
     phone: r.phone || '',
     address: r.address || '',
-    year: r.year || '',
+    year: r.year && '',
     notes: r.notes || '',
     createdAt: r.createdAt || null,

[Survived] ConditionalExpression
services/studentService.js:55:11
     email: r.email || '',
     phone: r.phone || '',
     address: r.address || '',
-    year: r.year || '',
+    year: true,
     notes: r.notes || '',
     createdAt: r.createdAt || null,

[Survived] LogicalOperator
services/studentService.js:56:12
     phone: r.phone || '',
     address: r.address || '',
     year: r.year || '',
-    notes: r.notes || '',
+    notes: r.notes && '',
     createdAt: r.createdAt || null,
     updatedAt: r.updatedAt || null

[Survived] ConditionalExpression
services/studentService.js:56:12
     phone: r.phone || '',
     address: r.address || '',
     year: r.year || '',
-    notes: r.notes || '',
+    notes: true,
     createdAt: r.createdAt || null,
     updatedAt: r.updatedAt || null

[Survived] LogicalOperator
services/studentService.js:57:16
     address: r.address || '',
     year: r.year || '',
     notes: r.notes || '',
-    createdAt: r.createdAt || null,
+    createdAt: r.createdAt && null,
     updatedAt: r.updatedAt || null
   };

[Survived] ConditionalExpression
services/studentService.js:57:16
     address: r.address || '',
     year: r.year || '',
     notes: r.notes || '',
-    createdAt: r.createdAt || null,
+    createdAt: false,
     updatedAt: r.updatedAt || null
   };

[Survived] ConditionalExpression
services/studentService.js:58:16
     year: r.year || '',
     notes: r.notes || '',
     createdAt: r.createdAt || null,
-    updatedAt: r.updatedAt || null
+    updatedAt: true
   };
 }

[Survived] ConditionalExpression
services/studentService.js:58:16
     year: r.year || '',
     notes: r.notes || '',
     createdAt: r.createdAt || null,
-    updatedAt: r.updatedAt || null
+    updatedAt: false
   };
 }

[Killed] ObjectLiteral
services/studentService.js:62:18
   };
 }
 
-module.exports = {
-  formatFullName,
-  validateStudentPayload,
-  buildStudentRecord,
-  rowToStudent
-};
+module.exports = {};
 
killedBy: studentService formatFullName trims and joins
statusReason: s.formatFullName is not a function
