[Killed] BlockStatement
services/enrollmentService.js:4:43
 // services/enrollmentService.js
 // Pure helpers for enrollment logic (no DB)
 
-function validateEnrollment(payload = {}) {
-  if (!payload) return { ok: false, reason: 'no payload' };
-  const studentId = (payload.studentId || '').toString().trim();
-  const courseId = (payload.courseId || '').toString().trim();
-  if (!studentId || !courseId) return { ok: false, reason: 'missing ids' };
-  return { ok: true };
-}
+function validateEnrollment(payload = {}) {}
 
 function buildEnrollmentRecord(payload = {}) {
killedBy: enrollmentService validateEnrollment fails without ids
statusReason: Cannot read properties of undefined (reading 'ok')

[Killed] ConditionalExpression
services/enrollmentService.js:5:7
 // Pure helpers for enrollment logic (no DB)
 
 function validateEnrollment(payload = {}) {
-  if (!payload) return { ok: false, reason: 'no payload' };
+  if (false) return { ok: false, reason: 'no payload' };
   const studentId = (payload.studentId || '').toString().trim();
   const courseId = (payload.courseId || '').toString().trim();
killedBy: enrollmentService validateEnrollment fails without ids
statusReason: Cannot read properties of null (reading 'studentId')

[Killed] BooleanLiteral
services/enrollmentService.js:5:7
 // Pure helpers for enrollment logic (no DB)
 
 function validateEnrollment(payload = {}) {
-  if (!payload) return { ok: false, reason: 'no payload' };
+  if (payload) return { ok: false, reason: 'no payload' };
   const studentId = (payload.studentId || '').toString().trim();
   const courseId = (payload.courseId || '').toString().trim();
killedBy: enrollmentService validateEnrollment fails without ids
statusReason: Cannot read properties of null (reading 'studentId')

[Killed] LogicalOperator
services/enrollmentService.js:6:22
 
 function validateEnrollment(payload = {}) {
   if (!payload) return { ok: false, reason: 'no payload' };
-  const studentId = (payload.studentId || '').toString().trim();
+  const studentId = (payload.studentId && '').toString().trim();
   const courseId = (payload.courseId || '').toString().trim();
   if (!studentId || !courseId) return { ok: false, reason: 'missing ids' };
killedBy: enrollmentService validateEnrollment fails without ids
statusReason: Cannot read properties of undefined (reading 'toString')

[Survived] ConditionalExpression
services/enrollmentService.js:6:22
 
 function validateEnrollment(payload = {}) {
   if (!payload) return { ok: false, reason: 'no payload' };
-  const studentId = (payload.studentId || '').toString().trim();
+  const studentId = (true).toString().trim();
   const courseId = (payload.courseId || '').toString().trim();
   if (!studentId || !courseId) return { ok: false, reason: 'missing ids' };

[Killed] LogicalOperator
services/enrollmentService.js:7:21
 function validateEnrollment(payload = {}) {
   if (!payload) return { ok: false, reason: 'no payload' };
   const studentId = (payload.studentId || '').toString().trim();
-  const courseId = (payload.courseId || '').toString().trim();
+  const courseId = (payload.courseId && '').toString().trim();
   if (!studentId || !courseId) return { ok: false, reason: 'missing ids' };
   return { ok: true };
killedBy: enrollmentService validateEnrollment fails without ids
statusReason: Cannot read properties of undefined (reading 'toString')

[Survived] ConditionalExpression
services/enrollmentService.js:7:21
 function validateEnrollment(payload = {}) {
   if (!payload) return { ok: false, reason: 'no payload' };
   const studentId = (payload.studentId || '').toString().trim();
-  const courseId = (payload.courseId || '').toString().trim();
+  const courseId = (true).toString().trim();
   if (!studentId || !courseId) return { ok: false, reason: 'missing ids' };
   return { ok: true };

[Killed] ConditionalExpression
services/enrollmentService.js:8:7
   if (!payload) return { ok: false, reason: 'no payload' };
   const studentId = (payload.studentId || '').toString().trim();
   const courseId = (payload.courseId || '').toString().trim();
-  if (!studentId || !courseId) return { ok: false, reason: 'missing ids' };
+  if (false) return { ok: false, reason: 'missing ids' };
   return { ok: true };
 }
killedBy: enrollmentService validateEnrollment fails without ids
statusReason: expected true to be false

[Killed] BooleanLiteral
services/enrollmentService.js:8:21
   if (!payload) return { ok: false, reason: 'no payload' };
   const studentId = (payload.studentId || '').toString().trim();
   const courseId = (payload.courseId || '').toString().trim();
-  if (!studentId || !courseId) return { ok: false, reason: 'missing ids' };
+  if (!studentId || courseId) return { ok: false, reason: 'missing ids' };
   return { ok: true };
 }
killedBy: enrollmentService buildEnrollmentRecord builds object
statusReason: missing ids

[Killed] BooleanLiteral
services/enrollmentService.js:9:16
   const studentId = (payload.studentId || '').toString().trim();
   const courseId = (payload.courseId || '').toString().trim();
   if (!studentId || !courseId) return { ok: false, reason: 'missing ids' };
-  return { ok: true };
+  return { ok: false };
 }
 
killedBy: enrollmentService buildEnrollmentRecord builds object
statusReason: Error

[Killed] ObjectLiteral
services/enrollmentService.js:9:10
   const studentId = (payload.studentId || '').toString().trim();
   const courseId = (payload.courseId || '').toString().trim();
   if (!studentId || !courseId) return { ok: false, reason: 'missing ids' };
-  return { ok: true };
+  return {};
 }
 
killedBy: enrollmentService buildEnrollmentRecord builds object
statusReason: Error

[Killed] BlockStatement
services/enrollmentService.js:12:46
   return { ok: true };
 }
 
-function buildEnrollmentRecord(payload = {}) {
-  const v = validateEnrollment(payload);
-  if (!v.ok) throw new Error(v.reason);
-  return {
-    studentId: payload.studentId,
-    courseId: payload.courseId,
-    enrolledAt: payload.enrolledAt || Date.now()
-  };
-}
+function buildEnrollmentRecord(payload = {}) {}
 
 module.exports = {
killedBy: enrollmentService buildEnrollmentRecord builds object
statusReason: Cannot read properties of undefined (reading 'studentId')

[Killed] ConditionalExpression
services/enrollmentService.js:14:7
 
 function buildEnrollmentRecord(payload = {}) {
   const v = validateEnrollment(payload);
-  if (!v.ok) throw new Error(v.reason);
+  if (true) throw new Error(v.reason);
   return {
     studentId: payload.studentId,
killedBy: enrollmentService buildEnrollmentRecord builds object
statusReason: Error

[Killed] BooleanLiteral
services/enrollmentService.js:14:7
 
 function buildEnrollmentRecord(payload = {}) {
   const v = validateEnrollment(payload);
-  if (!v.ok) throw new Error(v.reason);
+  if (v.ok) throw new Error(v.reason);
   return {
     studentId: payload.studentId,
killedBy: enrollmentService buildEnrollmentRecord builds object
statusReason: Error

[Killed] ConditionalExpression
services/enrollmentService.js:18:17
   return {
     studentId: payload.studentId,
     courseId: payload.courseId,
-    enrolledAt: payload.enrolledAt || Date.now()
+    enrolledAt: true
   };
 }
killedBy: enrollmentService buildEnrollmentRecord builds object
statusReason: expected true to be a number

[Killed] LogicalOperator
services/enrollmentService.js:18:17
   return {
     studentId: payload.studentId,
     courseId: payload.courseId,
-    enrolledAt: payload.enrolledAt || Date.now()
+    enrolledAt: payload.enrolledAt && Date.now()
   };
 }
killedBy: enrollmentService buildEnrollmentRecord builds object
statusReason: expected undefined to be a number

[Killed] ObjectLiteral
services/enrollmentService.js:22:18
   };
 }
 
-module.exports = {
-  validateEnrollment,
-  buildEnrollmentRecord
-};
+module.exports = {};
 
killedBy: enrollmentService validateEnrollment fails without ids
statusReason: e.validateEnrollment is not a function
