[Survived] EqualityOperator
routes/students.js:30:19
     if (!payload.firstName) errors.push('firstName required');
     // email optional
   }
-  return { valid: errors.length === 0, errors };
+  return { valid: errors.length !== 0, errors };
 }
 

[Survived] EqualityOperator
routes/students.js:44:7
 }
 
 async function fetchCreatedStudent(database, maybeId, admissionNo) {
-  if (maybeId !== undefined && maybeId !== null) {
+  if (maybeId === undefined && maybeId !== null) {
     try {
       const byId = await database.get('SELECT * FROM students WHERE id = ?', [maybeId]);

[Survived] EqualityOperator
routes/students.js:44:32
 }
 
 async function fetchCreatedStudent(database, maybeId, admissionNo) {
-  if (maybeId !== undefined && maybeId !== null) {
+  if (maybeId !== undefined && maybeId === null) {
     try {
       const byId = await database.get('SELECT * FROM students WHERE id = ?', [maybeId]);

[Survived] LogicalOperator
routes/students.js:61:10
 
   // As last resort, fetch newest student
   const rows = await database.all('SELECT * FROM students ORDER BY id DESC LIMIT 1');
-  return rows && rows[0];
+  return rows || rows[0];
 }
 

[Killed] LogicalOperator
routes/students.js:72:21
   try {
     const database = db.getDb();
     const rows = await database.all('SELECT * FROM students');
-    const mapped = (rows || []).map(r => {
+    const mapped = (rows && []).map(r => {
       if (typeof studentService.rowToStudent === 'function') {
         return studentService.rowToStudent(r);
killedBy: Students Integration Tests (safe) POST /api/students → creates student (201) and returned object has proper fields
statusReason: expected undefined to exist

[Survived] EqualityOperator
routes/students.js:73:11
     const database = db.getDb();
     const rows = await database.all('SELECT * FROM students');
     const mapped = (rows || []).map(r => {
-      if (typeof studentService.rowToStudent === 'function') {
+      if (typeof studentService.rowToStudent !== 'function') {
         return studentService.rowToStudent(r);
       }

[Survived] EqualityOperator
routes/students.js:94:9
     const payload = req.body || {};
 
     // prefer service validation if present
-    if (typeof studentService.validateStudentPayload === 'function') {
+    if (typeof studentService.validateStudentPayload !== 'function') {
       const v = studentService.validateStudentPayload(payload);
       if (!v || !v.valid) {

[Killed] LogicalOperator
routes/students.js:96:11
     // prefer service validation if present
     if (typeof studentService.validateStudentPayload === 'function') {
       const v = studentService.validateStudentPayload(payload);
-      if (!v || !v.valid) {
+      if (!v && !v.valid) {
         return res.status(400).json({ errors: v && v.errors ? v.errors : ['validation failed'] });
       }
killedBy: Students Integration Tests (safe) POST /api/students → validation: missing required fields returns 400 and error body
statusReason: expected 400 "Bad Request", got 201 "Created"

[Survived] LogicalOperator
routes/students.js:97:47
     if (typeof studentService.validateStudentPayload === 'function') {
       const v = studentService.validateStudentPayload(payload);
       if (!v || !v.valid) {
-        return res.status(400).json({ errors: v && v.errors ? v.errors : ['validation failed'] });
+        return res.status(400).json({ errors: v || v.errors ? v.errors : ['validation failed'] });
       }
     } else {

[Killed] ObjectLiteral
routes/students.js:97:37
     if (typeof studentService.validateStudentPayload === 'function') {
       const v = studentService.validateStudentPayload(payload);
       if (!v || !v.valid) {
-        return res.status(400).json({ errors: v && v.errors ? v.errors : ['validation failed'] });
+        return res.status(400).json({});
       }
     } else {
killedBy: Students Integration Tests (safe) POST /api/students → validation: missing required fields returns 400 and error body
statusReason: expected false to equal true

[Survived] LogicalOperator
routes/students.js:111:9
 
     // extract maybeId safely
     let maybeId = null;
-    if (insertResult && typeof insertResult === 'object') {
+    if (insertResult || typeof insertResult === 'object') {
       if (insertResult.lastID !== undefined) maybeId = insertResult.lastID;
       else if (Array.isArray(insertResult) && insertResult[0] && insertResult[0].lastID !== undefined) maybeId = insertResult[0].lastID;

[Survived] EqualityOperator
routes/students.js:111:25
 
     // extract maybeId safely
     let maybeId = null;
-    if (insertResult && typeof insertResult === 'object') {
+    if (insertResult && typeof insertResult !== 'object') {
       if (insertResult.lastID !== undefined) maybeId = insertResult.lastID;
       else if (Array.isArray(insertResult) && insertResult[0] && insertResult[0].lastID !== undefined) maybeId = insertResult[0].lastID;

[Survived] EqualityOperator
routes/students.js:112:11
     // extract maybeId safely
     let maybeId = null;
     if (insertResult && typeof insertResult === 'object') {
-      if (insertResult.lastID !== undefined) maybeId = insertResult.lastID;
+      if (insertResult.lastID === undefined) maybeId = insertResult.lastID;
       else if (Array.isArray(insertResult) && insertResult[0] && insertResult[0].lastID !== undefined) maybeId = insertResult[0].lastID;
     }

[Killed] LogicalOperator
routes/students.js:113:16
     let maybeId = null;
     if (insertResult && typeof insertResult === 'object') {
       if (insertResult.lastID !== undefined) maybeId = insertResult.lastID;
-      else if (Array.isArray(insertResult) && insertResult[0] && insertResult[0].lastID !== undefined) maybeId = insertResult[0].lastID;
+      else if (Array.isArray(insertResult) && insertResult[0] || insertResult[0].lastID !== undefined) maybeId = insertResult[0].lastID;
     }
 
killedBy: Attendance Integration Tests (safe) GET /api/attendance → returns array
statusReason: expected 201 "Created", got 500 "Internal Server Error"

[Killed] LogicalOperator
routes/students.js:113:16
     let maybeId = null;
     if (insertResult && typeof insertResult === 'object') {
       if (insertResult.lastID !== undefined) maybeId = insertResult.lastID;
-      else if (Array.isArray(insertResult) && insertResult[0] && insertResult[0].lastID !== undefined) maybeId = insertResult[0].lastID;
+      else if (Array.isArray(insertResult) || insertResult[0] && insertResult[0].lastID !== undefined) maybeId = insertResult[0].lastID;
     }
 
killedBy: Attendance Integration Tests (safe) GET /api/attendance → returns array
statusReason: expected 201 "Created", got 500 "Internal Server Error"

[Survived] ObjectLiteral
routes/students.js:118:47
 
     const created = await fetchCreatedStudent(database, maybeId, normalized.admissionNo);
 
-    if (!created) return res.status(500).json({ error: 'Inserted but unable to fetch created student' });
+    if (!created) return res.status(500).json({});
 
     const mapped = (typeof studentService.rowToStudent === 'function') ? studentService.rowToStudent(created) : created;

[Survived] EqualityOperator
routes/students.js:120:21
 
     if (!created) return res.status(500).json({ error: 'Inserted but unable to fetch created student' });
 
-    const mapped = (typeof studentService.rowToStudent === 'function') ? studentService.rowToStudent(created) : created;
+    const mapped = (typeof studentService.rowToStudent !== 'function') ? studentService.rowToStudent(created) : created;
     return res.status(201).json(mapped);
   } catch (err) {
