[Survived] EqualityOperator
routes/attendance.js:7:15
 const attendanceService = require('../services/attendanceService');
 
 // DEBUG flag
-const DEBUG = process.env.DEBUG === 'true' || false;
+const DEBUG = process.env.DEBUG !== 'true' || false;
 
 /* -----------------------

[Survived] LogicalOperator
routes/attendance.js:7:15
 const attendanceService = require('../services/attendanceService');
 
 // DEBUG flag
-const DEBUG = process.env.DEBUG === 'true' || false;
+const DEBUG = process.env.DEBUG === 'true' && false;
 
 /* -----------------------

[Killed] EqualityOperator
routes/attendance.js:13:26
    Helpers (safe, non-breaking)
 --------------------------*/
 function normalizeString(v) {
-  if (v === undefined || v === null) return '';
+  if (v === undefined || v !== null) return '';
   return String(v).trim();
 }
killedBy: Attendance Integration Tests (safe) POST /api/attendance → creates attendance record (201) and record retrievable
statusReason: expected 201 "Created", got 400 "Bad Request"

[Killed] EqualityOperator
routes/attendance.js:13:7
    Helpers (safe, non-breaking)
 --------------------------*/
 function normalizeString(v) {
-  if (v === undefined || v === null) return '';
+  if (v !== undefined || v === null) return '';
   return String(v).trim();
 }
killedBy: Attendance Integration Tests (safe) POST /api/attendance → creates attendance record (201) and record retrievable
statusReason: expected 201 "Created", got 400 "Bad Request"

[Survived] MethodExpression
routes/attendance.js:14:10
 --------------------------*/
 function normalizeString(v) {
   if (v === undefined || v === null) return '';
-  return String(v).trim();
+  return String(v);
 }
 function isPresent(v) {

[Killed] EqualityOperator
routes/attendance.js:17:43
   return String(v).trim();
 }
 function isPresent(v) {
-  return v !== undefined && v !== null && String(v).trim() !== '';
+  return v !== undefined && v !== null && String(v).trim() === '';
 }
 function buildError(message) {
killedBy: Attendance Integration Tests (safe) POST /api/attendance → creates attendance record (201) and record retrievable
statusReason: expected 201 "Created", got 400 "Bad Request"

[Killed] EqualityOperator
routes/attendance.js:17:29
   return String(v).trim();
 }
 function isPresent(v) {
-  return v !== undefined && v !== null && String(v).trim() !== '';
+  return v !== undefined && v === null && String(v).trim() !== '';
 }
 function buildError(message) {
killedBy: Attendance Integration Tests (safe) POST /api/attendance → creates attendance record (201) and record retrievable
statusReason: expected 201 "Created", got 400 "Bad Request"

[Survived] LogicalOperator
routes/attendance.js:20:19
   return v !== undefined && v !== null && String(v).trim() !== '';
 }
 function buildError(message) {
-  return { error: message || 'internal error' };
+  return { error: message && 'internal error' };
 }
 function debugLog(...args) {

[Survived] ObjectLiteral
routes/attendance.js:20:10
   return v !== undefined && v !== null && String(v).trim() !== '';
 }
 function buildError(message) {
-  return { error: message || 'internal error' };
+  return {};
 }
 function debugLog(...args) {

[Killed] EqualityOperator
routes/attendance.js:28:13
 
 // validate ISO date (YYYY-MM-DD) strictly
 function isValidDateISO(s) {
-  if (!s || typeof s !== 'string') return false;
+  if (!s || typeof s === 'string') return false;
   // basic YYYY-MM-DD check and strict month/day ranges
   const m = s.match(/^(\d{4})-(\d{2})-(\d{2})$/);
killedBy: Attendance Integration Tests (safe) POST /api/attendance → creates attendance record (201) and record retrievable
statusReason: expected 201 "Created", got 400 "Bad Request"

[Survived] LogicalOperator
routes/attendance.js:28:7
 
 // validate ISO date (YYYY-MM-DD) strictly
 function isValidDateISO(s) {
-  if (!s || typeof s !== 'string') return false;
+  if (!s && typeof s !== 'string') return false;
   // basic YYYY-MM-DD check and strict month/day ranges
   const m = s.match(/^(\d{4})-(\d{2})-(\d{2})$/);

[Survived] Regex
routes/attendance.js:30:21
 function isValidDateISO(s) {
   if (!s || typeof s !== 'string') return false;
   // basic YYYY-MM-DD check and strict month/day ranges
-  const m = s.match(/^(\d{4})-(\d{2})-(\d{2})$/);
+  const m = s.match(/(\d{4})-(\d{2})-(\d{2})$/);
   if (!m) return false;
   const y = Number(m[1]), mo = Number(m[2]), d = Number(m[3]);

[Survived] Regex
routes/attendance.js:30:21
 function isValidDateISO(s) {
   if (!s || typeof s !== 'string') return false;
   // basic YYYY-MM-DD check and strict month/day ranges
-  const m = s.match(/^(\d{4})-(\d{2})-(\d{2})$/);
+  const m = s.match(/^(\d{4})-(\d{2})-(\d{2})/);
   if (!m) return false;
   const y = Number(m[1]), mo = Number(m[2]), d = Number(m[3]);

[Killed] EqualityOperator
routes/attendance.js:33:7
   const m = s.match(/^(\d{4})-(\d{2})-(\d{2})$/);
   if (!m) return false;
   const y = Number(m[1]), mo = Number(m[2]), d = Number(m[3]);
-  if (mo < 1 || mo > 12) return false;
+  if (mo >= 1 || mo > 12) return false;
   if (d < 1 || d > 31) return false;
   // simple month-day validity (not full calendar checks) — enough for tests
killedBy: Attendance Integration Tests (safe) POST /api/attendance → creates attendance record (201) and record retrievable
statusReason: expected 201 "Created", got 400 "Bad Request"

[Killed] EqualityOperator
routes/attendance.js:33:17
   const m = s.match(/^(\d{4})-(\d{2})-(\d{2})$/);
   if (!m) return false;
   const y = Number(m[1]), mo = Number(m[2]), d = Number(m[3]);
-  if (mo < 1 || mo > 12) return false;
+  if (mo < 1 || mo <= 12) return false;
   if (d < 1 || d > 31) return false;
   // simple month-day validity (not full calendar checks) — enough for tests
killedBy: Attendance Integration Tests (safe) POST /api/attendance → creates attendance record (201) and record retrievable
statusReason: expected 201 "Created", got 400 "Bad Request"

[Killed] EqualityOperator
routes/attendance.js:34:7
   if (!m) return false;
   const y = Number(m[1]), mo = Number(m[2]), d = Number(m[3]);
   if (mo < 1 || mo > 12) return false;
-  if (d < 1 || d > 31) return false;
+  if (d <= 1 || d > 31) return false;
   // simple month-day validity (not full calendar checks) — enough for tests
   const mdays = [31, (y % 4 === 0 && y % 100 !== 0) || (y % 400 === 0) ? 29 : 28, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31];
killedBy: Attendance Integration Tests (safe) POST /api/attendance → creates attendance record (201) and record retrievable
statusReason: expected 201 "Created", got 400 "Bad Request"

[Killed] EqualityOperator
routes/attendance.js:34:16
   if (!m) return false;
   const y = Number(m[1]), mo = Number(m[2]), d = Number(m[3]);
   if (mo < 1 || mo > 12) return false;
-  if (d < 1 || d > 31) return false;
+  if (d < 1 || d <= 31) return false;
   // simple month-day validity (not full calendar checks) — enough for tests
   const mdays = [31, (y % 4 === 0 && y % 100 !== 0) || (y % 400 === 0) ? 29 : 28, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31];
killedBy: Attendance Integration Tests (safe) POST /api/attendance → creates attendance record (201) and record retrievable
statusReason: expected 201 "Created", got 400 "Bad Request"

[Survived] LogicalOperator
routes/attendance.js:36:23
   if (mo < 1 || mo > 12) return false;
   if (d < 1 || d > 31) return false;
   // simple month-day validity (not full calendar checks) — enough for tests
-  const mdays = [31, (y % 4 === 0 && y % 100 !== 0) || (y % 400 === 0) ? 29 : 28, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31];
+  const mdays = [31, (y % 4 === 0 || y % 100 !== 0) || (y % 400 === 0) ? 29 : 28, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31];
   if (d > mdays[mo - 1]) return false;
   return true;

[Survived] EqualityOperator
routes/attendance.js:36:38
   if (mo < 1 || mo > 12) return false;
   if (d < 1 || d > 31) return false;
   // simple month-day validity (not full calendar checks) — enough for tests
-  const mdays = [31, (y % 4 === 0 && y % 100 !== 0) || (y % 400 === 0) ? 29 : 28, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31];
+  const mdays = [31, (y % 4 === 0 && y % 100 === 0) || (y % 400 === 0) ? 29 : 28, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31];
   if (d > mdays[mo - 1]) return false;
   return true;

[Killed] EqualityOperator
routes/attendance.js:37:7
   if (d < 1 || d > 31) return false;
   // simple month-day validity (not full calendar checks) — enough for tests
   const mdays = [31, (y % 4 === 0 && y % 100 !== 0) || (y % 400 === 0) ? 29 : 28, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31];
-  if (d > mdays[mo - 1]) return false;
+  if (d <= mdays[mo - 1]) return false;
   return true;
 }
killedBy: Attendance Integration Tests (safe) POST /api/attendance → creates attendance record (201) and record retrievable
statusReason: expected 201 "Created", got 400 "Bad Request"

[Survived] EqualityOperator
routes/attendance.js:37:7
   if (d < 1 || d > 31) return false;
   // simple month-day validity (not full calendar checks) — enough for tests
   const mdays = [31, (y % 4 === 0 && y % 100 !== 0) || (y % 400 === 0) ? 29 : 28, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31];
-  if (d > mdays[mo - 1]) return false;
+  if (d >= mdays[mo - 1]) return false;
   return true;
 }

[Killed] EqualityOperator
routes/attendance.js:44:13
 // allowed statuses for attendance
 const ALLOWED_STATUSES = new Set(['present', 'absent', 'late', 'excused']);
 function isAllowedStatus(s) {
-  if (!s || typeof s !== 'string') return false;
+  if (!s || typeof s === 'string') return false;
   return ALLOWED_STATUSES.has(s.toLowerCase());
 }
killedBy: Attendance Integration Tests (safe) POST /api/attendance → creates attendance record (201) and record retrievable
statusReason: expected 201 "Created", got 400 "Bad Request"

[Survived] LogicalOperator
routes/attendance.js:44:7
 // allowed statuses for attendance
 const ALLOWED_STATUSES = new Set(['present', 'absent', 'late', 'excused']);
 function isAllowedStatus(s) {
-  if (!s || typeof s !== 'string') return false;
+  if (!s && typeof s !== 'string') return false;
   return ALLOWED_STATUSES.has(s.toLowerCase());
 }

[Killed] MethodExpression
routes/attendance.js:45:31
 const ALLOWED_STATUSES = new Set(['present', 'absent', 'late', 'excused']);
 function isAllowedStatus(s) {
   if (!s || typeof s !== 'string') return false;
-  return ALLOWED_STATUSES.has(s.toLowerCase());
+  return ALLOWED_STATUSES.has(s.toUpperCase());
 }
 
killedBy: Attendance Integration Tests (safe) POST /api/attendance → creates attendance record (201) and record retrievable
statusReason: expected 201 "Created", got 400 "Bad Request"

[Killed] EqualityOperator
routes/attendance.js:51:9
 // build the canonical attendance record object
 function buildAttendanceRecord({ id, studentId, courseId, date, status }) {
   const rec = {
-    id: id !== undefined ? id : undefined,
+    id: id === undefined ? id : undefined,
     studentId: studentId !== undefined ? studentId : undefined,
     courseId: courseId !== undefined ? courseId : undefined,
killedBy: Attendance Integration Tests (safe) POST /api/attendance → creates attendance record (201) and record retrievable
statusReason: expected { studentId: 4, courseId: 4, …(3) } to have property 'id'

[Killed] EqualityOperator
routes/attendance.js:52:16
 function buildAttendanceRecord({ id, studentId, courseId, date, status }) {
   const rec = {
     id: id !== undefined ? id : undefined,
-    studentId: studentId !== undefined ? studentId : undefined,
+    studentId: studentId === undefined ? studentId : undefined,
     courseId: courseId !== undefined ? courseId : undefined,
     date: normalizeString(date),
killedBy: Attendance Integration Tests (safe) POST /api/attendance → creates attendance record (201) and record retrievable
statusReason: expected NaN to equal 4

[Killed] EqualityOperator
routes/attendance.js:53:15
   const rec = {
     id: id !== undefined ? id : undefined,
     studentId: studentId !== undefined ? studentId : undefined,
-    courseId: courseId !== undefined ? courseId : undefined,
+    courseId: courseId === undefined ? courseId : undefined,
     date: normalizeString(date),
     status: normalizeString(status)
killedBy: Attendance Integration Tests (safe) POST /api/attendance → creates attendance record (201) and record retrievable
statusReason: expected NaN to equal 4

[Killed] EqualityOperator
routes/attendance.js:58:7
     status: normalizeString(status)
   };
   // drop undefined id for new records if not provided
-  if (rec.id === undefined) delete rec.id;
+  if (rec.id !== undefined) delete rec.id;
   return rec;
 }
killedBy: Attendance Integration Tests (safe) POST /api/attendance → creates attendance record (201) and record retrievable
statusReason: expected { studentId: 4, courseId: 4, …(3) } to have property 'id'

[Survived] EqualityOperator
routes/attendance.js:65:7
 // try to get id from DB result shapes: { lastID }, [{ lastID }], {id}
 function extractIdFromResult(result) {
   if (!result) return undefined;
-  if (typeof result === 'object') {
+  if (typeof result !== 'object') {
     if (result.id !== undefined) return result.id;
     if (result.lastID !== undefined) return result.lastID;

[Survived] EqualityOperator
routes/attendance.js:66:9
 function extractIdFromResult(result) {
   if (!result) return undefined;
   if (typeof result === 'object') {
-    if (result.id !== undefined) return result.id;
+    if (result.id === undefined) return result.id;
     if (result.lastID !== undefined) return result.lastID;
     if (Array.isArray(result) && result[0] && result[0].lastID !== undefined) return result[0].lastID;

[Survived] EqualityOperator
routes/attendance.js:67:9
   if (!result) return undefined;
   if (typeof result === 'object') {
     if (result.id !== undefined) return result.id;
-    if (result.lastID !== undefined) return result.lastID;
+    if (result.lastID === undefined) return result.lastID;
     if (Array.isArray(result) && result[0] && result[0].lastID !== undefined) return result[0].lastID;
   }

[Survived] EqualityOperator
routes/attendance.js:68:47
   if (typeof result === 'object') {
     if (result.id !== undefined) return result.id;
     if (result.lastID !== undefined) return result.lastID;
-    if (Array.isArray(result) && result[0] && result[0].lastID !== undefined) return result[0].lastID;
+    if (Array.isArray(result) && result[0] && result[0].lastID === undefined) return result[0].lastID;
   }
   if (typeof result === 'number' || typeof result === 'string') return result;

[Survived] LogicalOperator
routes/attendance.js:68:9
   if (typeof result === 'object') {
     if (result.id !== undefined) return result.id;
     if (result.lastID !== undefined) return result.lastID;
-    if (Array.isArray(result) && result[0] && result[0].lastID !== undefined) return result[0].lastID;
+    if (Array.isArray(result) && result[0] || result[0].lastID !== undefined) return result[0].lastID;
   }
   if (typeof result === 'number' || typeof result === 'string') return result;

[Survived] LogicalOperator
routes/attendance.js:70:7
     if (result.lastID !== undefined) return result.lastID;
     if (Array.isArray(result) && result[0] && result[0].lastID !== undefined) return result[0].lastID;
   }
-  if (typeof result === 'number' || typeof result === 'string') return result;
+  if (typeof result === 'number' && typeof result === 'string') return result;
   return undefined;
 }

[Survived] EqualityOperator
routes/attendance.js:70:37
     if (result.lastID !== undefined) return result.lastID;
     if (Array.isArray(result) && result[0] && result[0].lastID !== undefined) return result[0].lastID;
   }
-  if (typeof result === 'number' || typeof result === 'string') return result;
+  if (typeof result === 'number' || typeof result !== 'string') return result;
   return undefined;
 }

[Killed] LogicalOperator
routes/attendance.js:86:26
 };
 
 /* In-memory fallback store (used only when DB create fails) */
-router.__fallbackStore = router.__fallbackStore || [];
+router.__fallbackStore = router.__fallbackStore && [];
 
 /* normalize object before returning */
killedBy: Attendance Integration Tests (safe) POST /api/attendance → creates attendance record (201) and record retrievable
statusReason: expected 201 "Created", got 500 "Internal Server Error"

[Survived] LogicalOperator
routes/attendance.js:90:7
 
 /* normalize object before returning */
 function normalizeAttendanceObj(obj) {
-  if (!obj || typeof obj !== 'object') return obj;
+  if (!obj && typeof obj !== 'object') return obj;
   const copy = { ...obj };
   if (copy.date !== undefined) copy.date = normalizeString(copy.date);

[Survived] EqualityOperator
routes/attendance.js:90:15
 
 /* normalize object before returning */
 function normalizeAttendanceObj(obj) {
-  if (!obj || typeof obj !== 'object') return obj;
+  if (!obj || typeof obj === 'object') return obj;
   const copy = { ...obj };
   if (copy.date !== undefined) copy.date = normalizeString(copy.date);

[Killed] ObjectLiteral
routes/attendance.js:91:16
 /* normalize object before returning */
 function normalizeAttendanceObj(obj) {
   if (!obj || typeof obj !== 'object') return obj;
-  const copy = { ...obj };
+  const copy = {};
   if (copy.date !== undefined) copy.date = normalizeString(copy.date);
   if (copy.status !== undefined) copy.status = normalizeString(copy.status);
killedBy: Attendance Integration Tests (safe) POST /api/attendance → creates attendance record (201) and record retrievable
statusReason: expected {} to have property 'id'

[Survived] EqualityOperator
routes/attendance.js:92:7
 function normalizeAttendanceObj(obj) {
   if (!obj || typeof obj !== 'object') return obj;
   const copy = { ...obj };
-  if (copy.date !== undefined) copy.date = normalizeString(copy.date);
+  if (copy.date === undefined) copy.date = normalizeString(copy.date);
   if (copy.status !== undefined) copy.status = normalizeString(copy.status);
   return copy;

[Survived] EqualityOperator
routes/attendance.js:93:7
   if (!obj || typeof obj !== 'object') return obj;
   const copy = { ...obj };
   if (copy.date !== undefined) copy.date = normalizeString(copy.date);
-  if (copy.status !== undefined) copy.status = normalizeString(copy.status);
+  if (copy.status === undefined) copy.status = normalizeString(copy.status);
   return copy;
 }

[Survived] EqualityOperator
routes/attendance.js:104:46
   try {
     let rows = [];
     // prefer explicit listing functions if provided
-    if (attendanceService.listAttendances && typeof attendanceService.listAttendances === 'function') {
+    if (attendanceService.listAttendances && typeof attendanceService.listAttendances !== 'function') {
       rows = await attendanceService.listAttendances();
     } else if (attendanceService.getAll && typeof attendanceService.getAll === 'function') {

[Survived] LogicalOperator
routes/attendance.js:104:9
   try {
     let rows = [];
     // prefer explicit listing functions if provided
-    if (attendanceService.listAttendances && typeof attendanceService.listAttendances === 'function') {
+    if (attendanceService.listAttendances || typeof attendanceService.listAttendances === 'function') {
       rows = await attendanceService.listAttendances();
     } else if (attendanceService.getAll && typeof attendanceService.getAll === 'function') {

[Survived] EqualityOperator
routes/attendance.js:106:44
     // prefer explicit listing functions if provided
     if (attendanceService.listAttendances && typeof attendanceService.listAttendances === 'function') {
       rows = await attendanceService.listAttendances();
-    } else if (attendanceService.getAll && typeof attendanceService.getAll === 'function') {
+    } else if (attendanceService.getAll && typeof attendanceService.getAll !== 'function') {
       rows = await attendanceService.getAll();
     } else if (attendanceService.query && typeof attendanceService.query === 'function') {

[Survived] LogicalOperator
routes/attendance.js:106:16
     // prefer explicit listing functions if provided
     if (attendanceService.listAttendances && typeof attendanceService.listAttendances === 'function') {
       rows = await attendanceService.listAttendances();
-    } else if (attendanceService.getAll && typeof attendanceService.getAll === 'function') {
+    } else if (attendanceService.getAll || typeof attendanceService.getAll === 'function') {
       rows = await attendanceService.getAll();
     } else if (attendanceService.query && typeof attendanceService.query === 'function') {

[Survived] LogicalOperator
routes/attendance.js:108:16
       rows = await attendanceService.listAttendances();
     } else if (attendanceService.getAll && typeof attendanceService.getAll === 'function') {
       rows = await attendanceService.getAll();
-    } else if (attendanceService.query && typeof attendanceService.query === 'function') {
+    } else if (attendanceService.query || typeof attendanceService.query === 'function') {
       try {
         rows = await attendanceService.query('SELECT * FROM attendance');

[Survived] EqualityOperator
routes/attendance.js:108:43
       rows = await attendanceService.listAttendances();
     } else if (attendanceService.getAll && typeof attendanceService.getAll === 'function') {
       rows = await attendanceService.getAll();
-    } else if (attendanceService.query && typeof attendanceService.query === 'function') {
+    } else if (attendanceService.query && typeof attendanceService.query !== 'function') {
       try {
         rows = await attendanceService.query('SELECT * FROM attendance');

[Survived] LogicalOperator
routes/attendance.js:112:58
       try {
         rows = await attendanceService.query('SELECT * FROM attendance');
       } catch (e) {
-        debugLog('attendance.get fallback query failed', e && e.message ? e.message : e);
+        debugLog('attendance.get fallback query failed', e || e.message ? e.message : e);
         rows = [];
       }

[Survived] LogicalOperator
routes/attendance.js:123:39
     const fallbackRows = Array.isArray(router.__fallbackStore) ? router.__fallbackStore.map(normalizeAttendanceObj) : [];
     return res.status(200).json(normalizedRows.concat(fallbackRows));
   } catch (err) {
-    debugLog('attendance.get caught', err && err.message ? err.message : err);
+    debugLog('attendance.get caught', err || err.message ? err.message : err);
     return res.status(200).json(Array.isArray(router.__fallbackStore) ? router.__fallbackStore : []);
   }

[Killed] LogicalOperator
routes/attendance.js:140:19
      - if create throws for other reasons, fall back to in-memory store (safe for tests)
 */
 router.post('/', async (req, res) => {
-  const payload = req.body || {};
+  const payload = req.body && {};
   const studentId = payload.studentId !== undefined ? payload.studentId : null;
   const courseId = payload.courseId !== undefined ? payload.courseId : null;
killedBy: Attendance Integration Tests (safe) POST /api/attendance → creates attendance record (201) and record retrievable
statusReason: expected 201 "Created", got 400 "Bad Request"

[Killed] EqualityOperator
routes/attendance.js:141:21
 */
 router.post('/', async (req, res) => {
   const payload = req.body || {};
-  const studentId = payload.studentId !== undefined ? payload.studentId : null;
+  const studentId = payload.studentId === undefined ? payload.studentId : null;
   const courseId = payload.courseId !== undefined ? payload.courseId : null;
   const date = normalizeString(payload.date);
killedBy: Attendance Integration Tests (safe) POST /api/attendance → creates attendance record (201) and record retrievable
statusReason: expected 201 "Created", got 400 "Bad Request"

[Killed] EqualityOperator
routes/attendance.js:142:20
 router.post('/', async (req, res) => {
   const payload = req.body || {};
   const studentId = payload.studentId !== undefined ? payload.studentId : null;
-  const courseId = payload.courseId !== undefined ? payload.courseId : null;
+  const courseId = payload.courseId === undefined ? payload.courseId : null;
   const date = normalizeString(payload.date);
   const status = normalizeString(payload.status);
killedBy: Attendance Integration Tests (safe) POST /api/attendance → creates attendance record (201) and record retrievable
statusReason: expected 201 "Created", got 400 "Bad Request"

[Timeout] EqualityOperator
routes/attendance.js:150:7
 
   // validation — try service validator first if exists
   let validation;
-  if (typeof attendanceService.validateAttendancePayload === 'function') {
+  if (typeof attendanceService.validateAttendancePayload !== 'function') {
     validation = attendanceService.validateAttendancePayload({ studentId, courseId, date, status });
   } else {

[Killed] EqualityOperator
routes/attendance.js:158:27
     if (!isPresent(courseId)) errors.push('courseId required');
     if (!isValidDateISO(date)) errors.push('invalid date');
     if (!isAllowedStatus(status)) errors.push('invalid status');
-    validation = { valid: errors.length === 0, errors };
+    validation = { valid: errors.length !== 0, errors };
   }
 
killedBy: Attendance Integration Tests (safe) POST /api/attendance → creates attendance record (201) and record retrievable
statusReason: expected 201 "Created", got 400 "Bad Request"

[Killed] ObjectLiteral
routes/attendance.js:158:18
     if (!isPresent(courseId)) errors.push('courseId required');
     if (!isValidDateISO(date)) errors.push('invalid date');
     if (!isAllowedStatus(status)) errors.push('invalid status');
-    validation = { valid: errors.length === 0, errors };
+    validation = {};
   }
 
killedBy: Attendance Integration Tests (safe) POST /api/attendance → creates attendance record (201) and record retrievable
statusReason: expected 201 "Created", got 400 "Bad Request"

[Survived] LogicalOperator
routes/attendance.js:162:43
   }
 
   if (!validation.valid) {
-    return res.status(400).json({ errors: validation.errors || ['validation failed'] });
+    return res.status(400).json({ errors: validation.errors && ['validation failed'] });
   }
 

[Survived] EqualityOperator
routes/attendance.js:167:9
 
   // attempt create with retry on missing-schema
   async function attemptCreate() {
-    if (typeof attendanceService.createAttendance === 'function') {
+    if (typeof attendanceService.createAttendance !== 'function') {
       return attendanceService.createAttendance({ studentId, courseId, date, status });
     }

[Survived] LogicalOperator
routes/attendance.js:177:49
   try {
     created = await attemptCreate();
   } catch (err) {
-    debugLog('attendance.create error (first)', err && err.message ? err.message : err);
+    debugLog('attendance.create error (first)', err || err.message ? err.message : err);
 
     const msg = err && err.message ? String(err.message) : '';

[Survived] LogicalOperator
routes/attendance.js:179:17
   } catch (err) {
     debugLog('attendance.create error (first)', err && err.message ? err.message : err);
 
-    const msg = err && err.message ? String(err.message) : '';
+    const msg = err || err.message ? String(err.message) : '';
     if (/no such table/i.test(msg) || /no such column/i.test(msg)) {
       const init = attendanceService.ensureSchema

[Survived] LogicalOperator
routes/attendance.js:180:9
     debugLog('attendance.create error (first)', err && err.message ? err.message : err);
 
     const msg = err && err.message ? String(err.message) : '';
-    if (/no such table/i.test(msg) || /no such column/i.test(msg)) {
+    if (/no such table/i.test(msg) && /no such column/i.test(msg)) {
       const init = attendanceService.ensureSchema
         || attendanceService.initializeSchema

[Survived] LogicalOperator
routes/attendance.js:181:20
 
     const msg = err && err.message ? String(err.message) : '';
     if (/no such table/i.test(msg) || /no such column/i.test(msg)) {
-      const init = attendanceService.ensureSchema
-        || attendanceService.initializeSchema
-        || attendanceService.createSchema
-        || attendanceService.setupSchema;
+      const init = (attendanceService.ensureSchema || attendanceService.initializeSchema || attendanceService.createSchema) && attendanceService.setupSchema;
       if (init && typeof init === 'function') {
         try {

[Survived] LogicalOperator
routes/attendance.js:181:20
 
     const msg = err && err.message ? String(err.message) : '';
     if (/no such table/i.test(msg) || /no such column/i.test(msg)) {
-      const init = attendanceService.ensureSchema
-        || attendanceService.initializeSchema
-        || attendanceService.createSchema
+      const init = (attendanceService.ensureSchema || attendanceService.initializeSchema) && attendanceService.createSchema
         || attendanceService.setupSchema;
       if (init && typeof init === 'function') {

[Survived] EqualityOperator
routes/attendance.js:185:19
         || attendanceService.initializeSchema
         || attendanceService.createSchema
         || attendanceService.setupSchema;
-      if (init && typeof init === 'function') {
+      if (init && typeof init !== 'function') {
         try {
           await init();

[Survived] LogicalOperator
routes/attendance.js:185:11
         || attendanceService.initializeSchema
         || attendanceService.createSchema
         || attendanceService.setupSchema;
-      if (init && typeof init === 'function') {
+      if (init || typeof init === 'function') {
         try {
           await init();
