[Survived] LogicalOperator
routes/attendance.js:190:65
           await init();
           created = await attemptCreate();
         } catch (err2) {
-          debugLog('attendance.create retry after init failed', err2 && err2.message ? err2.message : err2);
+          debugLog('attendance.create retry after init failed', err2 || err2.message ? err2.message : err2);
           return res.status(500).json(buildError(err2 && err2.message ? err2.message : 'internal error'));
         }

[Survived] LogicalOperator
routes/attendance.js:191:50
           created = await attemptCreate();
         } catch (err2) {
           debugLog('attendance.create retry after init failed', err2 && err2.message ? err2.message : err2);
-          return res.status(500).json(buildError(err2 && err2.message ? err2.message : 'internal error'));
+          return res.status(500).json(buildError(err2 || err2.message ? err2.message : 'internal error'));
         }
       } else {

[Survived] LogicalOperator
routes/attendance.js:194:48
           return res.status(500).json(buildError(err2 && err2.message ? err2.message : 'internal error'));
         }
       } else {
-        return res.status(500).json(buildError(msg || 'internal error'));
+        return res.status(500).json(buildError(msg && 'internal error'));
       }
     } else {

[Survived] LogicalOperator
routes/attendance.js:204:48
         router.__fallbackStore.push(fallback);
         return res.status(201).json(normalizeAttendanceObj(fallback));
       } catch (e) {
-        debugLog('attendance.fallback failed', e && e.message ? e.message : e);
+        debugLog('attendance.fallback failed', e || e.message ? e.message : e);
         return res.status(500).json(buildError(msg || 'internal error'));
       }

[Survived] LogicalOperator
routes/attendance.js:205:48
         return res.status(201).json(normalizeAttendanceObj(fallback));
       } catch (e) {
         debugLog('attendance.fallback failed', e && e.message ? e.message : e);
-        return res.status(500).json(buildError(msg || 'internal error'));
+        return res.status(500).json(buildError(msg && 'internal error'));
       }
     }

[Killed] EqualityOperator
routes/attendance.js:213:9
   try {
     // if created exists, try to extract id and fetch full record
     const id = extractIdFromResult(created);
-    if (id !== undefined) {
+    if (id === undefined) {
       if (typeof attendanceService.getAttendanceById === 'function') {
         const fetched = await attendanceService.getAttendanceById(id);
killedBy: Attendance Integration Tests (safe) POST /api/attendance → creates attendance record (201) and record retrievable
statusReason: expected { studentId: 4, courseId: 4, …(2) } to have property 'id'

[Survived] EqualityOperator
routes/attendance.js:214:11
     // if created exists, try to extract id and fetch full record
     const id = extractIdFromResult(created);
     if (id !== undefined) {
-      if (typeof attendanceService.getAttendanceById === 'function') {
+      if (typeof attendanceService.getAttendanceById !== 'function') {
         const fetched = await attendanceService.getAttendanceById(id);
         if (fetched) {

[Survived] LogicalOperator
routes/attendance.js:220:13
           return res.status(201).json(normalizeAttendanceObj(fetched));
         }
         // if fetched not available, but created object present, return normalized created
-        if (created && typeof created === 'object') {
+        if (created || typeof created === 'object') {
           return res.status(201).json(normalizeAttendanceObj(created));
         }

[Survived] EqualityOperator
routes/attendance.js:220:24
           return res.status(201).json(normalizeAttendanceObj(fetched));
         }
         // if fetched not available, but created object present, return normalized created
-        if (created && typeof created === 'object') {
+        if (created && typeof created !== 'object') {
           return res.status(201).json(normalizeAttendanceObj(created));
         }

[Survived] EqualityOperator
routes/attendance.js:225:24
         }
       } else {
         // service doesn't provide getAttendanceById — return normalized created or minimal record
-        if (created && typeof created === 'object') {
+        if (created && typeof created !== 'object') {
           return res.status(201).json(normalizeAttendanceObj(created));
         }

[Survived] LogicalOperator
routes/attendance.js:225:13
         }
       } else {
         // service doesn't provide getAttendanceById — return normalized created or minimal record
-        if (created && typeof created === 'object') {
+        if (created || typeof created === 'object') {
           return res.status(201).json(normalizeAttendanceObj(created));
         }

[Killed] LogicalOperator
routes/attendance.js:233:9
     }
 
     // created may be a full object without id but with fields
-    if (created && typeof created === 'object' && Object.keys(created).length > 0) {
+    if (created || typeof created === 'object' && Object.keys(created).length > 0) {
       return res.status(201).json(normalizeAttendanceObj(created));
     }
killedBy: Attendance Integration Tests (safe) POST /api/attendance → creates attendance record (201) and record retrievable
statusReason: expected 201 "Created", got 500 "Internal Server Error"

[Killed] LogicalOperator
routes/attendance.js:233:9
     }
 
     // created may be a full object without id but with fields
-    if (created && typeof created === 'object' && Object.keys(created).length > 0) {
+    if (created && typeof created === 'object' || Object.keys(created).length > 0) {
       return res.status(201).json(normalizeAttendanceObj(created));
     }
killedBy: Attendance Integration Tests (safe) POST /api/attendance → creates attendance record (201) and record retrievable
statusReason: expected 201 "Created", got 500 "Internal Server Error"

[Survived] EqualityOperator
routes/attendance.js:238:55
     }
 
     // created might be a primitive id
-    if (created !== null && created !== undefined && (typeof created === 'number' || typeof created === 'string')) {
+    if (created !== null && created !== undefined && (typeof created !== 'number' || typeof created === 'string')) {
       if (typeof attendanceService.getAttendanceById === 'function') {
         const fetched = await attendanceService.getAttendanceById(created);

[Survived] LogicalOperator
routes/attendance.js:238:9
     }
 
     // created might be a primitive id
-    if (created !== null && created !== undefined && (typeof created === 'number' || typeof created === 'string')) {
+    if (created !== null || created !== undefined && (typeof created === 'number' || typeof created === 'string')) {
       if (typeof attendanceService.getAttendanceById === 'function') {
         const fetched = await attendanceService.getAttendanceById(created);

[Survived] EqualityOperator
routes/attendance.js:239:11
 
     // created might be a primitive id
     if (created !== null && created !== undefined && (typeof created === 'number' || typeof created === 'string')) {
-      if (typeof attendanceService.getAttendanceById === 'function') {
+      if (typeof attendanceService.getAttendanceById !== 'function') {
         const fetched = await attendanceService.getAttendanceById(created);
         if (fetched) return res.status(201).json(normalizeAttendanceObj(fetched));

[Killed] ObjectLiteral
routes/attendance.js:247:44
     }
 
     // nothing returned by create — fallback to in-memory store
-    const fallback = buildAttendanceRecord({ id: `fb-${Date.now()}-${Math.floor(Math.random() * 10000)}`, studentId, courseId, date, status });
+    const fallback = buildAttendanceRecord({});
     fallback._fallback = true;
     router.__fallbackStore.push(fallback);
killedBy: Attendance Integration Tests (safe) POST /api/attendance → creates attendance record (201) and record retrievable
statusReason: expected { date: '', status: '', …(1) } to have property 'id'

[Survived] LogicalOperator
routes/attendance.js:252:45
     router.__fallbackStore.push(fallback);
     return res.status(201).json(normalizeAttendanceObj(fallback));
   } catch (err) {
-    debugLog('attendance.post final error', err && err.message ? err.message : err);
+    debugLog('attendance.post final error', err || err.message ? err.message : err);
     return res.status(500).json(buildError(err && err.message ? err.message : null));
   }

[Survived] LogicalOperator
routes/attendance.js:253:44
     return res.status(201).json(normalizeAttendanceObj(fallback));
   } catch (err) {
     debugLog('attendance.post final error', err && err.message ? err.message : err);
-    return res.status(500).json(buildError(err && err.message ? err.message : null));
+    return res.status(500).json(buildError(err || err.message ? err.message : null));
   }
 });
