[Killed] ObjectLiteral
routes/students.js:9:10
 
 function normalizeStudentPayload(payload) {
   // ensure strings, provide defaults, keep minimal fields required by schema
-  return {
-    admissionNo: payload.admissionNo ? String(payload.admissionNo) : null,
-    firstName: payload.firstName ? String(payload.firstName) : null,
-    lastName: payload.lastName ? String(payload.lastName) : '',
-    email: payload.email ? String(payload.email) : ''
-  };
+  return {};
 }
 
killedBy: Attendance Integration Tests (safe) GET /api/attendance → returns array
statusReason: expected 201 "Created", got 500 "Internal Server Error"

[Survived] ObjectLiteral
routes/students.js:76:33
     return res.json(mapped);
   } catch (err) {
     console.error('GET /students error:', err);
-    return res.status(500).json({ error: err.message });
+    return res.status(500).json({});
   }
 });

[Survived] ObjectLiteral
routes/students.js:96:58
       }
     } else {
       const localValid = validateStudentPayloadLocal(payload);
-      if (!localValid.valid) return res.status(400).json({ errors: localValid.errors });
+      if (!localValid.valid) return res.status(400).json({});
     }
 

[Killed] ObjectLiteral
routes/students.js:119:33
     return res.status(201).json(mapped);
   } catch (err) {
     console.error('POST /students error:', err);
-    return res.status(500).json({ error: err.message });
+    return res.status(500).json({});
   }
 });
killedBy: Students Integration Tests (safe) POST /api/students → DB error path: drop students table yields 500 and error shape (restores DB afterwards)
statusReason: expected false to equal true
