[Killed] BooleanLiteral
services/attendanceService.js:15:18
 
 function isValidDateISO(date) {
   const m = /^\d{4}-\d{2}-\d{2}$/.test(date);
-  if (!m) return false;
+  if (!m) return true;
   const d = new Date(date);
   return !isNaN(d);
killedBy: All tests
statusReason: > student-management-backend@1.0.0 test
> npm run test:unit



> student-management-backend@1.0.0 test:unit
> mocha --recursive test/unit

[Killed] ArrayDeclaration
services/attendanceService.js:23:20
 function parseCsv(text = "") {
   const lines = text.trim().split(/\r?\n/);
   const header = lines[0].split(",");
-  const required = ["studentId", "courseId", "date", "status"];
+  const required = [];
   const errors = [];
   if (!required.every((h) => header.includes(h))) {
killedBy: All tests
statusReason: > student-management-backend@1.0.0 test
> npm run test:unit



> student-management-backend@1.0.0 test:unit
> mocha --recursive test/unit

[Killed] BlockStatement
services/attendanceService.js:25:51
   const header = lines[0].split(",");
   const required = ["studentId", "courseId", "date", "status"];
   const errors = [];
-  if (!required.every((h) => header.includes(h))) {
-    errors.push("missing columns");
-    return { rows: [], errors };
-  }
+  if (!required.every((h) => header.includes(h))) {}
 
   const idx = Object.fromEntries(header.map((h, i) => [h, i]));
killedBy: All tests
statusReason: > student-management-backend@1.0.0 test
> npm run test:unit



> student-management-backend@1.0.0 test:unit
> mocha --recursive test/unit

[Killed] BooleanLiteral
services/attendanceService.js:38:9
     const row = {};
     header.forEach((h) => (row[h] = cols[idx[h]] || ""));
 
-    if (!row.studentId || !row.courseId || !row.status) {
+    if (row.studentId || !row.courseId || !row.status) {
       errors.push("missing required fields");
       continue;
killedBy: All tests
statusReason: > student-management-backend@1.0.0 test
> npm run test:unit



> student-management-backend@1.0.0 test:unit
> mocha --recursive test/unit

[Killed] BooleanLiteral
services/attendanceService.js:38:27
     const row = {};
     header.forEach((h) => (row[h] = cols[idx[h]] || ""));
 
-    if (!row.studentId || !row.courseId || !row.status) {
+    if (!row.studentId || row.courseId || !row.status) {
       errors.push("missing required fields");
       continue;
killedBy: All tests
statusReason: > student-management-backend@1.0.0 test
> npm run test:unit



> student-management-backend@1.0.0 test:unit
> mocha --recursive test/unit

[Survived] StringLiteral
services/attendanceService.js:43:48
       continue;
     }
 
-    if (!isValidDateISO(row.date)) errors.push("invalid date");
+    if (!isValidDateISO(row.date)) errors.push("");
     row.status = row.status.toLowerCase();
 

[Killed] EqualityOperator
services/attendanceService.js:60:39
 // Insert/update attendance row
 function markStatus(rows = [], sid, cid, date, status = "present", force = false) {
   const key = `${sid}::${cid}::${date}`;
-  const index = rows.findIndex((r) => `${r.studentId}::${r.courseId}::${r.date}` === key);
+  const index = rows.findIndex((r) => `${r.studentId}::${r.courseId}::${r.date}` !== key);
 
   if (index === -1) {
killedBy: All tests
statusReason: > student-management-backend@1.0.0 test
> npm run test:unit



> student-management-backend@1.0.0 test:unit
> mocha --recursive test/unit

[Killed] StringLiteral
services/attendanceService.js:60:39
 // Insert/update attendance row
 function markStatus(rows = [], sid, cid, date, status = "present", force = false) {
   const key = `${sid}::${cid}::${date}`;
-  const index = rows.findIndex((r) => `${r.studentId}::${r.courseId}::${r.date}` === key);
+  const index = rows.findIndex((r) => `` === key);
 
   if (index === -1) {
killedBy: All tests
statusReason: > student-management-backend@1.0.0 test
> npm run test:unit



> student-management-backend@1.0.0 test:unit
> mocha --recursive test/unit

[Killed] EqualityOperator
services/attendanceService.js:84:35
 }
 
 function findMissingDates(rows = [], sid, dates = []) {
-  const done = rows.filter((r) => r.studentId === sid).map((x) => x.date);
+  const done = rows.filter((r) => r.studentId !== sid).map((x) => x.date);
   return dates.filter((d) => !done.includes(d));
 }
killedBy: All tests
statusReason: > student-management-backend@1.0.0 test
> npm run test:unit



> student-management-backend@1.0.0 test:unit
> mocha --recursive test/unit

[Killed] EqualityOperator
services/attendanceService.js:89:37
 }
 
 function consecutiveAbsences(rows = [], sid) {
-  const sorted = rows.filter((r) => r.studentId === sid).sort((a, b) => a.date.localeCompare(b.date));
+  const sorted = rows.filter((r) => r.studentId !== sid).sort((a, b) => a.date.localeCompare(b.date));
   let streak = 0,
     max = 0;
killedBy: All tests
statusReason: > student-management-backend@1.0.0 test
> npm run test:unit



> student-management-backend@1.0.0 test:unit
> mocha --recursive test/unit

[Killed] BlockStatement
services/attendanceService.js:94:32
     max = 0;
 
   for (const r of sorted) {
-    if (r.status === "absent") {
-      streak++;
-      max = Math.max(max, streak);
-    } else {
+    if (r.status === "absent") {} else {
       streak = 0;
     }
killedBy: All tests
statusReason: > student-management-backend@1.0.0 test
> npm run test:unit



> student-management-backend@1.0.0 test:unit
> mocha --recursive test/unit
