[Killed] LogicalOperator
services/courseService.js:6:11
 function rowToCourse(r = {}) {
   return {
     id: r.id,
-    code: r.code || "",
+    code: r.code && "",
     name: r.name || "",
     instructor: r.instructor || "",
killedBy: All tests
statusReason: > student-management-backend@1.0.0 test
> npm run test:unit



> student-management-backend@1.0.0 test:unit
> mocha --recursive test/unit

[Survived] LogicalOperator
services/courseService.js:7:11
   return {
     id: r.id,
     code: r.code || "",
-    name: r.name || "",
+    name: r.name && "",
     instructor: r.instructor || "",
     credits: r.credits || 0,

[Survived] LogicalOperator
services/courseService.js:8:17
     id: r.id,
     code: r.code || "",
     name: r.name || "",
-    instructor: r.instructor || "",
+    instructor: r.instructor && "",
     credits: r.credits || 0,
   };

[Survived] LogicalOperator
services/courseService.js:9:14
     code: r.code || "",
     name: r.name || "",
     instructor: r.instructor || "",
-    credits: r.credits || 0,
+    credits: r.credits && 0,
   };
 }

[Survived] EqualityOperator
services/courseService.js:19:10
 
 // Cut long course name
 function abbreviateCourseName(name = "", len = 20) {
-  return name.length <= len ? name : name.slice(0, len - 3) + "...";
+  return name.length < len ? name : name.slice(0, len - 3) + "...";
 }
 

[Killed] Regex
services/courseService.js:24:38
 
 // Split "CS101" → {subject: "CS", number: "101"}
 function parseCourseCode(code = "") {
-  const m = code.toUpperCase().match(/^([A-Z]+)(\d+)$/);
+  const m = code.toUpperCase().match(/^([A-Z]+)(\D+)$/);
   return m ? { subject: m[1], number: m[2] } : { subject: code, number: "" };
 }
killedBy: All tests
statusReason: > student-management-backend@1.0.0 test
> npm run test:unit



> student-management-backend@1.0.0 test:unit
> mocha --recursive test/unit

[Survived] Regex
services/courseService.js:29:35
 }
 
 function syllabusSnippet(text = "", words = 20) {
-  const parts = text.trim().split(/\s+/);
+  const parts = text.trim().split(/\S+/);
   return parts.length <= words ? text : parts.slice(0, words).join(" ") + "...";
 }

[Killed] EqualityOperator
services/courseService.js:30:10
 
 function syllabusSnippet(text = "", words = 20) {
   const parts = text.trim().split(/\s+/);
-  return parts.length <= words ? text : parts.slice(0, words).join(" ") + "...";
+  return parts.length > words ? text : parts.slice(0, words).join(" ") + "...";
 }
 
killedBy: All tests
statusReason: > student-management-backend@1.0.0 test
> npm run test:unit



> student-management-backend@1.0.0 test:unit
> mocha --recursive test/unit

[Killed] LogicalOperator
services/courseService.js:38:10
 }
 
 function isValidCredits(c) {
-  return Number(c) >= 0 && Number(c) <= 10;
+  return Number(c) >= 0 || Number(c) <= 10;
 }
 
killedBy: All tests
statusReason: > student-management-backend@1.0.0 test
> npm run test:unit



> student-management-backend@1.0.0 test:unit
> mocha --recursive test/unit

[Killed] EqualityOperator
services/courseService.js:38:28
 }
 
 function isValidCredits(c) {
-  return Number(c) >= 0 && Number(c) <= 10;
+  return Number(c) >= 0 && Number(c) < 10;
 }
 
killedBy: All tests
statusReason: > student-management-backend@1.0.0 test
> npm run test:unit



> student-management-backend@1.0.0 test:unit
> mocha --recursive test/unit

[Killed] BooleanLiteral
services/courseService.js:42:46
 }
 
 function validateCoursePayload(p = {}) {
-  if (!p || !p.code || !p.name) return { ok: false };
+  if (!p || !p.code || !p.name) return { ok: true };
   if (p.credits && !isValidCredits(p.credits)) return { ok: false };
   return { ok: true };
killedBy: All tests
statusReason: > student-management-backend@1.0.0 test
> npm run test:unit



> student-management-backend@1.0.0 test:unit
> mocha --recursive test/unit

[Survived] StringLiteral
services/courseService.js:50:21
 function buildCourseRecord(p = {}) {
   return {
     code: normalizeCourseCode(p.code),
-    name: p.name || "",
+    name: p.name || "Stryker was here!",
     instructor: p.instructor || "",
     credits: p.credits || 0,

[Survived] StringLiteral
services/courseService.js:51:33
   return {
     code: normalizeCourseCode(p.code),
     name: p.name || "",
-    instructor: p.instructor || "",
+    instructor: p.instructor || "Stryker was here!",
     credits: p.credits || 0,
   };

[Killed] LogicalOperator
services/courseService.js:52:14
     code: normalizeCourseCode(p.code),
     name: p.name || "",
     instructor: p.instructor || "",
-    credits: p.credits || 0,
+    credits: p.credits && 0,
   };
 }
killedBy: All tests
statusReason: > student-management-backend@1.0.0 test
> npm run test:unit



> student-management-backend@1.0.0 test:unit
> mocha --recursive test/unit

[Killed] LogicalOperator
services/courseService.js:59:5
 function matchesQuery(q = "", course = {}) {
   q = q.toLowerCase();
   return (
-    course.code?.toLowerCase().includes(q) ||
-    course.name?.toLowerCase().includes(q) ||
+    course.code?.toLowerCase().includes(q) && course.name?.toLowerCase().includes(q) ||
     course.instructor?.toLowerCase().includes(q)
   );
killedBy: All tests
statusReason: > student-management-backend@1.0.0 test
> npm run test:unit



> student-management-backend@1.0.0 test:unit
> mocha --recursive test/unit

[Killed] OptionalChaining
services/courseService.js:59:5
 function matchesQuery(q = "", course = {}) {
   q = q.toLowerCase();
   return (
-    course.code?.toLowerCase().includes(q) ||
+    course.code.toLowerCase().includes(q) ||
     course.name?.toLowerCase().includes(q) ||
     course.instructor?.toLowerCase().includes(q)
killedBy: All tests
statusReason: > student-management-backend@1.0.0 test
> npm run test:unit



> student-management-backend@1.0.0 test:unit
> mocha --recursive test/unit
