[Killed] BooleanLiteral
services/enrollmentService.js:4:41
 // services/enrollmentService.js
 
 function validateEnrollment(payload = {}) {
-  if (!payload || !payload.studentId || !payload.courseId)
+  if (!payload || !payload.studentId || payload.courseId)
     return { ok: false, reason: 'Missing studentId or courseId' };
   return { ok: true };
killedBy: All tests
statusReason: > student-management-backend@1.0.0 test
> npm run test:unit



> student-management-backend@1.0.0 test:unit
> mocha --recursive test/unit

[Killed] LogicalOperator
services/enrollmentService.js:4:7
 // services/enrollmentService.js
 
 function validateEnrollment(payload = {}) {
-  if (!payload || !payload.studentId || !payload.courseId)
+  if (!payload && !payload.studentId || !payload.courseId)
     return { ok: false, reason: 'Missing studentId or courseId' };
   return { ok: true };
killedBy: All tests
statusReason: > student-management-backend@1.0.0 test
> npm run test:unit



> student-management-backend@1.0.0 test:unit
> mocha --recursive test/unit

[Killed] BooleanLiteral
services/enrollmentService.js:10:7
 }
 
 function buildEnrollmentRecord(p = {}) {
-  if (!p.studentId || !p.courseId) throw new Error("Missing IDs");
+  if (p.studentId || !p.courseId) throw new Error("Missing IDs");
   return {
     studentId: p.studentId,
killedBy: All tests
statusReason: > student-management-backend@1.0.0 test
> npm run test:unit



> student-management-backend@1.0.0 test:unit
> mocha --recursive test/unit

[Killed] LogicalOperator
services/enrollmentService.js:28:28
 }
 
 function canEnroll(list = [], studentId, courseId) {
-  return !list.some((e) => e.studentId === studentId && e.courseId === courseId);
+  return !list.some((e) => e.studentId === studentId || e.courseId === courseId);
 }
 
killedBy: All tests
statusReason: > student-management-backend@1.0.0 test
> npm run test:unit



> student-management-backend@1.0.0 test:unit
> mocha --recursive test/unit

[Killed] EqualityOperator
services/enrollmentService.js:28:28
 }
 
 function canEnroll(list = [], studentId, courseId) {
-  return !list.some((e) => e.studentId === studentId && e.courseId === courseId);
+  return !list.some((e) => e.studentId !== studentId && e.courseId === courseId);
 }
 
killedBy: All tests
statusReason: > student-management-backend@1.0.0 test
> npm run test:unit



> student-management-backend@1.0.0 test:unit
> mocha --recursive test/unit
