[Killed] LogicalOperator
services/studentService.js:11:17
 
 // Capitalize each word (e.g., "raVi kumar" → "Ravi Kumar")
 function normalizeName(name = "") {
-  return String(name || "")
+  return String(name && "")
     .trim()
     .split(/\s+/)
killedBy: All tests
statusReason: > student-management-backend@1.0.0 test
> npm run test:unit



> student-management-backend@1.0.0 test:unit
> mocha --recursive test/unit

[Killed] StringLiteral
services/studentService.js:31:19
 // Mask email → ravi@example.com → r***i@example.com
 function maskEmail(email = "") {
   const e = normalizeEmail(email);
-  if (!e.includes("@")) return e;
+  if (!e.includes("")) return e;
   const [local, domain] = e.split("@");
   if (local.length <= 2) return `*@${domain}`;
killedBy: All tests
statusReason: > student-management-backend@1.0.0 test
> npm run test:unit



> student-management-backend@1.0.0 test:unit
> mocha --recursive test/unit

[Killed] EqualityOperator
services/studentService.js:33:7
   const e = normalizeEmail(email);
   if (!e.includes("@")) return e;
   const [local, domain] = e.split("@");
-  if (local.length <= 2) return `*@${domain}`;
+  if (local.length > 2) return `*@${domain}`;
   return `${local[0]}${"*".repeat(local.length - 2)}${local[local.length - 1]}@${domain}`;
 }
killedBy: All tests
statusReason: > student-management-backend@1.0.0 test
> npm run test:unit



> student-management-backend@1.0.0 test:unit
> mocha --recursive test/unit

[Killed] StringLiteral
services/studentService.js:34:10
   if (!e.includes("@")) return e;
   const [local, domain] = e.split("@");
   if (local.length <= 2) return `*@${domain}`;
-  return `${local[0]}${"*".repeat(local.length - 2)}${local[local.length - 1]}@${domain}`;
+  return ``;
 }
 
killedBy: All tests
statusReason: > student-management-backend@1.0.0 test
> npm run test:unit



> student-management-backend@1.0.0 test:unit
> mocha --recursive test/unit

[Killed] Regex
services/studentService.js:39:10
 
 function validatePhone(phone = "") {
   const cleaned = phone.replace(/[\s\-()]/g, "");
-  return /^\+?\d{6,15}$/.test(cleaned);
+  return /^\+\d{6,15}$/.test(cleaned);
 }
 
killedBy: All tests
statusReason: > student-management-backend@1.0.0 test
> npm run test:unit



> student-management-backend@1.0.0 test:unit
> mocha --recursive test/unit

[Killed] EqualityOperator
services/studentService.js:57:26
 
 function isAdult(dob, limit = 18) {
   const age = calculateAge(dob);
-  return age !== null && age >= limit;
+  return age !== null && age > limit;
 }
 
killedBy: All tests
statusReason: > student-management-backend@1.0.0 test
> npm run test:unit



> student-management-backend@1.0.0 test:unit
> mocha --recursive test/unit

[Survived] BlockStatement
services/studentService.js:63:17
 // Validation of student input
 function validateStudentPayload(payload = {}) {
   const errors = [];
-  if (!payload) {
-    return { valid: false, errors: ["firstName required", "lastName required"] };
-  }
+  if (!payload) {}
   if (!payload.firstName) errors.push("firstName required");
   if (!payload.lastName) errors.push("lastName required");

[Killed] StringLiteral
services/studentService.js:70:46
   if (!payload.lastName) errors.push("lastName required");
   if (payload.email) {
     const re = /^[^\s@]+@[^\s@]+\.[^\s@]+$/;
-    if (!re.test(payload.email)) errors.push("invalid email");
+    if (!re.test(payload.email)) errors.push("");
   }
   if (payload.phone && !validatePhone(payload.phone)) errors.push("invalid phone");
killedBy: All tests
statusReason: > student-management-backend@1.0.0 test
> npm run test:unit



> student-management-backend@1.0.0 test:unit
> mocha --recursive test/unit

[Killed] BooleanLiteral
services/studentService.js:72:24
     const re = /^[^\s@]+@[^\s@]+\.[^\s@]+$/;
     if (!re.test(payload.email)) errors.push("invalid email");
   }
-  if (payload.phone && !validatePhone(payload.phone)) errors.push("invalid phone");
+  if (payload.phone && validatePhone(payload.phone)) errors.push("invalid phone");
 
   return { valid: errors.length === 0, errors };
killedBy: All tests
statusReason: > student-management-backend@1.0.0 test
> npm run test:unit



> student-management-backend@1.0.0 test:unit
> mocha --recursive test/unit

[Survived] LogicalOperator
services/studentService.js:80:18
 // Build student DB object
 function buildStudentRecord(payload = {}, now = Date.now()) {
   return {
-    admissionNo: payload.admissionNo || "",
+    admissionNo: payload.admissionNo && "",
     firstName: payload.firstName || "",
     lastName: payload.lastName || "",

[Killed] LogicalOperator
services/studentService.js:81:16
 function buildStudentRecord(payload = {}, now = Date.now()) {
   return {
     admissionNo: payload.admissionNo || "",
-    firstName: payload.firstName || "",
+    firstName: payload.firstName && "",
     lastName: payload.lastName || "",
     dob: payload.dob || "",
killedBy: All tests
statusReason: > student-management-backend@1.0.0 test
> npm run test:unit



> student-management-backend@1.0.0 test:unit
> mocha --recursive test/unit

[Killed] LogicalOperator
services/studentService.js:82:15
   return {
     admissionNo: payload.admissionNo || "",
     firstName: payload.firstName || "",
-    lastName: payload.lastName || "",
+    lastName: payload.lastName && "",
     dob: payload.dob || "",
     email: normalizeEmail(payload.email || ""),
killedBy: All tests
statusReason: > student-management-backend@1.0.0 test
> npm run test:unit



> student-management-backend@1.0.0 test:unit
> mocha --recursive test/unit

[Survived] StringLiteral
services/studentService.js:83:25
     admissionNo: payload.admissionNo || "",
     firstName: payload.firstName || "",
     lastName: payload.lastName || "",
-    dob: payload.dob || "",
+    dob: payload.dob || "Stryker was here!",
     email: normalizeEmail(payload.email || ""),
     phone: payload.phone || "",

[Killed] LogicalOperator
services/studentService.js:84:27
     firstName: payload.firstName || "",
     lastName: payload.lastName || "",
     dob: payload.dob || "",
-    email: normalizeEmail(payload.email || ""),
+    email: normalizeEmail(payload.email && ""),
     phone: payload.phone || "",
     address: payload.address || "",
killedBy: All tests
statusReason: > student-management-backend@1.0.0 test
> npm run test:unit



> student-management-backend@1.0.0 test:unit
> mocha --recursive test/unit

[Survived] LogicalOperator
services/studentService.js:85:12
     lastName: payload.lastName || "",
     dob: payload.dob || "",
     email: normalizeEmail(payload.email || ""),
-    phone: payload.phone || "",
+    phone: payload.phone && "",
     address: payload.address || "",
     year: payload.year || "",

[Survived] StringLiteral
services/studentService.js:86:33
     dob: payload.dob || "",
     email: normalizeEmail(payload.email || ""),
     phone: payload.phone || "",
-    address: payload.address || "",
+    address: payload.address || "Stryker was here!",
     year: payload.year || "",
     notes: payload.notes || "",

[Survived] StringLiteral
services/studentService.js:87:27
     email: normalizeEmail(payload.email || ""),
     phone: payload.phone || "",
     address: payload.address || "",
-    year: payload.year || "",
+    year: payload.year || "Stryker was here!",
     notes: payload.notes || "",
     createdAt: now,

[Killed] UnaryOperator
services/studentService.js:113:23
 function compareStudents(a = {}, b = {}) {
   const la = (a.lastName || "").toLowerCase();
   const lb = (b.lastName || "").toLowerCase();
-  if (la < lb) return -1;
+  if (la < lb) return +1;
   if (la > lb) return 1;
   return (a.firstName || "").localeCompare(b.firstName || "");
killedBy: All tests
statusReason: > student-management-backend@1.0.0 test
> npm run test:unit



> student-management-backend@1.0.0 test:unit
> mocha --recursive test/unit

[Survived] EqualityOperator
services/studentService.js:114:7
   const la = (a.lastName || "").toLowerCase();
   const lb = (b.lastName || "").toLowerCase();
   if (la < lb) return -1;
-  if (la > lb) return 1;
+  if (la >= lb) return 1;
   return (a.firstName || "").localeCompare(b.firstName || "");
 }

[Survived] LogicalOperator
services/studentService.js:115:11
   const lb = (b.lastName || "").toLowerCase();
   if (la < lb) return -1;
   if (la > lb) return 1;
-  return (a.firstName || "").localeCompare(b.firstName || "");
+  return (a.firstName && "").localeCompare(b.firstName || "");
 }
 

[Survived] LogicalOperator
services/studentService.js:115:44
   const lb = (b.lastName || "").toLowerCase();
   if (la < lb) return -1;
   if (la > lb) return 1;
-  return (a.firstName || "").localeCompare(b.firstName || "");
+  return (a.firstName || "").localeCompare(b.firstName && "");
 }
 
