[Killed] BlockStatement
services/attendanceService.js:3:34
 // services/attendanceService.js
 
-function rowToAttendance(r = {}) {
-  return {
-    id: r.id,
-    studentId: r.studentId,
-    courseId: r.courseId,
-    date: r.date,
-    status: r.status,
-  };
-}
+function rowToAttendance(r = {}) {}
 
 function isValidDateISO(date) {
killedBy: All tests
statusReason: > student-management-backend@1.0.0 test
> mocha --exit --recursive test

[Killed] BlockStatement
services/attendanceService.js:13:31
   };
 }
 
-function isValidDateISO(date) {
-  const m = /^\d{4}-\d{2}-\d{2}$/.test(date);
-  if (!m) return false;
-  const d = new Date(date);
-  return !isNaN(d);
-}
+function isValidDateISO(date) {}
 
 function parseCsv(text = "") {
killedBy: All tests
statusReason: > student-management-backend@1.0.0 test
> mocha --exit --recursive test

[Killed] Regex
services/attendanceService.js:14:13
 }
 
 function isValidDateISO(date) {
-  const m = /^\d{4}-\d{2}-\d{2}$/.test(date);
+  const m = /^\d{4}-\d{2}-\d$/.test(date);
   if (!m) return false;
   const d = new Date(date);
killedBy: All tests
statusReason: > student-management-backend@1.0.0 test
> mocha --exit --recursive test

[Killed] Regex
services/attendanceService.js:14:13
 }
 
 function isValidDateISO(date) {
-  const m = /^\d{4}-\d{2}-\d{2}$/.test(date);
+  const m = /^\d{4}-\d{2}-\D{2}$/.test(date);
   if (!m) return false;
   const d = new Date(date);
killedBy: All tests
statusReason: > student-management-backend@1.0.0 test
> mocha --exit --recursive test

[Killed] BooleanLiteral
services/attendanceService.js:15:7
 
 function isValidDateISO(date) {
   const m = /^\d{4}-\d{2}-\d{2}$/.test(date);
-  if (!m) return false;
+  if (m) return false;
   const d = new Date(date);
   return !isNaN(d);
killedBy: All tests
statusReason: > student-management-backend@1.0.0 test
> mocha --exit --recursive test

[Killed] ConditionalExpression
services/attendanceService.js:15:7
 
 function isValidDateISO(date) {
   const m = /^\d{4}-\d{2}-\d{2}$/.test(date);
-  if (!m) return false;
+  if (true) return false;
   const d = new Date(date);
   return !isNaN(d);
killedBy: All tests
statusReason: > student-management-backend@1.0.0 test
> mocha --exit --recursive test

[Killed] BooleanLiteral
services/attendanceService.js:17:10
   const m = /^\d{4}-\d{2}-\d{2}$/.test(date);
   if (!m) return false;
   const d = new Date(date);
-  return !isNaN(d);
+  return isNaN(d);
 }
 
killedBy: All tests
statusReason: > student-management-backend@1.0.0 test
> mocha --exit --recursive test

[Survived] MethodExpression
services/attendanceService.js:21:17
 }
 
 function parseCsv(text = "") {
-  const lines = text.trim().split(/\r?\n/);
+  const lines = text.split(/\r?\n/);
   const header = lines[0].split(",");
   const required = ["studentId", "courseId", "date", "status"];

[Killed] Regex
services/attendanceService.js:21:35
 }
 
 function parseCsv(text = "") {
-  const lines = text.trim().split(/\r?\n/);
+  const lines = text.trim().split(/\r\n/);
   const header = lines[0].split(",");
   const required = ["studentId", "courseId", "date", "status"];
killedBy: All tests
statusReason: > student-management-backend@1.0.0 test
> mocha --exit --recursive test

[Killed] StringLiteral
services/attendanceService.js:23:54
 function parseCsv(text = "") {
   const lines = text.trim().split(/\r?\n/);
   const header = lines[0].split(",");
-  const required = ["studentId", "courseId", "date", "status"];
+  const required = ["studentId", "courseId", "date", ""];
   const errors = [];
   if (!required.every((h) => header.includes(h))) {
killedBy: All tests
statusReason: > student-management-backend@1.0.0 test
> mocha --exit --recursive test

[Killed] StringLiteral
services/attendanceService.js:23:46
 function parseCsv(text = "") {
   const lines = text.trim().split(/\r?\n/);
   const header = lines[0].split(",");
-  const required = ["studentId", "courseId", "date", "status"];
+  const required = ["studentId", "courseId", "", "status"];
   const errors = [];
   if (!required.every((h) => header.includes(h))) {
killedBy: All tests
statusReason: > student-management-backend@1.0.0 test
> mocha --exit --recursive test

[Killed] ArrayDeclaration
services/attendanceService.js:24:18
   const lines = text.trim().split(/\r?\n/);
   const header = lines[0].split(",");
   const required = ["studentId", "courseId", "date", "status"];
-  const errors = [];
+  const errors = ["Stryker was here"];
   if (!required.every((h) => header.includes(h))) {
     errors.push("missing columns");
killedBy: All tests
statusReason: > student-management-backend@1.0.0 test
> mocha --exit --recursive test

[Killed] ConditionalExpression
services/attendanceService.js:25:7
   const header = lines[0].split(",");
   const required = ["studentId", "courseId", "date", "status"];
   const errors = [];
-  if (!required.every((h) => header.includes(h))) {
+  if (true) {
     errors.push("missing columns");
     return { rows: [], errors };
killedBy: All tests
statusReason: > student-management-backend@1.0.0 test
> mocha --exit --recursive test

[Killed] BooleanLiteral
services/attendanceService.js:25:7
   const header = lines[0].split(",");
   const required = ["studentId", "courseId", "date", "status"];
   const errors = [];
-  if (!required.every((h) => header.includes(h))) {
+  if (required.every(h => header.includes(h))) {
     errors.push("missing columns");
     return { rows: [], errors };
killedBy: All tests
statusReason: > student-management-backend@1.0.0 test
> mocha --exit --recursive test

[Killed] ArrowFunction
services/attendanceService.js:30:45
     return { rows: [], errors };
   }
 
-  const idx = Object.fromEntries(header.map((h, i) => [h, i]));
+  const idx = Object.fromEntries(header.map(() => undefined));
   const rows = [];
 
killedBy: All tests
statusReason: > student-management-backend@1.0.0 test
> mocha --exit --recursive test

[Killed] ArrayDeclaration
services/attendanceService.js:30:55
     return { rows: [], errors };
   }
 
-  const idx = Object.fromEntries(header.map((h, i) => [h, i]));
+  const idx = Object.fromEntries(header.map((h, i) => []));
   const rows = [];
 
killedBy: All tests
statusReason: > student-management-backend@1.0.0 test
> mocha --exit --recursive test

[Killed] BlockStatement
services/attendanceService.js:33:42
   const idx = Object.fromEntries(header.map((h, i) => [h, i]));
   const rows = [];
 
-  for (let i = 1; i < lines.length; i++) {
-    const cols = lines[i].split(",");
-    const row = {};
-    header.forEach((h) => (row[h] = cols[idx[h]] || ""));
-
-    if (!row.studentId || !row.courseId || !row.status) {
-      errors.push("missing required fields");
-      continue;
-    }
-
-    if (!isValidDateISO(row.date)) errors.push("invalid date");
-    row.status = row.status.toLowerCase();
-
-    rows.push(row);
-  }
+  for (let i = 1; i < lines.length; i++) {}
 
   return { rows, errors };
killedBy: All tests
statusReason: > student-management-backend@1.0.0 test
> mocha --exit --recursive test

[Killed] EqualityOperator
services/attendanceService.js:33:19
   const idx = Object.fromEntries(header.map((h, i) => [h, i]));
   const rows = [];
 
-  for (let i = 1; i < lines.length; i++) {
+  for (let i = 1; i >= lines.length; i++) {
     const cols = lines[i].split(",");
     const row = {};
killedBy: All tests
statusReason: > student-management-backend@1.0.0 test
> mocha --exit --recursive test

[Killed] StringLiteral
services/attendanceService.js:34:33
   const rows = [];
 
   for (let i = 1; i < lines.length; i++) {
-    const cols = lines[i].split(",");
+    const cols = lines[i].split("");
     const row = {};
     header.forEach((h) => (row[h] = cols[idx[h]] || ""));
killedBy: All tests
statusReason: > student-management-backend@1.0.0 test
> mocha --exit --recursive test

[Killed] ConditionalExpression
services/attendanceService.js:36:37
   for (let i = 1; i < lines.length; i++) {
     const cols = lines[i].split(",");
     const row = {};
-    header.forEach((h) => (row[h] = cols[idx[h]] || ""));
+    header.forEach((h) => (row[h] = true));
 
     if (!row.studentId || !row.courseId || !row.status) {
killedBy: All tests
statusReason: > student-management-backend@1.0.0 test
> mocha --exit --recursive test

[Killed] LogicalOperator
services/attendanceService.js:36:37
   for (let i = 1; i < lines.length; i++) {
     const cols = lines[i].split(",");
     const row = {};
-    header.forEach((h) => (row[h] = cols[idx[h]] || ""));
+    header.forEach((h) => (row[h] = cols[idx[h]] && ""));
 
     if (!row.studentId || !row.courseId || !row.status) {
killedBy: All tests
statusReason: > student-management-backend@1.0.0 test
> mocha --exit --recursive test

[Killed] LogicalOperator
services/attendanceService.js:38:9
     const row = {};
     header.forEach((h) => (row[h] = cols[idx[h]] || ""));
 
-    if (!row.studentId || !row.courseId || !row.status) {
+    if ((!row.studentId || !row.courseId) && !row.status) {
       errors.push("missing required fields");
       continue;
killedBy: All tests
statusReason: > student-management-backend@1.0.0 test
> mocha --exit --recursive test

[Killed] ConditionalExpression
services/attendanceService.js:38:9
     const row = {};
     header.forEach((h) => (row[h] = cols[idx[h]] || ""));
 
-    if (!row.studentId || !row.courseId || !row.status) {
+    if (true) {
       errors.push("missing required fields");
       continue;
killedBy: All tests
statusReason: > student-management-backend@1.0.0 test
> mocha --exit --recursive test

[Killed] StringLiteral
services/attendanceService.js:39:19
     header.forEach((h) => (row[h] = cols[idx[h]] || ""));
 
     if (!row.studentId || !row.courseId || !row.status) {
-      errors.push("missing required fields");
+      errors.push("");
       continue;
     }
killedBy: All tests
statusReason: > student-management-backend@1.0.0 test
> mocha --exit --recursive test

[Killed] ConditionalExpression
services/attendanceService.js:43:9
       continue;
     }
 
-    if (!isValidDateISO(row.date)) errors.push("invalid date");
+    if (true) errors.push("invalid date");
     row.status = row.status.toLowerCase();
 
killedBy: All tests
statusReason: > student-management-backend@1.0.0 test
> mocha --exit --recursive test





  API Checks

[Killed] BooleanLiteral
services/attendanceService.js:43:9
       continue;
     }
 
-    if (!isValidDateISO(row.date)) errors.push("invalid date");
+    if (isValidDateISO(row.date)) errors.push("invalid date");
     row.status = row.status.toLowerCase();
 
killedBy: All tests
statusReason: > student-management-backend@1.0.0 test
> mocha --exit --recursive test

[Survived] MethodExpression
services/attendanceService.js:44:18
     }
 
     if (!isValidDateISO(row.date)) errors.push("invalid date");
-    row.status = row.status.toLowerCase();
+    row.status = row.status.toUpperCase();
 
     rows.push(row);

[Killed] ObjectLiteral
services/attendanceService.js:49:10
     rows.push(row);
   }
 
-  return { rows, errors };
+  return {};
 }
 
killedBy: All tests
statusReason: > student-management-backend@1.0.0 test
> mocha --exit --recursive test

[Killed] BlockStatement
services/attendanceService.js:52:56
   return { rows, errors };
 }
 
-function calculateAttendancePercentage(present, total) {
-  if (total === 0) return 0;
-  return Math.round((present / total) * 100);
-}
+function calculateAttendancePercentage(present, total) {}
 
 // Insert/update attendance row
killedBy: All tests
statusReason: > student-management-backend@1.0.0 test
> mocha --exit --recursive test

[Killed] EqualityOperator
services/attendanceService.js:53:7
 }
 
 function calculateAttendancePercentage(present, total) {
-  if (total === 0) return 0;
+  if (total !== 0) return 0;
   return Math.round((present / total) * 100);
 }
killedBy: All tests
statusReason: > student-management-backend@1.0.0 test
> mocha --exit --recursive test

[Killed] ConditionalExpression
services/attendanceService.js:53:7
 }
 
 function calculateAttendancePercentage(present, total) {
-  if (total === 0) return 0;
+  if (false) return 0;
   return Math.round((present / total) * 100);
 }
killedBy: All tests
statusReason: > student-management-backend@1.0.0 test
> mocha --exit --recursive test

[Killed] ArithmeticOperator
services/attendanceService.js:54:22
 
 function calculateAttendancePercentage(present, total) {
   if (total === 0) return 0;
-  return Math.round((present / total) * 100);
+  return Math.round((present * total) * 100);
 }
 
killedBy: All tests
statusReason: > student-management-backend@1.0.0 test
> mocha --exit --recursive test

[Killed] ArithmeticOperator
services/attendanceService.js:54:21
 
 function calculateAttendancePercentage(present, total) {
   if (total === 0) return 0;
-  return Math.round((present / total) * 100);
+  return Math.round(present / total / 100);
 }
 
killedBy: All tests
statusReason: > student-management-backend@1.0.0 test
> mocha --exit --recursive test




  API Checks
Initialized IDs: { studentId: 'S-1764010238023', courseId: 'C-1764010238023' }

[Killed] BlockStatement
services/attendanceService.js:58:83
 }
 
 // Insert/update attendance row
-function markStatus(rows = [], sid, cid, date, status = "present", force = false) {
-  const key = `${sid}::${cid}::${date}`;
-  const index = rows.findIndex((r) => `${r.studentId}::${r.courseId}::${r.date}` === key);
-
-  if (index === -1) {
-    const row = { studentId: sid, courseId: cid, date, status };
-    rows.push(row);
-    return { inserted: 1, updated: 0, skipped: 0, row };
-  }
-
-  if (force) {
-    rows[index].status = status;
-    return { inserted: 0, updated: 1, skipped: 0, row: rows[index] };
-  }
-
-  return { inserted: 0, updated: 0, skipped: 1, row: rows[index] };
-}
+function markStatus(rows = [], sid, cid, date, status = "present", force = false) {}
 
 function summarizeStudent(rows = [], sid) {
killedBy: All tests
statusReason: > student-management-backend@1.0.0 test
> mocha --exit --recursive test

[Survived] BooleanLiteral
services/attendanceService.js:58:76
 }
 
 // Insert/update attendance row
-function markStatus(rows = [], sid, cid, date, status = "present", force = false) {
+function markStatus(rows = [], sid, cid, date, status = "present", force = true) {
   const key = `${sid}::${cid}::${date}`;
   const index = rows.findIndex((r) => `${r.studentId}::${r.courseId}::${r.date}` === key);

[Killed] ArrowFunction
services/attendanceService.js:60:32
 // Insert/update attendance row
 function markStatus(rows = [], sid, cid, date, status = "present", force = false) {
   const key = `${sid}::${cid}::${date}`;
-  const index = rows.findIndex((r) => `${r.studentId}::${r.courseId}::${r.date}` === key);
+  const index = rows.findIndex(() => undefined);
 
   if (index === -1) {
killedBy: All tests
statusReason: > student-management-backend@1.0.0 test
> mocha --exit --recursive test

[Killed] ConditionalExpression
services/attendanceService.js:60:39
 // Insert/update attendance row
 function markStatus(rows = [], sid, cid, date, status = "present", force = false) {
   const key = `${sid}::${cid}::${date}`;
-  const index = rows.findIndex((r) => `${r.studentId}::${r.courseId}::${r.date}` === key);
+  const index = rows.findIndex((r) => true);
 
   if (index === -1) {
killedBy: All tests
statusReason: > student-management-backend@1.0.0 test
> mocha --exit --recursive test

[Killed] ConditionalExpression
services/attendanceService.js:62:7
   const key = `${sid}::${cid}::${date}`;
   const index = rows.findIndex((r) => `${r.studentId}::${r.courseId}::${r.date}` === key);
 
-  if (index === -1) {
+  if (false) {
     const row = { studentId: sid, courseId: cid, date, status };
     rows.push(row);
killedBy: All tests
statusReason: > student-management-backend@1.0.0 test
> mocha --exit --recursive test

[Killed] BlockStatement
services/attendanceService.js:62:21
   const key = `${sid}::${cid}::${date}`;
   const index = rows.findIndex((r) => `${r.studentId}::${r.courseId}::${r.date}` === key);
 
-  if (index === -1) {
-    const row = { studentId: sid, courseId: cid, date, status };
-    rows.push(row);
-    return { inserted: 1, updated: 0, skipped: 0, row };
-  }
+  if (index === -1) {}
 
   if (force) {
killedBy: All tests
statusReason: > student-management-backend@1.0.0 test
> mocha --exit --recursive test

[Killed] BlockStatement
services/attendanceService.js:68:14
     return { inserted: 1, updated: 0, skipped: 0, row };
   }
 
-  if (force) {
-    rows[index].status = status;
-    return { inserted: 0, updated: 1, skipped: 0, row: rows[index] };
-  }
+  if (force) {}
 
   return { inserted: 0, updated: 0, skipped: 1, row: rows[index] };
killedBy: All tests
statusReason: > student-management-backend@1.0.0 test
> mocha --exit --recursive test

[Killed] ConditionalExpression
services/attendanceService.js:68:7
     return { inserted: 1, updated: 0, skipped: 0, row };
   }
 
-  if (force) {
+  if (false) {
     rows[index].status = status;
     return { inserted: 0, updated: 1, skipped: 0, row: rows[index] };
killedBy: All tests
statusReason: > student-management-backend@1.0.0 test
> mocha --exit --recursive test

[Killed] ObjectLiteral
services/attendanceService.js:70:12
 
   if (force) {
     rows[index].status = status;
-    return { inserted: 0, updated: 1, skipped: 0, row: rows[index] };
+    return {};
   }
 
killedBy: All tests
statusReason: > student-management-backend@1.0.0 test
> mocha --exit --recursive test

[Survived] BlockStatement
services/attendanceService.js:76:43
   return { inserted: 0, updated: 0, skipped: 1, row: rows[index] };
 }
 
-function summarizeStudent(rows = [], sid) {
-  const r = rows.filter((x) => x.studentId === sid);
-  const total = r.length;
-  const present = r.filter((x) => x.status === "present").length;
-  return { studentId: sid, total, present, percentage: calculateAttendancePercentage(present, total) };
-}
+function summarizeStudent(rows = [], sid) {}
 
 function findMissingDates(rows = [], sid, dates = []) {

[Survived] ArrayDeclaration
services/attendanceService.js:76:34
   return { inserted: 0, updated: 0, skipped: 1, row: rows[index] };
 }
 
-function summarizeStudent(rows = [], sid) {
+function summarizeStudent(rows = ["Stryker was here"], sid) {
   const r = rows.filter((x) => x.studentId === sid);
   const total = r.length;

[Survived] ConditionalExpression
services/attendanceService.js:77:32
 }
 
 function summarizeStudent(rows = [], sid) {
-  const r = rows.filter((x) => x.studentId === sid);
+  const r = rows.filter((x) => true);
   const total = r.length;
   const present = r.filter((x) => x.status === "present").length;

[Survived] EqualityOperator
services/attendanceService.js:77:32
 }
 
 function summarizeStudent(rows = [], sid) {
-  const r = rows.filter((x) => x.studentId === sid);
+  const r = rows.filter((x) => x.studentId !== sid);
   const total = r.length;
   const present = r.filter((x) => x.status === "present").length;

[Survived] ArrowFunction
services/attendanceService.js:79:28
 function summarizeStudent(rows = [], sid) {
   const r = rows.filter((x) => x.studentId === sid);
   const total = r.length;
-  const present = r.filter((x) => x.status === "present").length;
+  const present = r.filter(() => undefined).length;
   return { studentId: sid, total, present, percentage: calculateAttendancePercentage(present, total) };
 }

[Survived] EqualityOperator
services/attendanceService.js:79:35
 function summarizeStudent(rows = [], sid) {
   const r = rows.filter((x) => x.studentId === sid);
   const total = r.length;
-  const present = r.filter((x) => x.status === "present").length;
+  const present = r.filter((x) => x.status !== "present").length;
   return { studentId: sid, total, present, percentage: calculateAttendancePercentage(present, total) };
 }

[Survived] BlockStatement
services/attendanceService.js:83:55
   return { studentId: sid, total, present, percentage: calculateAttendancePercentage(present, total) };
 }
 
-function findMissingDates(rows = [], sid, dates = []) {
-  const done = rows.filter((r) => r.studentId === sid).map((x) => x.date);
-  return dates.filter((d) => !done.includes(d));
-}
+function findMissingDates(rows = [], sid, dates = []) {}
 
 function consecutiveAbsences(rows = [], sid) {

[Survived] ArrayDeclaration
services/attendanceService.js:83:51
   return { studentId: sid, total, present, percentage: calculateAttendancePercentage(present, total) };
 }
 
-function findMissingDates(rows = [], sid, dates = []) {
+function findMissingDates(rows = [], sid, dates = ["Stryker was here"]) {
   const done = rows.filter((r) => r.studentId === sid).map((x) => x.date);
   return dates.filter((d) => !done.includes(d));

[Survived] ArrowFunction
services/attendanceService.js:84:60
 }
 
 function findMissingDates(rows = [], sid, dates = []) {
-  const done = rows.filter((r) => r.studentId === sid).map((x) => x.date);
+  const done = rows.filter((r) => r.studentId === sid).map(() => undefined);
   return dates.filter((d) => !done.includes(d));
 }

[Survived] ConditionalExpression
services/attendanceService.js:84:35
 }
 
 function findMissingDates(rows = [], sid, dates = []) {
-  const done = rows.filter((r) => r.studentId === sid).map((x) => x.date);
+  const done = rows.filter((r) => true).map((x) => x.date);
   return dates.filter((d) => !done.includes(d));
 }

[Survived] BooleanLiteral
services/attendanceService.js:85:30
 
 function findMissingDates(rows = [], sid, dates = []) {
   const done = rows.filter((r) => r.studentId === sid).map((x) => x.date);
-  return dates.filter((d) => !done.includes(d));
+  return dates.filter((d) => done.includes(d));
 }
 

[Survived] MethodExpression
services/attendanceService.js:85:10
 
 function findMissingDates(rows = [], sid, dates = []) {
   const done = rows.filter((r) => r.studentId === sid).map((x) => x.date);
-  return dates.filter((d) => !done.includes(d));
+  return dates;
 }
 

[Survived] BlockStatement
services/attendanceService.js:88:46
   return dates.filter((d) => !done.includes(d));
 }
 
-function consecutiveAbsences(rows = [], sid) {
-  const sorted = rows.filter((r) => r.studentId === sid).sort((a, b) => a.date.localeCompare(b.date));
-  let streak = 0,
-    max = 0;
-
-  for (const r of sorted) {
-    if (r.status === "absent") {
-      streak++;
-      max = Math.max(max, streak);
-    } else {
-      streak = 0;
-    }
-  }
-
-  return max;
-}
+function consecutiveAbsences(rows = [], sid) {}
 
 module.exports = {

[Survived] ArrowFunction
services/attendanceService.js:89:63
 }
 
 function consecutiveAbsences(rows = [], sid) {
-  const sorted = rows.filter((r) => r.studentId === sid).sort((a, b) => a.date.localeCompare(b.date));
+  const sorted = rows.filter((r) => r.studentId === sid).sort(() => undefined);
   let streak = 0,
     max = 0;

[Survived] ConditionalExpression
services/attendanceService.js:89:37
 }
 
 function consecutiveAbsences(rows = [], sid) {
-  const sorted = rows.filter((r) => r.studentId === sid).sort((a, b) => a.date.localeCompare(b.date));
+  const sorted = rows.filter((r) => false).sort((a, b) => a.date.localeCompare(b.date));
   let streak = 0,
     max = 0;

[Survived] BlockStatement
services/attendanceService.js:93:27
   let streak = 0,
     max = 0;
 
-  for (const r of sorted) {
-    if (r.status === "absent") {
-      streak++;
-      max = Math.max(max, streak);
-    } else {
-      streak = 0;
-    }
-  }
+  for (const r of sorted) {}
 
   return max;

[Survived] EqualityOperator
services/attendanceService.js:94:9
     max = 0;
 
   for (const r of sorted) {
-    if (r.status === "absent") {
+    if (r.status !== "absent") {
       streak++;
       max = Math.max(max, streak);

[Survived] ConditionalExpression
services/attendanceService.js:94:9
     max = 0;
 
   for (const r of sorted) {
-    if (r.status === "absent") {
+    if (true) {
       streak++;
       max = Math.max(max, streak);

[Survived] UpdateOperator
services/attendanceService.js:95:7
 
   for (const r of sorted) {
     if (r.status === "absent") {
-      streak++;
+      streak--;
       max = Math.max(max, streak);
     } else {

[Survived] MethodExpression
services/attendanceService.js:96:13
   for (const r of sorted) {
     if (r.status === "absent") {
       streak++;
-      max = Math.max(max, streak);
+      max = Math.min(max, streak);
     } else {
       streak = 0;

[Survived] BlockStatement
services/attendanceService.js:97:12
     if (r.status === "absent") {
       streak++;
       max = Math.max(max, streak);
-    } else {
-      streak = 0;
-    }
+    } else {}
   }
 
