[Killed] BlockStatement
services/courseService.js:3:30
 // services/courseService.js
 
-function rowToCourse(r = {}) {
-  return {
-    id: r.id,
-    code: r.code || "",
-    name: r.name || "",
-    instructor: r.instructor || "",
-    credits: r.credits || 0,
-  };
-}
+function rowToCourse(r = {}) {}
 
 function normalizeCourseCode(code = "") {
killedBy: All tests
statusReason: > student-management-backend@1.0.0 test
> mocha --exit --recursive test

[Survived] ConditionalExpression
services/courseService.js:6:11
 function rowToCourse(r = {}) {
   return {
     id: r.id,
-    code: r.code || "",
+    code: true,
     name: r.name || "",
     instructor: r.instructor || "",

[Survived] ConditionalExpression
services/courseService.js:6:11
 function rowToCourse(r = {}) {
   return {
     id: r.id,
-    code: r.code || "",
+    code: false,
     name: r.name || "",
     instructor: r.instructor || "",

[Survived] ConditionalExpression
services/courseService.js:7:11
   return {
     id: r.id,
     code: r.code || "",
-    name: r.name || "",
+    name: true,
     instructor: r.instructor || "",
     credits: r.credits || 0,

[Survived] ConditionalExpression
services/courseService.js:7:11
   return {
     id: r.id,
     code: r.code || "",
-    name: r.name || "",
+    name: false,
     instructor: r.instructor || "",
     credits: r.credits || 0,

[Survived] ConditionalExpression
services/courseService.js:8:17
     id: r.id,
     code: r.code || "",
     name: r.name || "",
-    instructor: r.instructor || "",
+    instructor: false,
     credits: r.credits || 0,
   };

[Survived] ConditionalExpression
services/courseService.js:8:17
     id: r.id,
     code: r.code || "",
     name: r.name || "",
-    instructor: r.instructor || "",
+    instructor: true,
     credits: r.credits || 0,
   };

[Survived] ConditionalExpression
services/courseService.js:9:14
     code: r.code || "",
     name: r.name || "",
     instructor: r.instructor || "",
-    credits: r.credits || 0,
+    credits: false,
   };
 }

[Survived] ConditionalExpression
services/courseService.js:9:14
     code: r.code || "",
     name: r.name || "",
     instructor: r.instructor || "",
-    credits: r.credits || 0,
+    credits: true,
   };
 }

[Killed] BlockStatement
services/courseService.js:13:41
   };
 }
 
-function normalizeCourseCode(code = "") {
-  return code.toUpperCase().replace(/\s+/g, "");
-}
+function normalizeCourseCode(code = "") {}
 
 // Cut long course name
killedBy: All tests
statusReason: > student-management-backend@1.0.0 test
> mocha --exit --recursive test

[Survived] StringLiteral
services/courseService.js:13:37
   };
 }
 
-function normalizeCourseCode(code = "") {
+function normalizeCourseCode(code = "Stryker was here!") {
   return code.toUpperCase().replace(/\s+/g, "");
 }

[Killed] MethodExpression
services/courseService.js:14:10
 }
 
 function normalizeCourseCode(code = "") {
-  return code.toUpperCase().replace(/\s+/g, "");
+  return code.toLowerCase().replace(/\s+/g, "");
 }
 
killedBy: All tests
statusReason: > student-management-backend@1.0.0 test
> mocha --exit --recursive test

[Survived] BlockStatement
services/courseService.js:18:52
 }
 
 // Cut long course name
-function abbreviateCourseName(name = "", len = 20) {
-  return name.length <= len ? name : name.slice(0, len - 3) + "...";
-}
+function abbreviateCourseName(name = "", len = 20) {}
 
 // Split "CS101" → {subject: "CS", number: "101"}

[Survived] ConditionalExpression
services/courseService.js:19:10
 
 // Cut long course name
 function abbreviateCourseName(name = "", len = 20) {
-  return name.length <= len ? name : name.slice(0, len - 3) + "...";
+  return false ? name : name.slice(0, len - 3) + "...";
 }
 

[Survived] EqualityOperator
services/courseService.js:19:10
 
 // Cut long course name
 function abbreviateCourseName(name = "", len = 20) {
-  return name.length <= len ? name : name.slice(0, len - 3) + "...";
+  return name.length > len ? name : name.slice(0, len - 3) + "...";
 }
 

[Survived] BlockStatement
services/courseService.js:23:37
 }
 
 // Split "CS101" → {subject: "CS", number: "101"}
-function parseCourseCode(code = "") {
-  const m = code.toUpperCase().match(/^([A-Z]+)(\d+)$/);
-  return m ? { subject: m[1], number: m[2] } : { subject: code, number: "" };
-}
+function parseCourseCode(code = "") {}
 
 function syllabusSnippet(text = "", words = 20) {

[Survived] StringLiteral
services/courseService.js:23:33
 }
 
 // Split "CS101" → {subject: "CS", number: "101"}
-function parseCourseCode(code = "") {
+function parseCourseCode(code = "Stryker was here!") {
   const m = code.toUpperCase().match(/^([A-Z]+)(\d+)$/);
   return m ? { subject: m[1], number: m[2] } : { subject: code, number: "" };

[Survived] MethodExpression
services/courseService.js:24:13
 
 // Split "CS101" → {subject: "CS", number: "101"}
 function parseCourseCode(code = "") {
-  const m = code.toUpperCase().match(/^([A-Z]+)(\d+)$/);
+  const m = code.toLowerCase().match(/^([A-Z]+)(\d+)$/);
   return m ? { subject: m[1], number: m[2] } : { subject: code, number: "" };
 }

[Survived] Regex
services/courseService.js:24:38
 
 // Split "CS101" → {subject: "CS", number: "101"}
 function parseCourseCode(code = "") {
-  const m = code.toUpperCase().match(/^([A-Z]+)(\d+)$/);
+  const m = code.toUpperCase().match(/^([^A-Z]+)(\d+)$/);
   return m ? { subject: m[1], number: m[2] } : { subject: code, number: "" };
 }

[Survived] BlockStatement
services/courseService.js:28:49
   return m ? { subject: m[1], number: m[2] } : { subject: code, number: "" };
 }
 
-function syllabusSnippet(text = "", words = 20) {
-  const parts = text.trim().split(/\s+/);
-  return parts.length <= words ? text : parts.slice(0, words).join(" ") + "...";
-}
+function syllabusSnippet(text = "", words = 20) {}
 
 function validateInstructorName(name = "") {

[Survived] MethodExpression
services/courseService.js:29:17
 }
 
 function syllabusSnippet(text = "", words = 20) {
-  const parts = text.trim().split(/\s+/);
+  const parts = text.split(/\s+/);
   return parts.length <= words ? text : parts.slice(0, words).join(" ") + "...";
 }

[Survived] Regex
services/courseService.js:29:35
 }
 
 function syllabusSnippet(text = "", words = 20) {
-  const parts = text.trim().split(/\s+/);
+  const parts = text.trim().split(/\s/);
   return parts.length <= words ? text : parts.slice(0, words).join(" ") + "...";
 }

[Survived] ConditionalExpression
services/courseService.js:30:10
 
 function syllabusSnippet(text = "", words = 20) {
   const parts = text.trim().split(/\s+/);
-  return parts.length <= words ? text : parts.slice(0, words).join(" ") + "...";
+  return true ? text : parts.slice(0, words).join(" ") + "...";
 }
 

[Survived] EqualityOperator
services/courseService.js:30:10
 
 function syllabusSnippet(text = "", words = 20) {
   const parts = text.trim().split(/\s+/);
-  return parts.length <= words ? text : parts.slice(0, words).join(" ") + "...";
+  return parts.length < words ? text : parts.slice(0, words).join(" ") + "...";
 }
 

[Survived] BlockStatement
services/courseService.js:33:44
   return parts.length <= words ? text : parts.slice(0, words).join(" ") + "...";
 }
 
-function validateInstructorName(name = "") {
-  return /^[A-Za-z .'-]{2,100}$/.test(name.trim());
-}
+function validateInstructorName(name = "") {}
 
 function isValidCredits(c) {

[Survived] MethodExpression
services/courseService.js:34:39
 }
 
 function validateInstructorName(name = "") {
-  return /^[A-Za-z .'-]{2,100}$/.test(name.trim());
+  return /^[A-Za-z .'-]{2,100}$/.test(name);
 }
 

[Survived] Regex
services/courseService.js:34:10
 }
 
 function validateInstructorName(name = "") {
-  return /^[A-Za-z .'-]{2,100}$/.test(name.trim());
+  return /[A-Za-z .'-]{2,100}$/.test(name.trim());
 }
 

[Killed] BlockStatement
services/courseService.js:37:28
   return /^[A-Za-z .'-]{2,100}$/.test(name.trim());
 }
 
-function isValidCredits(c) {
-  return Number(c) >= 0 && Number(c) <= 10;
-}
+function isValidCredits(c) {}
 
 function validateCoursePayload(p = {}) {
killedBy: All tests
statusReason: > student-management-backend@1.0.0 test
> mocha --exit --recursive test

[Killed] ConditionalExpression
services/courseService.js:38:10
 }
 
 function isValidCredits(c) {
-  return Number(c) >= 0 && Number(c) <= 10;
+  return false;
 }
 
killedBy: All tests
statusReason: > student-management-backend@1.0.0 test
> mocha --exit --recursive test

[Killed] EqualityOperator
services/courseService.js:38:28
 }
 
 function isValidCredits(c) {
-  return Number(c) >= 0 && Number(c) <= 10;
+  return Number(c) >= 0 && Number(c) > 10;
 }
 
killedBy: All tests
statusReason: > student-management-backend@1.0.0 test
> mocha --exit --recursive test

[Killed] BlockStatement
services/courseService.js:41:40
   return Number(c) >= 0 && Number(c) <= 10;
 }
 
-function validateCoursePayload(p = {}) {
-  if (!p || !p.code || !p.name) return { ok: false };
-  if (p.credits && !isValidCredits(p.credits)) return { ok: false };
-  return { ok: true };
-}
+function validateCoursePayload(p = {}) {}
 
 function buildCourseRecord(p = {}) {
killedBy: All tests
statusReason: > student-management-backend@1.0.0 test
> mocha --exit --recursive test

[Killed] LogicalOperator
services/courseService.js:42:7
 }
 
 function validateCoursePayload(p = {}) {
-  if (!p || !p.code || !p.name) return { ok: false };
+  if ((!p || !p.code) && !p.name) return { ok: false };
   if (p.credits && !isValidCredits(p.credits)) return { ok: false };
   return { ok: true };
killedBy: All tests
statusReason: > student-management-backend@1.0.0 test
> mocha --exit --recursive test

[Killed] ConditionalExpression
services/courseService.js:42:7
 }
 
 function validateCoursePayload(p = {}) {
-  if (!p || !p.code || !p.name) return { ok: false };
+  if (false) return { ok: false };
   if (p.credits && !isValidCredits(p.credits)) return { ok: false };
   return { ok: true };
killedBy: All tests
statusReason: > student-management-backend@1.0.0 test
> mocha --exit --recursive test

[Killed] BooleanLiteral
services/courseService.js:43:20
 
 function validateCoursePayload(p = {}) {
   if (!p || !p.code || !p.name) return { ok: false };
-  if (p.credits && !isValidCredits(p.credits)) return { ok: false };
+  if (p.credits && isValidCredits(p.credits)) return { ok: false };
   return { ok: true };
 }
killedBy: All tests
statusReason: > student-management-backend@1.0.0 test
> mocha --exit --recursive test

[Killed] LogicalOperator
services/courseService.js:43:7
 
 function validateCoursePayload(p = {}) {
   if (!p || !p.code || !p.name) return { ok: false };
-  if (p.credits && !isValidCredits(p.credits)) return { ok: false };
+  if (p.credits || !isValidCredits(p.credits)) return { ok: false };
   return { ok: true };
 }
killedBy: All tests
statusReason: > student-management-backend@1.0.0 test
> mocha --exit --recursive test

[Killed] BooleanLiteral
services/courseService.js:44:16
 function validateCoursePayload(p = {}) {
   if (!p || !p.code || !p.name) return { ok: false };
   if (p.credits && !isValidCredits(p.credits)) return { ok: false };
-  return { ok: true };
+  return { ok: false };
 }
 
killedBy: All tests
statusReason: > student-management-backend@1.0.0 test
> mocha --exit --recursive test

[Killed] ObjectLiteral
services/courseService.js:44:10
 function validateCoursePayload(p = {}) {
   if (!p || !p.code || !p.name) return { ok: false };
   if (p.credits && !isValidCredits(p.credits)) return { ok: false };
-  return { ok: true };
+  return {};
 }
 
killedBy: All tests
statusReason: > student-management-backend@1.0.0 test
> mocha --exit --recursive test

[Killed] BlockStatement
services/courseService.js:47:36
   return { ok: true };
 }
 
-function buildCourseRecord(p = {}) {
-  return {
-    code: normalizeCourseCode(p.code),
-    name: p.name || "",
-    instructor: p.instructor || "",
-    credits: p.credits || 0,
-  };
-}
+function buildCourseRecord(p = {}) {}
 
 function matchesQuery(q = "", course = {}) {
killedBy: All tests
statusReason: > student-management-backend@1.0.0 test
> mocha --exit --recursive test

[Killed] ObjectLiteral
services/courseService.js:48:10
 }
 
 function buildCourseRecord(p = {}) {
-  return {
-    code: normalizeCourseCode(p.code),
-    name: p.name || "",
-    instructor: p.instructor || "",
-    credits: p.credits || 0,
-  };
+  return {};
 }
 
killedBy: All tests
statusReason: > student-management-backend@1.0.0 test
> mocha --exit --recursive test

[Survived] ConditionalExpression
services/courseService.js:50:11
 function buildCourseRecord(p = {}) {
   return {
     code: normalizeCourseCode(p.code),
-    name: p.name || "",
+    name: false,
     instructor: p.instructor || "",
     credits: p.credits || 0,

[Survived] LogicalOperator
services/courseService.js:50:11
 function buildCourseRecord(p = {}) {
   return {
     code: normalizeCourseCode(p.code),
-    name: p.name || "",
+    name: p.name && "",
     instructor: p.instructor || "",
     credits: p.credits || 0,

[Survived] LogicalOperator
services/courseService.js:51:17
   return {
     code: normalizeCourseCode(p.code),
     name: p.name || "",
-    instructor: p.instructor || "",
+    instructor: p.instructor && "",
     credits: p.credits || 0,
   };

[Survived] ConditionalExpression
services/courseService.js:51:17
   return {
     code: normalizeCourseCode(p.code),
     name: p.name || "",
-    instructor: p.instructor || "",
+    instructor: false,
     credits: p.credits || 0,
   };

[Killed] ConditionalExpression
services/courseService.js:52:14
     code: normalizeCourseCode(p.code),
     name: p.name || "",
     instructor: p.instructor || "",
-    credits: p.credits || 0,
+    credits: false,
   };
 }
killedBy: All tests
statusReason: > student-management-backend@1.0.0 test
> mocha --exit --recursive test

[Killed] ConditionalExpression
services/courseService.js:52:14
     code: normalizeCourseCode(p.code),
     name: p.name || "",
     instructor: p.instructor || "",
-    credits: p.credits || 0,
+    credits: true,
   };
 }
killedBy: All tests
statusReason: > student-management-backend@1.0.0 test
> mocha --exit --recursive test

[Survived] BlockStatement
services/courseService.js:56:44
   };
 }
 
-function matchesQuery(q = "", course = {}) {
-  q = q.toLowerCase();
-  return (
-    course.code?.toLowerCase().includes(q) ||
-    course.name?.toLowerCase().includes(q) ||
-    course.instructor?.toLowerCase().includes(q)
-  );
-}
+function matchesQuery(q = "", course = {}) {}
 
 module.exports = {

[Survived] MethodExpression
services/courseService.js:57:7
 }
 
 function matchesQuery(q = "", course = {}) {
-  q = q.toLowerCase();
+  q = q.toUpperCase();
   return (
     course.code?.toLowerCase().includes(q) ||

[Survived] ConditionalExpression
services/courseService.js:59:5
 function matchesQuery(q = "", course = {}) {
   q = q.toLowerCase();
   return (
-    course.code?.toLowerCase().includes(q) ||
-    course.name?.toLowerCase().includes(q) ||
-    course.instructor?.toLowerCase().includes(q)
+    false
   );
 }

[Survived] ConditionalExpression
services/courseService.js:59:5
 function matchesQuery(q = "", course = {}) {
   q = q.toLowerCase();
   return (
-    course.code?.toLowerCase().includes(q) ||
-    course.name?.toLowerCase().includes(q) ||
+    false ||
     course.instructor?.toLowerCase().includes(q)
   );

[Survived] OptionalChaining
services/courseService.js:60:5
   q = q.toLowerCase();
   return (
     course.code?.toLowerCase().includes(q) ||
-    course.name?.toLowerCase().includes(q) ||
+    course.name.toLowerCase().includes(q) ||
     course.instructor?.toLowerCase().includes(q)
   );

[Survived] MethodExpression
services/courseService.js:60:5
   q = q.toLowerCase();
   return (
     course.code?.toLowerCase().includes(q) ||
-    course.name?.toLowerCase().includes(q) ||
+    course.name?.toUpperCase().includes(q) ||
     course.instructor?.toLowerCase().includes(q)
   );

[Survived] MethodExpression
services/courseService.js:61:5
   return (
     course.code?.toLowerCase().includes(q) ||
     course.name?.toLowerCase().includes(q) ||
-    course.instructor?.toLowerCase().includes(q)
+    course.instructor?.toUpperCase().includes(q)
   );
 }

[Survived] OptionalChaining
services/courseService.js:61:5
   return (
     course.code?.toLowerCase().includes(q) ||
     course.name?.toLowerCase().includes(q) ||
-    course.instructor?.toLowerCase().includes(q)
+    course.instructor.toLowerCase().includes(q)
   );
 }

[Killed] ObjectLiteral
services/courseService.js:65:18
   );
 }
 
-module.exports = {
-  rowToCourse,
-  normalizeCourseCode,
-  abbreviateCourseName,
-  parseCourseCode,
-  syllabusSnippet,
-  validateInstructorName,
-  isValidCredits,
-  validateCoursePayload,
-  buildCourseRecord,
-  matchesQuery,
-};
+module.exports = {};
 
killedBy: All tests
statusReason: > student-management-backend@1.0.0 test
> mocha --exit --recursive test
