[Killed] BlockStatement
services/enrollmentService.js:3:43
 // services/enrollmentService.js
 
-function validateEnrollment(payload = {}) {
-  if (!payload || !payload.studentId || !payload.courseId)
-    return { ok: false, reason: 'Missing studentId or courseId' };
-  return { ok: true };
-}
+function validateEnrollment(payload = {}) {}
 
 function buildEnrollmentRecord(p = {}) {
killedBy: All tests
statusReason: > student-management-backend@1.0.0 test
> mocha --exit --recursive test

[Killed] ConditionalExpression
services/enrollmentService.js:4:7
 // services/enrollmentService.js
 
 function validateEnrollment(payload = {}) {
-  if (!payload || !payload.studentId || !payload.courseId)
+  if (false)
     return { ok: false, reason: 'Missing studentId or courseId' };
   return { ok: true };
killedBy: All tests
statusReason: > student-management-backend@1.0.0 test
> mocha --exit --recursive test

[Killed] ConditionalExpression
services/enrollmentService.js:4:7
 // services/enrollmentService.js
 
 function validateEnrollment(payload = {}) {
-  if (!payload || !payload.studentId || !payload.courseId)
+  if (false || !payload.courseId)
     return { ok: false, reason: 'Missing studentId or courseId' };
   return { ok: true };
killedBy: All tests
statusReason: > student-management-backend@1.0.0 test
> mocha --exit --recursive test

[Killed] BooleanLiteral
services/enrollmentService.js:5:18
 
 function validateEnrollment(payload = {}) {
   if (!payload || !payload.studentId || !payload.courseId)
-    return { ok: false, reason: 'Missing studentId or courseId' };
+    return { ok: true, reason: 'Missing studentId or courseId' };
   return { ok: true };
 }
killedBy: All tests
statusReason: > student-management-backend@1.0.0 test
> mocha --exit --recursive test

[Killed] BooleanLiteral
services/enrollmentService.js:6:16
 function validateEnrollment(payload = {}) {
   if (!payload || !payload.studentId || !payload.courseId)
     return { ok: false, reason: 'Missing studentId or courseId' };
-  return { ok: true };
+  return { ok: false };
 }
 
killedBy: All tests
statusReason: > student-management-backend@1.0.0 test
> mocha --exit --recursive test

[Killed] ObjectLiteral
services/enrollmentService.js:6:10
 function validateEnrollment(payload = {}) {
   if (!payload || !payload.studentId || !payload.courseId)
     return { ok: false, reason: 'Missing studentId or courseId' };
-  return { ok: true };
+  return {};
 }
 
killedBy: All tests
statusReason: > student-management-backend@1.0.0 test
> mocha --exit --recursive test

[Killed] BlockStatement
services/enrollmentService.js:9:40
   return { ok: true };
 }
 
-function buildEnrollmentRecord(p = {}) {
-  if (!p.studentId || !p.courseId) throw new Error("Missing IDs");
-  return {
-    studentId: p.studentId,
-    courseId: p.courseId,
-    enrolledAt: p.enrolledAt || Date.now(),
-  };
-}
+function buildEnrollmentRecord(p = {}) {}
 
 // "S1::C1"
killedBy: All tests
statusReason: > student-management-backend@1.0.0 test
> mocha --exit --recursive test

[Killed] BooleanLiteral
services/enrollmentService.js:10:23
 }
 
 function buildEnrollmentRecord(p = {}) {
-  if (!p.studentId || !p.courseId) throw new Error("Missing IDs");
+  if (!p.studentId || p.courseId) throw new Error("Missing IDs");
   return {
     studentId: p.studentId,
killedBy: All tests
statusReason: > student-management-backend@1.0.0 test
> mocha --exit --recursive test

[Killed] ConditionalExpression
services/enrollmentService.js:10:7
 }
 
 function buildEnrollmentRecord(p = {}) {
-  if (!p.studentId || !p.courseId) throw new Error("Missing IDs");
+  if (true) throw new Error("Missing IDs");
   return {
     studentId: p.studentId,
killedBy: All tests
statusReason: > student-management-backend@1.0.0 test
> mocha --exit --recursive test

[Killed] ObjectLiteral
services/enrollmentService.js:11:10
 
 function buildEnrollmentRecord(p = {}) {
   if (!p.studentId || !p.courseId) throw new Error("Missing IDs");
-  return {
-    studentId: p.studentId,
-    courseId: p.courseId,
-    enrolledAt: p.enrolledAt || Date.now(),
-  };
+  return {};
 }
 
killedBy: All tests
statusReason: > student-management-backend@1.0.0 test
> mocha --exit --recursive test

[Killed] LogicalOperator
services/enrollmentService.js:14:17
   return {
     studentId: p.studentId,
     courseId: p.courseId,
-    enrolledAt: p.enrolledAt || Date.now(),
+    enrolledAt: p.enrolledAt && Date.now(),
   };
 }
killedBy: All tests
statusReason: > student-management-backend@1.0.0 test
> mocha --exit --recursive test

[Killed] ConditionalExpression
services/enrollmentService.js:14:17
   return {
     studentId: p.studentId,
     courseId: p.courseId,
-    enrolledAt: p.enrolledAt || Date.now(),
+    enrolledAt: true,
   };
 }
killedBy: All tests
statusReason: > student-management-backend@1.0.0 test
> mocha --exit --recursive test

[Survived] BlockStatement
services/enrollmentService.js:19:45
 }
 
 // "S1::C1"
-function enrollmentKey(studentId, courseId) {
-  return `${studentId}::${courseId}`;
-}
+function enrollmentKey(studentId, courseId) {}
 
 function isSameEnrollment(a, b) {

[Survived] BlockStatement
services/enrollmentService.js:23:33
   return `${studentId}::${courseId}`;
 }
 
-function isSameEnrollment(a, b) {
-  return enrollmentKey(a.studentId, a.courseId) === enrollmentKey(b.studentId, b.courseId);
-}
+function isSameEnrollment(a, b) {}
 
 function canEnroll(list = [], studentId, courseId) {

[Survived] EqualityOperator
services/enrollmentService.js:24:10
 }
 
 function isSameEnrollment(a, b) {
-  return enrollmentKey(a.studentId, a.courseId) === enrollmentKey(b.studentId, b.courseId);
+  return enrollmentKey(a.studentId, a.courseId) !== enrollmentKey(b.studentId, b.courseId);
 }
 

[Survived] ConditionalExpression
services/enrollmentService.js:24:10
 }
 
 function isSameEnrollment(a, b) {
-  return enrollmentKey(a.studentId, a.courseId) === enrollmentKey(b.studentId, b.courseId);
+  return false;
 }
 

[Survived] BlockStatement
services/enrollmentService.js:27:52
   return enrollmentKey(a.studentId, a.courseId) === enrollmentKey(b.studentId, b.courseId);
 }
 
-function canEnroll(list = [], studentId, courseId) {
-  return !list.some((e) => e.studentId === studentId && e.courseId === courseId);
-}
+function canEnroll(list = [], studentId, courseId) {}
 
 function buildEnrollmentRecords(list = []) {

[Survived] ArrayDeclaration
services/enrollmentService.js:27:27
   return enrollmentKey(a.studentId, a.courseId) === enrollmentKey(b.studentId, b.courseId);
 }
 
-function canEnroll(list = [], studentId, courseId) {
+function canEnroll(list = ["Stryker was here"], studentId, courseId) {
   return !list.some((e) => e.studentId === studentId && e.courseId === courseId);
 }

[Survived] ConditionalExpression
services/enrollmentService.js:28:28
 }
 
 function canEnroll(list = [], studentId, courseId) {
-  return !list.some((e) => e.studentId === studentId && e.courseId === courseId);
+  return !list.some((e) => true);
 }
 

[Survived] ConditionalExpression
services/enrollmentService.js:28:28
 }
 
 function canEnroll(list = [], studentId, courseId) {
-  return !list.some((e) => e.studentId === studentId && e.courseId === courseId);
+  return !list.some((e) => true && e.courseId === courseId);
 }
 

[Survived] BlockStatement
services/enrollmentService.js:31:44
   return !list.some((e) => e.studentId === studentId && e.courseId === courseId);
 }
 
-function buildEnrollmentRecords(list = []) {
-  return list
-    .map((p) => {
-      try {
-        return buildEnrollmentRecord(p);
-      } catch {
-        return null;
-      }
-    })
-    .filter(Boolean);
-}
+function buildEnrollmentRecords(list = []) {}
 
 function removeEnrollmentById(arr = [], id) {

[Survived] MethodExpression
services/enrollmentService.js:32:10
 }
 
 function buildEnrollmentRecords(list = []) {
-  return list
-    .map((p) => {
-      try {
-        return buildEnrollmentRecord(p);
-      } catch {
-        return null;
-      }
-    })
-    .filter(Boolean);
+  return list.map(p => {
+  try {
+    return buildEnrollmentRecord(p);
+  } catch {
+    return null;
+  }
+});
 }
 

[Survived] BlockStatement
services/enrollmentService.js:33:17
 
 function buildEnrollmentRecords(list = []) {
   return list
-    .map((p) => {
-      try {
-        return buildEnrollmentRecord(p);
-      } catch {
-        return null;
-      }
-    })
+    .map((p) => {})
     .filter(Boolean);
 }

[Survived] BlockStatement
services/enrollmentService.js:34:11
 function buildEnrollmentRecords(list = []) {
   return list
     .map((p) => {
-      try {
-        return buildEnrollmentRecord(p);
-      } catch {
+      try {} catch {
         return null;
       }

[Survived] BlockStatement
services/enrollmentService.js:36:15
     .map((p) => {
       try {
         return buildEnrollmentRecord(p);
-      } catch {
-        return null;
-      }
+      } catch {}
     })
     .filter(Boolean);

[Survived] BlockStatement
services/enrollmentService.js:43:45
     .filter(Boolean);
 }
 
-function removeEnrollmentById(arr = [], id) {
-  return arr.filter((e) => e.id !== id);
-}
+function removeEnrollmentById(arr = [], id) {}
 
 module.exports = {

[Survived] ArrayDeclaration
services/enrollmentService.js:43:37
     .filter(Boolean);
 }
 
-function removeEnrollmentById(arr = [], id) {
+function removeEnrollmentById(arr = ["Stryker was here"], id) {
   return arr.filter((e) => e.id !== id);
 }

[Survived] EqualityOperator
services/enrollmentService.js:44:28
 }
 
 function removeEnrollmentById(arr = [], id) {
-  return arr.filter((e) => e.id !== id);
+  return arr.filter((e) => e.id === id);
 }
 

[Survived] ConditionalExpression
services/enrollmentService.js:44:28
 }
 
 function removeEnrollmentById(arr = [], id) {
-  return arr.filter((e) => e.id !== id);
+  return arr.filter((e) => true);
 }
 
