[Killed] BlockStatement
services/studentService.js:3:46
 // services/studentService.js
 
-function formatFullName(firstName, lastName) {
-  const f = firstName ? String(firstName).trim() : "";
-  const l = lastName ? String(lastName).trim() : "";
-  return `${f} ${l}`.trim();
-}
+function formatFullName(firstName, lastName) {}
 
 // Capitalize each word (e.g., "raVi kumar" → "Ravi Kumar")
killedBy: All tests
statusReason: > student-management-backend@1.0.0 test
> mocha --exit --recursive test

[Killed] MethodExpression
services/studentService.js:4:25
 // services/studentService.js
 
 function formatFullName(firstName, lastName) {
-  const f = firstName ? String(firstName).trim() : "";
+  const f = firstName ? String(firstName) : "";
   const l = lastName ? String(lastName).trim() : "";
   return `${f} ${l}`.trim();
killedBy: All tests
statusReason: > student-management-backend@1.0.0 test
> mocha --exit --recursive test

[Killed] MethodExpression
services/studentService.js:5:24
 
 function formatFullName(firstName, lastName) {
   const f = firstName ? String(firstName).trim() : "";
-  const l = lastName ? String(lastName).trim() : "";
+  const l = lastName ? String(lastName) : "";
   return `${f} ${l}`.trim();
 }
killedBy: All tests
statusReason: > student-management-backend@1.0.0 test
> mocha --exit --recursive test

[Killed] StringLiteral
services/studentService.js:5:50
 
 function formatFullName(firstName, lastName) {
   const f = firstName ? String(firstName).trim() : "";
-  const l = lastName ? String(lastName).trim() : "";
+  const l = lastName ? String(lastName).trim() : "Stryker was here!";
   return `${f} ${l}`.trim();
 }
killedBy: All tests
statusReason: > student-management-backend@1.0.0 test
> mocha --exit --recursive test

[Killed] MethodExpression
services/studentService.js:6:10
 function formatFullName(firstName, lastName) {
   const f = firstName ? String(firstName).trim() : "";
   const l = lastName ? String(lastName).trim() : "";
-  return `${f} ${l}`.trim();
+  return `${f} ${l}`;
 }
 
killedBy: All tests
statusReason: > student-management-backend@1.0.0 test
> mocha --exit --recursive test

[Survived] BlockStatement
services/studentService.js:10:35
 }
 
 // Capitalize each word (e.g., "raVi kumar" → "Ravi Kumar")
-function normalizeName(name = "") {
-  return String(name || "")
-    .trim()
-    .split(/\s+/)
-    .map((part) => part.charAt(0).toUpperCase() + part.slice(1).toLowerCase())
-    .join(" ");
-}
+function normalizeName(name = "") {}
 
 // Deterministic admission no (useful for testing)

[Survived] StringLiteral
services/studentService.js:10:31
 }
 
 // Capitalize each word (e.g., "raVi kumar" → "Ravi Kumar")
-function normalizeName(name = "") {
+function normalizeName(name = "Stryker was here!") {
   return String(name || "")
     .trim()

[Survived] ConditionalExpression
services/studentService.js:11:17
 
 // Capitalize each word (e.g., "raVi kumar" → "Ravi Kumar")
 function normalizeName(name = "") {
-  return String(name || "")
+  return String(false)
     .trim()
     .split(/\s+/)

[Survived] MethodExpression
services/studentService.js:11:10
 
 // Capitalize each word (e.g., "raVi kumar" → "Ravi Kumar")
 function normalizeName(name = "") {
-  return String(name || "")
-    .trim()
+  return String(name || "")
     .split(/\s+/)
     .map((part) => part.charAt(0).toUpperCase() + part.slice(1).toLowerCase())

[Survived] Regex
services/studentService.js:13:12
 function normalizeName(name = "") {
   return String(name || "")
     .trim()
-    .split(/\s+/)
+    .split(/\s/)
     .map((part) => part.charAt(0).toUpperCase() + part.slice(1).toLowerCase())
     .join(" ");

[Survived] MethodExpression
services/studentService.js:14:20
   return String(name || "")
     .trim()
     .split(/\s+/)
-    .map((part) => part.charAt(0).toUpperCase() + part.slice(1).toLowerCase())
+    .map((part) => part.toUpperCase() + part.slice(1).toLowerCase())
     .join(" ");
 }

[Survived] ArrowFunction
services/studentService.js:14:10
   return String(name || "")
     .trim()
     .split(/\s+/)
-    .map((part) => part.charAt(0).toUpperCase() + part.slice(1).toLowerCase())
+    .map(() => undefined)
     .join(" ");
 }

[Survived] BlockStatement
services/studentService.js:19:53
 }
 
 // Deterministic admission no (useful for testing)
-function generateAdmissionNo(index = 0, base = 100) {
-  return `ADM${base + Number(index)}`;
-}
+function generateAdmissionNo(index = 0, base = 100) {}
 
 // Basic email normalization

[Survived] ArithmeticOperator
services/studentService.js:20:16
 
 // Deterministic admission no (useful for testing)
 function generateAdmissionNo(index = 0, base = 100) {
-  return `ADM${base + Number(index)}`;
+  return `ADM${base - Number(index)}`;
 }
 

[Killed] BlockStatement
services/studentService.js:24:37
 }
 
 // Basic email normalization
-function normalizeEmail(email = "") {
-  return String(email || "").trim().toLowerCase();
-}
+function normalizeEmail(email = "") {}
 
 // Mask email → ravi@example.com → r***i@example.com
killedBy: All tests
statusReason: > student-management-backend@1.0.0 test
> mocha --exit --recursive test

[Survived] StringLiteral
services/studentService.js:24:33
 }
 
 // Basic email normalization
-function normalizeEmail(email = "") {
+function normalizeEmail(email = "Stryker was here!") {
   return String(email || "").trim().toLowerCase();
 }

[Killed] LogicalOperator
services/studentService.js:25:17
 
 // Basic email normalization
 function normalizeEmail(email = "") {
-  return String(email || "").trim().toLowerCase();
+  return String(email && "").trim().toLowerCase();
 }
 
killedBy: All tests
statusReason: > student-management-backend@1.0.0 test
> mocha --exit --recursive test

[Killed] ConditionalExpression
services/studentService.js:25:17
 
 // Basic email normalization
 function normalizeEmail(email = "") {
-  return String(email || "").trim().toLowerCase();
+  return String(true).trim().toLowerCase();
 }
 
killedBy: All tests
statusReason: > student-management-backend@1.0.0 test
> mocha --exit --recursive test

[Survived] BlockStatement
services/studentService.js:29:32
 }
 
 // Mask email → ravi@example.com → r***i@example.com
-function maskEmail(email = "") {
-  const e = normalizeEmail(email);
-  if (!e.includes("@")) return e;
-  const [local, domain] = e.split("@");
-  if (local.length <= 2) return `*@${domain}`;
-  return `${local[0]}${"*".repeat(local.length - 2)}${local[local.length - 1]}@${domain}`;
-}
+function maskEmail(email = "") {}
 
 function validatePhone(phone = "") {

[Survived] BooleanLiteral
services/studentService.js:31:7
 // Mask email → ravi@example.com → r***i@example.com
 function maskEmail(email = "") {
   const e = normalizeEmail(email);
-  if (!e.includes("@")) return e;
+  if (e.includes("@")) return e;
   const [local, domain] = e.split("@");
   if (local.length <= 2) return `*@${domain}`;

[Survived] ConditionalExpression
services/studentService.js:31:7
 // Mask email → ravi@example.com → r***i@example.com
 function maskEmail(email = "") {
   const e = normalizeEmail(email);
-  if (!e.includes("@")) return e;
+  if (false) return e;
   const [local, domain] = e.split("@");
   if (local.length <= 2) return `*@${domain}`;

[Survived] ConditionalExpression
services/studentService.js:33:7
   const e = normalizeEmail(email);
   if (!e.includes("@")) return e;
   const [local, domain] = e.split("@");
-  if (local.length <= 2) return `*@${domain}`;
+  if (true) return `*@${domain}`;
   return `${local[0]}${"*".repeat(local.length - 2)}${local[local.length - 1]}@${domain}`;
 }

[Survived] EqualityOperator
services/studentService.js:33:7
   const e = normalizeEmail(email);
   if (!e.includes("@")) return e;
   const [local, domain] = e.split("@");
-  if (local.length <= 2) return `*@${domain}`;
+  if (local.length < 2) return `*@${domain}`;
   return `${local[0]}${"*".repeat(local.length - 2)}${local[local.length - 1]}@${domain}`;
 }

[Survived] ArithmeticOperator
services/studentService.js:34:61
   if (!e.includes("@")) return e;
   const [local, domain] = e.split("@");
   if (local.length <= 2) return `*@${domain}`;
-  return `${local[0]}${"*".repeat(local.length - 2)}${local[local.length - 1]}@${domain}`;
+  return `${local[0]}${"*".repeat(local.length - 2)}${local[local.length + 1]}@${domain}`;
 }
 

[Survived] ArithmeticOperator
services/studentService.js:34:35
   if (!e.includes("@")) return e;
   const [local, domain] = e.split("@");
   if (local.length <= 2) return `*@${domain}`;
-  return `${local[0]}${"*".repeat(local.length - 2)}${local[local.length - 1]}@${domain}`;
+  return `${local[0]}${"*".repeat(local.length + 2)}${local[local.length - 1]}@${domain}`;
 }
 

[Survived] BlockStatement
services/studentService.js:37:36
   return `${local[0]}${"*".repeat(local.length - 2)}${local[local.length - 1]}@${domain}`;
 }
 
-function validatePhone(phone = "") {
-  const cleaned = phone.replace(/[\s\-()]/g, "");
-  return /^\+?\d{6,15}$/.test(cleaned);
-}
+function validatePhone(phone = "") {}
 
 // Calculate age from dob

[Survived] StringLiteral
services/studentService.js:38:46
 }
 
 function validatePhone(phone = "") {
-  const cleaned = phone.replace(/[\s\-()]/g, "");
+  const cleaned = phone.replace(/[\s\-()]/g, "Stryker was here!");
   return /^\+?\d{6,15}$/.test(cleaned);
 }

[Survived] Regex
services/studentService.js:39:10
 
 function validatePhone(phone = "") {
   const cleaned = phone.replace(/[\s\-()]/g, "");
-  return /^\+?\d{6,15}$/.test(cleaned);
+  return /^\+?\d{6,15}/.test(cleaned);
 }
 

[Survived] Regex
services/studentService.js:39:10
 
 function validatePhone(phone = "") {
   const cleaned = phone.replace(/[\s\-()]/g, "");
-  return /^\+?\d{6,15}$/.test(cleaned);
+  return /\+?\d{6,15}$/.test(cleaned);
 }
 

[Survived] BlockStatement
services/studentService.js:43:28
 }
 
 // Calculate age from dob
-function calculateAge(dob) {
-  if (!dob) return null;
-  const d = new Date(dob);
-  if (isNaN(d)) return null;
-  const today = new Date();
-  let age = today.getFullYear() - d.getFullYear();
-  if (today < new Date(today.getFullYear(), d.getMonth(), d.getDate())) {
-    age--;
-  }
-  return age;
-}
+function calculateAge(dob) {}
 
 function isAdult(dob, limit = 18) {

[Survived] BooleanLiteral
services/studentService.js:44:7
 
 // Calculate age from dob
 function calculateAge(dob) {
-  if (!dob) return null;
+  if (dob) return null;
   const d = new Date(dob);
   if (isNaN(d)) return null;

[Survived] ConditionalExpression
services/studentService.js:44:7
 
 // Calculate age from dob
 function calculateAge(dob) {
-  if (!dob) return null;
+  if (false) return null;
   const d = new Date(dob);
   if (isNaN(d)) return null;

[Survived] ConditionalExpression
services/studentService.js:46:7
 function calculateAge(dob) {
   if (!dob) return null;
   const d = new Date(dob);
-  if (isNaN(d)) return null;
+  if (false) return null;
   const today = new Date();
   let age = today.getFullYear() - d.getFullYear();

[Survived] ConditionalExpression
services/studentService.js:46:7
 function calculateAge(dob) {
   if (!dob) return null;
   const d = new Date(dob);
-  if (isNaN(d)) return null;
+  if (true) return null;
   const today = new Date();
   let age = today.getFullYear() - d.getFullYear();

[Survived] ArithmeticOperator
services/studentService.js:48:13
   const d = new Date(dob);
   if (isNaN(d)) return null;
   const today = new Date();
-  let age = today.getFullYear() - d.getFullYear();
+  let age = today.getFullYear() + d.getFullYear();
   if (today < new Date(today.getFullYear(), d.getMonth(), d.getDate())) {
     age--;

[Timeout] BlockStatement
services/studentService.js:49:73
   if (isNaN(d)) return null;
   const today = new Date();
   let age = today.getFullYear() - d.getFullYear();
-  if (today < new Date(today.getFullYear(), d.getMonth(), d.getDate())) {
-    age--;
-  }
+  if (today < new Date(today.getFullYear(), d.getMonth(), d.getDate())) {}
   return age;
 }

[Survived] EqualityOperator
services/studentService.js:49:7
   if (isNaN(d)) return null;
   const today = new Date();
   let age = today.getFullYear() - d.getFullYear();
-  if (today < new Date(today.getFullYear(), d.getMonth(), d.getDate())) {
+  if (today >= new Date(today.getFullYear(), d.getMonth(), d.getDate())) {
     age--;
   }

[Timeout] UpdateOperator
services/studentService.js:50:5
   const today = new Date();
   let age = today.getFullYear() - d.getFullYear();
   if (today < new Date(today.getFullYear(), d.getMonth(), d.getDate())) {
-    age--;
+    age++;
   }
   return age;

[Timeout] BlockStatement
services/studentService.js:55:35
   return age;
 }
 
-function isAdult(dob, limit = 18) {
-  const age = calculateAge(dob);
-  return age !== null && age >= limit;
-}
+function isAdult(dob, limit = 18) {}
 
 // Validation of student input

[Survived] EqualityOperator
services/studentService.js:57:26
 
 function isAdult(dob, limit = 18) {
   const age = calculateAge(dob);
-  return age !== null && age >= limit;
+  return age !== null && age < limit;
 }
 

[Survived] LogicalOperator
services/studentService.js:57:10
 
 function isAdult(dob, limit = 18) {
   const age = calculateAge(dob);
-  return age !== null && age >= limit;
+  return age !== null || age >= limit;
 }
 

[Killed] BlockStatement
services/studentService.js:61:47
 }
 
 // Validation of student input
-function validateStudentPayload(payload = {}) {
-  const errors = [];
-  if (!payload) {
-    return { valid: false, errors: ["firstName required", "lastName required"] };
-  }
-  if (!payload.firstName) errors.push("firstName required");
-  if (!payload.lastName) errors.push("lastName required");
-  if (payload.email) {
-    const re = /^[^\s@]+@[^\s@]+\.[^\s@]+$/;
-    if (!re.test(payload.email)) errors.push("invalid email");
-  }
-  if (payload.phone && !validatePhone(payload.phone)) errors.push("invalid phone");
-
-  return { valid: errors.length === 0, errors };
-}
+function validateStudentPayload(payload = {}) {}
 
 // Build student DB object
killedBy: All tests
statusReason: > student-management-backend@1.0.0 test
> mocha --exit --recursive test

[Killed] ConditionalExpression
services/studentService.js:63:7
 // Validation of student input
 function validateStudentPayload(payload = {}) {
   const errors = [];
-  if (!payload) {
+  if (false) {
     return { valid: false, errors: ["firstName required", "lastName required"] };
   }
killedBy: All tests
statusReason: > student-management-backend@1.0.0 test
> mocha --exit --recursive test

[Killed] BooleanLiteral
services/studentService.js:63:7
 // Validation of student input
 function validateStudentPayload(payload = {}) {
   const errors = [];
-  if (!payload) {
+  if (payload) {
     return { valid: false, errors: ["firstName required", "lastName required"] };
   }
killedBy: All tests
statusReason: > student-management-backend@1.0.0 test
> mocha --exit --recursive test

[Killed] BooleanLiteral
services/studentService.js:64:21
 function validateStudentPayload(payload = {}) {
   const errors = [];
   if (!payload) {
-    return { valid: false, errors: ["firstName required", "lastName required"] };
+    return { valid: true, errors: ["firstName required", "lastName required"] };
   }
   if (!payload.firstName) errors.push("firstName required");
killedBy: All tests
statusReason: > student-management-backend@1.0.0 test
> mocha --exit --recursive test

[Survived] StringLiteral
services/studentService.js:64:59
 function validateStudentPayload(payload = {}) {
   const errors = [];
   if (!payload) {
-    return { valid: false, errors: ["firstName required", "lastName required"] };
+    return { valid: false, errors: ["firstName required", ""] };
   }
   if (!payload.firstName) errors.push("firstName required");

[Killed] ConditionalExpression
services/studentService.js:66:7
   if (!payload) {
     return { valid: false, errors: ["firstName required", "lastName required"] };
   }
-  if (!payload.firstName) errors.push("firstName required");
+  if (true) errors.push("firstName required");
   if (!payload.lastName) errors.push("lastName required");
   if (payload.email) {
killedBy: All tests
statusReason: > student-management-backend@1.0.0 test
> mocha --exit --recursive test

[Killed] BooleanLiteral
services/studentService.js:66:7
   if (!payload) {
     return { valid: false, errors: ["firstName required", "lastName required"] };
   }
-  if (!payload.firstName) errors.push("firstName required");
+  if (payload.firstName) errors.push("firstName required");
   if (!payload.lastName) errors.push("lastName required");
   if (payload.email) {
killedBy: All tests
statusReason: > student-management-backend@1.0.0 test
> mocha --exit --recursive test

[Killed] BooleanLiteral
services/studentService.js:67:7
     return { valid: false, errors: ["firstName required", "lastName required"] };
   }
   if (!payload.firstName) errors.push("firstName required");
-  if (!payload.lastName) errors.push("lastName required");
+  if (payload.lastName) errors.push("lastName required");
   if (payload.email) {
     const re = /^[^\s@]+@[^\s@]+\.[^\s@]+$/;
killedBy: All tests
statusReason: > student-management-backend@1.0.0 test
> mocha --exit --recursive test

[Killed] ConditionalExpression
services/studentService.js:67:7
     return { valid: false, errors: ["firstName required", "lastName required"] };
   }
   if (!payload.firstName) errors.push("firstName required");
-  if (!payload.lastName) errors.push("lastName required");
+  if (true) errors.push("lastName required");
   if (payload.email) {
     const re = /^[^\s@]+@[^\s@]+\.[^\s@]+$/;
killedBy: All tests
statusReason: > student-management-backend@1.0.0 test
> mocha --exit --recursive test

[Killed] ConditionalExpression
services/studentService.js:68:7
   }
   if (!payload.firstName) errors.push("firstName required");
   if (!payload.lastName) errors.push("lastName required");
-  if (payload.email) {
+  if (true) {
     const re = /^[^\s@]+@[^\s@]+\.[^\s@]+$/;
     if (!re.test(payload.email)) errors.push("invalid email");
killedBy: All tests
statusReason: > student-management-backend@1.0.0 test
> mocha --exit --recursive test

[Survived] BlockStatement
services/studentService.js:68:22
   }
   if (!payload.firstName) errors.push("firstName required");
   if (!payload.lastName) errors.push("lastName required");
-  if (payload.email) {
-    const re = /^[^\s@]+@[^\s@]+\.[^\s@]+$/;
-    if (!re.test(payload.email)) errors.push("invalid email");
-  }
+  if (payload.email) {}
   if (payload.phone && !validatePhone(payload.phone)) errors.push("invalid phone");
 

[Killed] Regex
services/studentService.js:69:16
   if (!payload.firstName) errors.push("firstName required");
   if (!payload.lastName) errors.push("lastName required");
   if (payload.email) {
-    const re = /^[^\s@]+@[^\s@]+\.[^\s@]+$/;
+    const re = /^[^\s@]+@[^\s@]+\.[^\S@]+$/;
     if (!re.test(payload.email)) errors.push("invalid email");
   }
killedBy: All tests
statusReason: > student-management-backend@1.0.0 test
> mocha --exit --recursive test

[Killed] Regex
services/studentService.js:69:16
   if (!payload.firstName) errors.push("firstName required");
   if (!payload.lastName) errors.push("lastName required");
   if (payload.email) {
-    const re = /^[^\s@]+@[^\s@]+\.[^\s@]+$/;
+    const re = /^[^\s@]+@[^\s@]+\.[^\s@]$/;
     if (!re.test(payload.email)) errors.push("invalid email");
   }
killedBy: All tests
statusReason: > student-management-backend@1.0.0 test
> mocha --exit --recursive test

[Killed] BooleanLiteral
services/studentService.js:70:9
   if (!payload.lastName) errors.push("lastName required");
   if (payload.email) {
     const re = /^[^\s@]+@[^\s@]+\.[^\s@]+$/;
-    if (!re.test(payload.email)) errors.push("invalid email");
+    if (re.test(payload.email)) errors.push("invalid email");
   }
   if (payload.phone && !validatePhone(payload.phone)) errors.push("invalid phone");
killedBy: All tests
statusReason: > student-management-backend@1.0.0 test
> mocha --exit --recursive test

[Killed] ConditionalExpression
services/studentService.js:70:9
   if (!payload.lastName) errors.push("lastName required");
   if (payload.email) {
     const re = /^[^\s@]+@[^\s@]+\.[^\s@]+$/;
-    if (!re.test(payload.email)) errors.push("invalid email");
+    if (true) errors.push("invalid email");
   }
   if (payload.phone && !validatePhone(payload.phone)) errors.push("invalid phone");
killedBy: All tests
statusReason: > student-management-backend@1.0.0 test
> mocha --exit --recursive test

[Killed] ConditionalExpression
services/studentService.js:72:7
     const re = /^[^\s@]+@[^\s@]+\.[^\s@]+$/;
     if (!re.test(payload.email)) errors.push("invalid email");
   }
-  if (payload.phone && !validatePhone(payload.phone)) errors.push("invalid phone");
+  if (true) errors.push("invalid phone");
 
   return { valid: errors.length === 0, errors };
killedBy: All tests
statusReason: > student-management-backend@1.0.0 test
> mocha --exit --recursive test

[Killed] LogicalOperator
services/studentService.js:72:7
     const re = /^[^\s@]+@[^\s@]+\.[^\s@]+$/;
     if (!re.test(payload.email)) errors.push("invalid email");
   }
-  if (payload.phone && !validatePhone(payload.phone)) errors.push("invalid phone");
+  if (payload.phone || !validatePhone(payload.phone)) errors.push("invalid phone");
 
   return { valid: errors.length === 0, errors };
killedBy: All tests
statusReason: > student-management-backend@1.0.0 test
> mocha --exit --recursive test

[Killed] BlockStatement
services/studentService.js:78:61
 }
 
 // Build student DB object
-function buildStudentRecord(payload = {}, now = Date.now()) {
-  return {
-    admissionNo: payload.admissionNo || "",
-    firstName: payload.firstName || "",
-    lastName: payload.lastName || "",
-    dob: payload.dob || "",
-    email: normalizeEmail(payload.email || ""),
-    phone: payload.phone || "",
-    address: payload.address || "",
-    year: payload.year || "",
-    notes: payload.notes || "",
-    createdAt: now,
-    updatedAt: now,
-  };
-}
+function buildStudentRecord(payload = {}, now = Date.now()) {}
 
 function rowToStudent(r = {}) {
killedBy: All tests
statusReason: > student-management-backend@1.0.0 test
> mocha --exit --recursive test

[Killed] ObjectLiteral
services/studentService.js:79:10
 
 // Build student DB object
 function buildStudentRecord(payload = {}, now = Date.now()) {
-  return {
-    admissionNo: payload.admissionNo || "",
-    firstName: payload.firstName || "",
-    lastName: payload.lastName || "",
-    dob: payload.dob || "",
-    email: normalizeEmail(payload.email || ""),
-    phone: payload.phone || "",
-    address: payload.address || "",
-    year: payload.year || "",
-    notes: payload.notes || "",
-    createdAt: now,
-    updatedAt: now,
-  };
+  return {};
 }
 
killedBy: All tests
statusReason: > student-management-backend@1.0.0 test
> mocha --exit --recursive test

[Survived] ConditionalExpression
services/studentService.js:80:18
 // Build student DB object
 function buildStudentRecord(payload = {}, now = Date.now()) {
   return {
-    admissionNo: payload.admissionNo || "",
+    admissionNo: true,
     firstName: payload.firstName || "",
     lastName: payload.lastName || "",

[Survived] ConditionalExpression
services/studentService.js:80:18
 // Build student DB object
 function buildStudentRecord(payload = {}, now = Date.now()) {
   return {
-    admissionNo: payload.admissionNo || "",
+    admissionNo: false,
     firstName: payload.firstName || "",
     lastName: payload.lastName || "",

[Killed] ConditionalExpression
services/studentService.js:81:16
 function buildStudentRecord(payload = {}, now = Date.now()) {
   return {
     admissionNo: payload.admissionNo || "",
-    firstName: payload.firstName || "",
+    firstName: false,
     lastName: payload.lastName || "",
     dob: payload.dob || "",
killedBy: All tests
statusReason: > student-management-backend@1.0.0 test
> mocha --exit --recursive test

[Killed] ConditionalExpression
services/studentService.js:81:16
 function buildStudentRecord(payload = {}, now = Date.now()) {
   return {
     admissionNo: payload.admissionNo || "",
-    firstName: payload.firstName || "",
+    firstName: true,
     lastName: payload.lastName || "",
     dob: payload.dob || "",
killedBy: All tests
statusReason: > student-management-backend@1.0.0 test
> mocha --exit --recursive test

[Killed] ConditionalExpression
services/studentService.js:82:15
   return {
     admissionNo: payload.admissionNo || "",
     firstName: payload.firstName || "",
-    lastName: payload.lastName || "",
+    lastName: true,
     dob: payload.dob || "",
     email: normalizeEmail(payload.email || ""),
killedBy: All tests
statusReason: > student-management-backend@1.0.0 test
> mocha --exit --recursive test

[Killed] ConditionalExpression
services/studentService.js:82:15
   return {
     admissionNo: payload.admissionNo || "",
     firstName: payload.firstName || "",
-    lastName: payload.lastName || "",
+    lastName: false,
     dob: payload.dob || "",
     email: normalizeEmail(payload.email || ""),
killedBy: All tests
statusReason: > student-management-backend@1.0.0 test
> mocha --exit --recursive test

[Survived] LogicalOperator
services/studentService.js:83:10
     admissionNo: payload.admissionNo || "",
     firstName: payload.firstName || "",
     lastName: payload.lastName || "",
-    dob: payload.dob || "",
+    dob: payload.dob && "",
     email: normalizeEmail(payload.email || ""),
     phone: payload.phone || "",

[Survived] ConditionalExpression
services/studentService.js:83:10
     admissionNo: payload.admissionNo || "",
     firstName: payload.firstName || "",
     lastName: payload.lastName || "",
-    dob: payload.dob || "",
+    dob: false,
     email: normalizeEmail(payload.email || ""),
     phone: payload.phone || "",

[Killed] ConditionalExpression
services/studentService.js:84:27
     firstName: payload.firstName || "",
     lastName: payload.lastName || "",
     dob: payload.dob || "",
-    email: normalizeEmail(payload.email || ""),
+    email: normalizeEmail(true),
     phone: payload.phone || "",
     address: payload.address || "",
killedBy: All tests
statusReason: > student-management-backend@1.0.0 test
> mocha --exit --recursive test

[Killed] ConditionalExpression
services/studentService.js:84:27
     firstName: payload.firstName || "",
     lastName: payload.lastName || "",
     dob: payload.dob || "",
-    email: normalizeEmail(payload.email || ""),
+    email: normalizeEmail(false),
     phone: payload.phone || "",
     address: payload.address || "",
killedBy: All tests
statusReason: > student-management-backend@1.0.0 test
> mocha --exit --recursive test

[Survived] ConditionalExpression
services/studentService.js:85:12
     lastName: payload.lastName || "",
     dob: payload.dob || "",
     email: normalizeEmail(payload.email || ""),
-    phone: payload.phone || "",
+    phone: true,
     address: payload.address || "",
     year: payload.year || "",

[Survived] ConditionalExpression
services/studentService.js:85:12
     lastName: payload.lastName || "",
     dob: payload.dob || "",
     email: normalizeEmail(payload.email || ""),
-    phone: payload.phone || "",
+    phone: false,
     address: payload.address || "",
     year: payload.year || "",

[Survived] ConditionalExpression
services/studentService.js:86:14
     dob: payload.dob || "",
     email: normalizeEmail(payload.email || ""),
     phone: payload.phone || "",
-    address: payload.address || "",
+    address: false,
     year: payload.year || "",
     notes: payload.notes || "",

[Survived] LogicalOperator
services/studentService.js:86:14
     dob: payload.dob || "",
     email: normalizeEmail(payload.email || ""),
     phone: payload.phone || "",
-    address: payload.address || "",
+    address: payload.address && "",
     year: payload.year || "",
     notes: payload.notes || "",

[Survived] LogicalOperator
services/studentService.js:87:11
     email: normalizeEmail(payload.email || ""),
     phone: payload.phone || "",
     address: payload.address || "",
-    year: payload.year || "",
+    year: payload.year && "",
     notes: payload.notes || "",
     createdAt: now,

[Survived] ConditionalExpression
services/studentService.js:87:11
     email: normalizeEmail(payload.email || ""),
     phone: payload.phone || "",
     address: payload.address || "",
-    year: payload.year || "",
+    year: true,
     notes: payload.notes || "",
     createdAt: now,

[Survived] ConditionalExpression
services/studentService.js:88:12
     phone: payload.phone || "",
     address: payload.address || "",
     year: payload.year || "",
-    notes: payload.notes || "",
+    notes: false,
     createdAt: now,
     updatedAt: now,

[Survived] LogicalOperator
services/studentService.js:88:12
     phone: payload.phone || "",
     address: payload.address || "",
     year: payload.year || "",
-    notes: payload.notes || "",
+    notes: payload.notes && "",
     createdAt: now,
     updatedAt: now,

[Killed] BlockStatement
services/studentService.js:94:31
   };
 }
 
-function rowToStudent(r = {}) {
-  if (!r) return null;
-  return {
-    id: r.id,
-    admissionNo: r.admissionNo,
-    firstName: r.firstName,
-    lastName: r.lastName,
-    fullName: formatFullName(r.firstName, r.lastName),
-    email: r.email,
-    emailMasked: maskEmail(r.email),
-    year: r.year,
-    phone: r.phone,
-  };
-}
+function rowToStudent(r = {}) {}
 
 // Sorting students
killedBy: All tests
statusReason: > student-management-backend@1.0.0 test
> mocha --exit --recursive test

[Killed] BooleanLiteral
services/studentService.js:95:7
 }
 
 function rowToStudent(r = {}) {
-  if (!r) return null;
+  if (r) return null;
   return {
     id: r.id,
killedBy: All tests
statusReason: > student-management-backend@1.0.0 test
> mocha --exit --recursive test
