[Killed] ConditionalExpression
services/studentService.js:95:7
 }
 
 function rowToStudent(r = {}) {
-  if (!r) return null;
+  if (true) return null;
   return {
     id: r.id,
killedBy: All tests
statusReason: > student-management-backend@1.0.0 test
> mocha --exit --recursive test

[Killed] ObjectLiteral
services/studentService.js:96:10
 
 function rowToStudent(r = {}) {
   if (!r) return null;
-  return {
-    id: r.id,
-    admissionNo: r.admissionNo,
-    firstName: r.firstName,
-    lastName: r.lastName,
-    fullName: formatFullName(r.firstName, r.lastName),
-    email: r.email,
-    emailMasked: maskEmail(r.email),
-    year: r.year,
-    phone: r.phone,
-  };
+  return {};
 }
 
killedBy: All tests
statusReason: > student-management-backend@1.0.0 test
> mocha --exit --recursive test

[Survived] BlockStatement
services/studentService.js:110:42
 }
 
 // Sorting students
-function compareStudents(a = {}, b = {}) {
-  const la = (a.lastName || "").toLowerCase();
-  const lb = (b.lastName || "").toLowerCase();
-  if (la < lb) return -1;
-  if (la > lb) return 1;
-  return (a.firstName || "").localeCompare(b.firstName || "");
-}
+function compareStudents(a = {}, b = {}) {}
 
 module.exports = {

[Survived] LogicalOperator
services/studentService.js:111:15
 
 // Sorting students
 function compareStudents(a = {}, b = {}) {
-  const la = (a.lastName || "").toLowerCase();
+  const la = (a.lastName && "").toLowerCase();
   const lb = (b.lastName || "").toLowerCase();
   if (la < lb) return -1;

[Survived] MethodExpression
services/studentService.js:111:14
 
 // Sorting students
 function compareStudents(a = {}, b = {}) {
-  const la = (a.lastName || "").toLowerCase();
+  const la = (a.lastName || "").toUpperCase();
   const lb = (b.lastName || "").toLowerCase();
   if (la < lb) return -1;

[Survived] LogicalOperator
services/studentService.js:112:15
 // Sorting students
 function compareStudents(a = {}, b = {}) {
   const la = (a.lastName || "").toLowerCase();
-  const lb = (b.lastName || "").toLowerCase();
+  const lb = (b.lastName && "").toLowerCase();
   if (la < lb) return -1;
   if (la > lb) return 1;

[Survived] ConditionalExpression
services/studentService.js:112:15
 // Sorting students
 function compareStudents(a = {}, b = {}) {
   const la = (a.lastName || "").toLowerCase();
-  const lb = (b.lastName || "").toLowerCase();
+  const lb = (true).toLowerCase();
   if (la < lb) return -1;
   if (la > lb) return 1;

[Survived] EqualityOperator
services/studentService.js:113:7
 function compareStudents(a = {}, b = {}) {
   const la = (a.lastName || "").toLowerCase();
   const lb = (b.lastName || "").toLowerCase();
-  if (la < lb) return -1;
+  if (la >= lb) return -1;
   if (la > lb) return 1;
   return (a.firstName || "").localeCompare(b.firstName || "");

[Survived] ConditionalExpression
services/studentService.js:113:7
 function compareStudents(a = {}, b = {}) {
   const la = (a.lastName || "").toLowerCase();
   const lb = (b.lastName || "").toLowerCase();
-  if (la < lb) return -1;
+  if (true) return -1;
   if (la > lb) return 1;
   return (a.firstName || "").localeCompare(b.firstName || "");

[Survived] ConditionalExpression
services/studentService.js:114:7
   const la = (a.lastName || "").toLowerCase();
   const lb = (b.lastName || "").toLowerCase();
   if (la < lb) return -1;
-  if (la > lb) return 1;
+  if (false) return 1;
   return (a.firstName || "").localeCompare(b.firstName || "");
 }

[Survived] EqualityOperator
services/studentService.js:114:7
   const la = (a.lastName || "").toLowerCase();
   const lb = (b.lastName || "").toLowerCase();
   if (la < lb) return -1;
-  if (la > lb) return 1;
+  if (la <= lb) return 1;
   return (a.firstName || "").localeCompare(b.firstName || "");
 }

[Survived] ConditionalExpression
services/studentService.js:115:44
   const lb = (b.lastName || "").toLowerCase();
   if (la < lb) return -1;
   if (la > lb) return 1;
-  return (a.firstName || "").localeCompare(b.firstName || "");
+  return (a.firstName || "").localeCompare(true);
 }
 

[Survived] ConditionalExpression
services/studentService.js:115:11
   const lb = (b.lastName || "").toLowerCase();
   if (la < lb) return -1;
   if (la > lb) return 1;
-  return (a.firstName || "").localeCompare(b.firstName || "");
+  return (true).localeCompare(b.firstName || "");
 }
 

[Killed] ObjectLiteral
services/studentService.js:118:18
   return (a.firstName || "").localeCompare(b.firstName || "");
 }
 
-module.exports = {
-  formatFullName,
-  normalizeName,
-  generateAdmissionNo,
-  normalizeEmail,
-  maskEmail,
-  validatePhone,
-  calculateAge,
-  isAdult,
-  validateStudentPayload,
-  buildStudentRecord,
-  rowToStudent,
-  compareStudents,
-};
+module.exports = {};
 
killedBy: All tests
statusReason: > student-management-backend@1.0.0 test
> mocha --exit --recursive test
