[NoCoverage] StringLiteral
services/attendanceService.js:7:40
-       studentId: row.studentId == null ? '' : String(row.studentId),
+       studentId: row.studentId == null ? "Stryker was here!" : String(row.studentId),

[NoCoverage] StringLiteral
services/attendanceService.js:8:38
-       courseId: row.courseId == null ? '' : String(row.courseId),
+       courseId: row.courseId == null ? "Stryker was here!" : String(row.courseId),

[NoCoverage] StringLiteral
services/attendanceService.js:9:30
-       date: row.date == null ? '' : String(row.date),
+       date: row.date == null ? "Stryker was here!" : String(row.date),

[NoCoverage] StringLiteral
services/attendanceService.js:10:34
-       status: row.status == null ? '' : String(row.status).toLowerCase()
+       status: row.status == null ? "Stryker was here!" : String(row.status).toLowerCase()

[NoCoverage] BooleanLiteral
services/attendanceService.js:18:43
-     if (!s || typeof s !== 'string') return false;
+     if (!s || typeof s !== 'string') return true;

[NoCoverage] BooleanLiteral
services/attendanceService.js:23:62
-     if (month < 1 || month > 12 || day < 1 || day > 31) return false;
+     if (month < 1 || month > 12 || day < 1 || day > 31) return true;

[NoCoverage] BooleanLiteral
services/attendanceService.js:26:41
-     if (Number.isNaN(d.getTime())) return false;
+     if (Number.isNaN(d.getTime())) return true;

[NoCoverage] ArrayDeclaration
services/attendanceService.js:36:60
-     if (!isValidDateISO(from) || !isValidDateISO(to)) return [];
+     if (!isValidDateISO(from) || !isValidDateISO(to)) return ["Stryker was here"];

[NoCoverage] ArrayDeclaration
services/attendanceService.js:39:27
-     if (start > end) return [];
+     if (start > end) return ["Stryker was here"];

[NoCoverage] BlockStatement
services/attendanceService.js:60:36
-     if (!csvText || !csvText.trim()) {
-       errors.push('empty csv');
-       return { rows: [], errors };
-     }
+     if (!csvText || !csvText.trim()) {}

[NoCoverage] StringLiteral
services/attendanceService.js:61:17
-       errors.push('empty csv');
+       errors.push("");

[NoCoverage] ObjectLiteral
services/attendanceService.js:62:12
-       return { rows: [], errors };
+       return {};

[NoCoverage] ArrayDeclaration
services/attendanceService.js:62:20
-       return { rows: [], errors };
+       return { rows: ["Stryker was here"], errors };

[NoCoverage] BlockStatement
services/attendanceService.js:65:27
-     if (lines.length === 0) {
-       errors.push('empty csv');
-       return { rows: [], errors };
-     }
+     if (lines.length === 0) {}

[NoCoverage] StringLiteral
services/attendanceService.js:66:17
-       errors.push('empty csv');
+       errors.push("");

[NoCoverage] ObjectLiteral
services/attendanceService.js:67:12
-       return { rows: [], errors };
+       return {};

[NoCoverage] ArrayDeclaration
services/attendanceService.js:67:20
-       return { rows: [], errors };
+       return { rows: ["Stryker was here"], errors };

[NoCoverage] ArrowFunction
services/attendanceService.js:82:18
-     header.forEach((h, i) => idx[h] = i);
+     header.forEach(() => undefined);

[NoCoverage] ConditionalExpression
services/attendanceService.js:85:19
-     for (let i = 1; i < lines.length; i++) {
+     for (let i = 1; false; i++) {

[NoCoverage] EqualityOperator
services/attendanceService.js:85:19
-     for (let i = 1; i < lines.length; i++) {
+     for (let i = 1; i <= lines.length; i++) {

[NoCoverage] EqualityOperator
services/attendanceService.js:85:19
-     for (let i = 1; i < lines.length; i++) {
+     for (let i = 1; i >= lines.length; i++) {

[NoCoverage] UpdateOperator
services/attendanceService.js:85:37
-     for (let i = 1; i < lines.length; i++) {
+     for (let i = 1; i < lines.length; i--) {

[NoCoverage] ConditionalExpression
services/attendanceService.js:95:9
-       if (!rStudent || !rCourse || !rDate || !rStatus) {
+       if (true) {

[NoCoverage] ConditionalExpression
services/attendanceService.js:95:9
-       if (!rStudent || !rCourse || !rDate || !rStatus) {
+       if (false) {

[NoCoverage] LogicalOperator
services/attendanceService.js:95:9
-       if (!rStudent || !rCourse || !rDate || !rStatus) {
+       if ((!rStudent || !rCourse || !rDate) && !rStatus) {

[NoCoverage] ConditionalExpression
services/attendanceService.js:95:9
-       if (!rStudent || !rCourse || !rDate || !rStatus) {
+       if (false || !rStatus) {

[NoCoverage] LogicalOperator
services/attendanceService.js:95:9
-       if (!rStudent || !rCourse || !rDate || !rStatus) {
+       if ((!rStudent || !rCourse) && !rDate || !rStatus) {

[NoCoverage] ConditionalExpression
services/attendanceService.js:95:9
-       if (!rStudent || !rCourse || !rDate || !rStatus) {
+       if (false || !rDate || !rStatus) {

[NoCoverage] LogicalOperator
services/attendanceService.js:95:9
-       if (!rStudent || !rCourse || !rDate || !rStatus) {
+       if (!rStudent && !rCourse || !rDate || !rStatus) {

[NoCoverage] BooleanLiteral
services/attendanceService.js:95:9
-       if (!rStudent || !rCourse || !rDate || !rStatus) {
+       if (rStudent || !rCourse || !rDate || !rStatus) {

[NoCoverage] BooleanLiteral
services/attendanceService.js:95:22
-       if (!rStudent || !rCourse || !rDate || !rStatus) {
+       if (!rStudent || rCourse || !rDate || !rStatus) {

[NoCoverage] BooleanLiteral
services/attendanceService.js:95:34
-       if (!rStudent || !rCourse || !rDate || !rStatus) {
+       if (!rStudent || !rCourse || rDate || !rStatus) {

[NoCoverage] BooleanLiteral
services/attendanceService.js:95:44
-       if (!rStudent || !rCourse || !rDate || !rStatus) {
+       if (!rStudent || !rCourse || !rDate || rStatus) {

[NoCoverage] BlockStatement
services/attendanceService.js:95:54
-       if (!rStudent || !rCourse || !rDate || !rStatus) {
-         errors.push(`line ${i+1}: missing required field(s)`);
-         continue;
-       }
+       if (!rStudent || !rCourse || !rDate || !rStatus) {}

[NoCoverage] StringLiteral
services/attendanceService.js:96:19
-         errors.push(`line ${i+1}: missing required field(s)`);
+         errors.push(``);

[NoCoverage] ArithmeticOperator
services/attendanceService.js:96:27
-         errors.push(`line ${i+1}: missing required field(s)`);
+         errors.push(`line ${i - 1}: missing required field(s)`);

[NoCoverage] MethodExpression
services/attendanceService.js:99:21
-       const dateStr = String(rDate).trim();
+       const dateStr = String(rDate);

[NoCoverage] MethodExpression
services/attendanceService.js:100:23
-       const statusStr = String(rStatus).trim().toLowerCase();
+       const statusStr = String(rStatus).trim().toUpperCase();

[NoCoverage] MethodExpression
services/attendanceService.js:100:23
-       const statusStr = String(rStatus).trim().toLowerCase();
+       const statusStr = String(rStatus).toLowerCase();

[NoCoverage] BooleanLiteral
services/attendanceService.js:102:9
-       if (!isValidDateISO(dateStr)) {
+       if (isValidDateISO(dateStr)) {

[NoCoverage] ConditionalExpression
services/attendanceService.js:102:9
-       if (!isValidDateISO(dateStr)) {
+       if (true) {

[NoCoverage] ConditionalExpression
services/attendanceService.js:102:9
-       if (!isValidDateISO(dateStr)) {
+       if (false) {

[NoCoverage] BlockStatement
services/attendanceService.js:102:35
-       if (!isValidDateISO(dateStr)) {
-         errors.push(`line ${i+1}: invalid date '${dateStr}'`);
-         continue;
-       }
+       if (!isValidDateISO(dateStr)) {}

[NoCoverage] StringLiteral
services/attendanceService.js:103:19
-         errors.push(`line ${i+1}: invalid date '${dateStr}'`);
+         errors.push(``);

[NoCoverage] ArithmeticOperator
services/attendanceService.js:103:27
-         errors.push(`line ${i+1}: invalid date '${dateStr}'`);
+         errors.push(`line ${i - 1}: invalid date '${dateStr}'`);

[NoCoverage] ArrayDeclaration
services/attendanceService.js:108:21
-       const allowed = ['present', 'absent'];
+       const allowed = [];

[NoCoverage] StringLiteral
services/attendanceService.js:108:22
-       const allowed = ['present', 'absent'];
+       const allowed = ["", 'absent'];

[NoCoverage] StringLiteral
services/attendanceService.js:108:33
-       const allowed = ['present', 'absent'];
+       const allowed = ['present', ""];

[NoCoverage] MethodExpression
services/attendanceService.js:109:24
-       const normStatus = statusStr.toLowerCase();
+       const normStatus = statusStr.toUpperCase();

[NoCoverage] BooleanLiteral
services/attendanceService.js:110:9
-       if (!allowed.includes(normStatus)) {
+       if (allowed.includes(normStatus)) {

[NoCoverage] ConditionalExpression
services/attendanceService.js:110:9
-       if (!allowed.includes(normStatus)) {
+       if (true) {

[NoCoverage] ConditionalExpression
services/attendanceService.js:110:9
-       if (!allowed.includes(normStatus)) {
+       if (false) {

[NoCoverage] BlockStatement
services/attendanceService.js:110:40
-       if (!allowed.includes(normStatus)) {
-         // don't hard-fail — tests accept either error or unknown returned; we choose to error
-         errors.push(`line ${i+1}: invalid status '${statusStr}'`);
-         continue;
-       }
+       if (!allowed.includes(normStatus)) {}

[NoCoverage] StringLiteral
services/attendanceService.js:112:19
-         errors.push(`line ${i+1}: invalid status '${statusStr}'`);
+         errors.push(``);

[NoCoverage] ArithmeticOperator
services/attendanceService.js:112:27
-         errors.push(`line ${i+1}: invalid status '${statusStr}'`);
+         errors.push(`line ${i - 1}: invalid status '${statusStr}'`);

[NoCoverage] ObjectLiteral
services/attendanceService.js:116:15
-       rows.push({
-         studentId: String(rStudent).trim(),
-         courseId: String(rCourse).trim(),
-         date: dateStr,
-         status: normStatus
-       });
+       rows.push({});

[NoCoverage] MethodExpression
services/attendanceService.js:117:18
-         studentId: String(rStudent).trim(),
+         studentId: String(rStudent),

[NoCoverage] MethodExpression
services/attendanceService.js:118:17
-         courseId: String(rCourse).trim(),
+         courseId: String(rCourse),

[NoCoverage] ObjectLiteral
services/attendanceService.js:124:10
-     return { rows, errors };
+     return {};

[NoCoverage] BlockStatement
services/attendanceService.js:137:22
-       if (ch === '"' ) {
-         // handle double double-quotes inside quotes -> produce a single quote char
-         if (inQuotes && i + 1 < line.length && line[i+1] === '"') {
-           cur += '"';
-           i++;
-         } else {
-           inQuotes = !inQuotes;
-         }
-       } else if (ch === ',' && !inQuotes) {
+       if (ch === '"' ) {} else if (ch === ',' && !inQuotes) {

[NoCoverage] ConditionalExpression
services/attendanceService.js:139:11
-         if (inQuotes && i + 1 < line.length && line[i+1] === '"') {
+         if (true) {

[NoCoverage] ConditionalExpression
services/attendanceService.js:139:11
-         if (inQuotes && i + 1 < line.length && line[i+1] === '"') {
+         if (false) {

[NoCoverage] LogicalOperator
services/attendanceService.js:139:11
-         if (inQuotes && i + 1 < line.length && line[i+1] === '"') {
+         if (inQuotes && i + 1 < line.length || line[i + 1] === '"') {

[NoCoverage] ConditionalExpression
services/attendanceService.js:139:11
-         if (inQuotes && i + 1 < line.length && line[i+1] === '"') {
+         if (true && line[i+1] === '"') {

[NoCoverage] LogicalOperator
services/attendanceService.js:139:11
-         if (inQuotes && i + 1 < line.length && line[i+1] === '"') {
+         if (inQuotes || i + 1 < line.length && line[i+1] === '"') {

[NoCoverage] ConditionalExpression
services/attendanceService.js:139:23
-         if (inQuotes && i + 1 < line.length && line[i+1] === '"') {
+         if (inQuotes && true && line[i+1] === '"') {

[NoCoverage] EqualityOperator
services/attendanceService.js:139:23
-         if (inQuotes && i + 1 < line.length && line[i+1] === '"') {
+         if (inQuotes && i + 1 <= line.length && line[i+1] === '"') {

[NoCoverage] EqualityOperator
services/attendanceService.js:139:23
-         if (inQuotes && i + 1 < line.length && line[i+1] === '"') {
+         if (inQuotes && i + 1 >= line.length && line[i+1] === '"') {

[NoCoverage] ArithmeticOperator
services/attendanceService.js:139:23
-         if (inQuotes && i + 1 < line.length && line[i+1] === '"') {
+         if (inQuotes && i - 1 < line.length && line[i+1] === '"') {

[NoCoverage] ConditionalExpression
services/attendanceService.js:139:46
-         if (inQuotes && i + 1 < line.length && line[i+1] === '"') {
+         if (inQuotes && i + 1 < line.length && true) {

[NoCoverage] EqualityOperator
services/attendanceService.js:139:46
-         if (inQuotes && i + 1 < line.length && line[i+1] === '"') {
+         if (inQuotes && i + 1 < line.length && line[i + 1] !== '"') {

[NoCoverage] ArithmeticOperator
services/attendanceService.js:139:51
-         if (inQuotes && i + 1 < line.length && line[i+1] === '"') {
+         if (inQuotes && i + 1 < line.length && line[i - 1] === '"') {

[NoCoverage] StringLiteral
services/attendanceService.js:139:60
-         if (inQuotes && i + 1 < line.length && line[i+1] === '"') {
+         if (inQuotes && i + 1 < line.length && line[i+1] === "") {

[NoCoverage] BlockStatement
services/attendanceService.js:139:65
-         if (inQuotes && i + 1 < line.length && line[i+1] === '"') {
-           cur += '"';
-           i++;
-         } else {
+         if (inQuotes && i + 1 < line.length && line[i+1] === '"') {} else {

[NoCoverage] StringLiteral
services/attendanceService.js:140:16
-           cur += '"';
+           cur += "";

[NoCoverage] UpdateOperator
services/attendanceService.js:141:9
-           i++;
+           i--;

[NoCoverage] BlockStatement
services/attendanceService.js:142:14
-         } else {
-           inQuotes = !inQuotes;
-         }
+         } else {}

[NoCoverage] BooleanLiteral
services/attendanceService.js:143:20
-           inQuotes = !inQuotes;
+           inQuotes = inQuotes;

[NoCoverage] StringLiteral
services/attendanceService.js:172:63
-   function markStatus(rows, studentId, courseId, date, status = 'present', force = false) {
+   function markStatus(rows, studentId, courseId, date, status = "", force = false) {

[NoCoverage] BooleanLiteral
services/attendanceService.js:172:82
-   function markStatus(rows, studentId, courseId, date, status = 'present', force = false) {
+   function markStatus(rows, studentId, courseId, date, status = 'present', force = true) {

[NoCoverage] StringLiteral
services/attendanceService.js:173:57
-     if (!studentId || !courseId || !date) throw new Error('studentId, courseId and date required');
+     if (!studentId || !courseId || !date) throw new Error("");

[NoCoverage] StringLiteral
services/attendanceService.js:174:46
-     if (!isValidDateISO(date)) throw new Error('invalid date');
+     if (!isValidDateISO(date)) throw new Error("");

[NoCoverage] StringLiteral
services/attendanceService.js:177:54
-     if (!allowed.includes(normStatus)) throw new Error('invalid status');
+     if (!allowed.includes(normStatus)) throw new Error("");

[NoCoverage] ArrayDeclaration
services/attendanceService.js:223:57
-   function findMissingDates(rows, studentId, datesArray = []) {
+   function findMissingDates(rows, studentId, datesArray = ["Stryker was here"]) {

[NoCoverage] BlockStatement
services/attendanceService.js:254:16
-           } else {
-             curStreak = 1;
-           }
+           } else {}

[Survived] ConditionalExpression
services/attendanceService.js:6:9
-       id: row.id === undefined ? null : row.id,
+       id: false ? null : row.id,
Tests ran:
    attendanceService - full tests row mapping and date utils rowToAttendance handles null and objects

[Survived] ConditionalExpression
services/attendanceService.js:7:16
-       studentId: row.studentId == null ? '' : String(row.studentId),
+       studentId: true ? '' : String(row.studentId),
Tests ran:
    attendanceService - full tests row mapping and date utils rowToAttendance handles null and objects

[Survived] EqualityOperator
services/attendanceService.js:7:16
-       studentId: row.studentId == null ? '' : String(row.studentId),
+       studentId: row.studentId != null ? '' : String(row.studentId),
Tests ran:
    attendanceService - full tests row mapping and date utils rowToAttendance handles null and objects

[Survived] ConditionalExpression
services/attendanceService.js:7:16
-       studentId: row.studentId == null ? '' : String(row.studentId),
+       studentId: false ? '' : String(row.studentId),
Tests ran:
    attendanceService - full tests row mapping and date utils rowToAttendance handles null and objects

[Survived] ConditionalExpression
services/attendanceService.js:8:15
-       courseId: row.courseId == null ? '' : String(row.courseId),
+       courseId: false ? '' : String(row.courseId),
Tests ran:
    attendanceService - full tests row mapping and date utils rowToAttendance handles null and objects

[Survived] ConditionalExpression
services/attendanceService.js:8:15
-       courseId: row.courseId == null ? '' : String(row.courseId),
+       courseId: true ? '' : String(row.courseId),
Tests ran:
    attendanceService - full tests row mapping and date utils rowToAttendance handles null and objects

[Survived] ConditionalExpression
services/attendanceService.js:9:11
-       date: row.date == null ? '' : String(row.date),
+       date: true ? '' : String(row.date),
Tests ran:
    attendanceService - full tests row mapping and date utils rowToAttendance handles null and objects

[Survived] EqualityOperator
services/attendanceService.js:8:15
-       courseId: row.courseId == null ? '' : String(row.courseId),
+       courseId: row.courseId != null ? '' : String(row.courseId),
Tests ran:
    attendanceService - full tests row mapping and date utils rowToAttendance handles null and objects

[Survived] ConditionalExpression
services/attendanceService.js:9:11
-       date: row.date == null ? '' : String(row.date),
+       date: false ? '' : String(row.date),
Tests ran:
    attendanceService - full tests row mapping and date utils rowToAttendance handles null and objects

[Survived] EqualityOperator
services/attendanceService.js:9:11
-       date: row.date == null ? '' : String(row.date),
+       date: row.date != null ? '' : String(row.date),
Tests ran:
    attendanceService - full tests row mapping and date utils rowToAttendance handles null and objects

[Survived] ConditionalExpression
services/attendanceService.js:10:13
-       status: row.status == null ? '' : String(row.status).toLowerCase()
+       status: true ? '' : String(row.status).toLowerCase()
Tests ran:
    attendanceService - full tests row mapping and date utils rowToAttendance handles null and objects

[Survived] ConditionalExpression
services/attendanceService.js:10:13
-       status: row.status == null ? '' : String(row.status).toLowerCase()
+       status: false ? '' : String(row.status).toLowerCase()
Tests ran:
    attendanceService - full tests row mapping and date utils rowToAttendance handles null and objects

[Survived] MethodExpression
services/attendanceService.js:10:39
-       status: row.status == null ? '' : String(row.status).toLowerCase()
+       status: row.status == null ? '' : String(row.status).toUpperCase()
Tests ran:
    attendanceService - full tests row mapping and date utils rowToAttendance handles null and objects

[Survived] EqualityOperator
services/attendanceService.js:10:13
-       status: row.status == null ? '' : String(row.status).toLowerCase()
+       status: row.status != null ? '' : String(row.status).toLowerCase()
Tests ran:
    attendanceService - full tests row mapping and date utils rowToAttendance handles null and objects

[Survived] LogicalOperator
services/attendanceService.js:18:7
-     if (!s || typeof s !== 'string') return false;
+     if (!s && typeof s !== 'string') return false;
Tests ran:
    attendanceService - full tests row mapping and date utils isValidDateISO
    attendanceService - full tests row mapping and date utils dateRange inclusive
    attendanceService - full tests markStatus insert new row
  and 3 more tests!

[Survived] ConditionalExpression
services/attendanceService.js:18:7
-     if (!s || typeof s !== 'string') return false;
+     if (false) return false;
Tests ran:
    attendanceService - full tests row mapping and date utils isValidDateISO
    attendanceService - full tests row mapping and date utils dateRange inclusive
    attendanceService - full tests markStatus insert new row
  and 3 more tests!

[Survived] ConditionalExpression
services/attendanceService.js:18:13
-     if (!s || typeof s !== 'string') return false;
+     if (!s || false) return false;
Tests ran:
    attendanceService - full tests row mapping and date utils isValidDateISO
    attendanceService - full tests row mapping and date utils dateRange inclusive
    attendanceService - full tests markStatus insert new row
  and 3 more tests!

[Survived] Regex
services/attendanceService.js:19:21
-     const m = s.match(/^(\d{4})-(\d{2})-(\d{2})$/);
+     const m = s.match(/(\d{4})-(\d{2})-(\d{2})$/);
Tests ran:
    attendanceService - full tests row mapping and date utils isValidDateISO
    attendanceService - full tests row mapping and date utils dateRange inclusive
    attendanceService - full tests markStatus insert new row
  and 3 more tests!

[Survived] Regex
services/attendanceService.js:19:21
-     const m = s.match(/^(\d{4})-(\d{2})-(\d{2})$/);
+     const m = s.match(/^(\d{4})-(\d{2})-(\d{2})/);
Tests ran:
    attendanceService - full tests row mapping and date utils isValidDateISO
    attendanceService - full tests row mapping and date utils dateRange inclusive
    attendanceService - full tests markStatus insert new row
  and 3 more tests!

[Survived] ConditionalExpression
services/attendanceService.js:23:7
-     if (month < 1 || month > 12 || day < 1 || day > 31) return false;
+     if (false) return false;
Tests ran:
    attendanceService - full tests row mapping and date utils isValidDateISO
    attendanceService - full tests row mapping and date utils dateRange inclusive
    attendanceService - full tests markStatus insert new row
  and 3 more tests!

[Survived] LogicalOperator
services/attendanceService.js:23:7
-     if (month < 1 || month > 12 || day < 1 || day > 31) return false;
+     if ((month < 1 || month > 12 || day < 1) && day > 31) return false;
Tests ran:
    attendanceService - full tests row mapping and date utils isValidDateISO
    attendanceService - full tests row mapping and date utils dateRange inclusive
    attendanceService - full tests markStatus insert new row
  and 3 more tests!

[Survived] ConditionalExpression
services/attendanceService.js:23:7
-     if (month < 1 || month > 12 || day < 1 || day > 31) return false;
+     if (false || day > 31) return false;
Tests ran:
    attendanceService - full tests row mapping and date utils isValidDateISO
    attendanceService - full tests row mapping and date utils dateRange inclusive
    attendanceService - full tests markStatus insert new row
  and 3 more tests!

[Survived] LogicalOperator
services/attendanceService.js:23:7
-     if (month < 1 || month > 12 || day < 1 || day > 31) return false;
+     if ((month < 1 || month > 12) && day < 1 || day > 31) return false;
Tests ran:
    attendanceService - full tests row mapping and date utils isValidDateISO
    attendanceService - full tests row mapping and date utils dateRange inclusive
    attendanceService - full tests markStatus insert new row
  and 3 more tests!

[Survived] ConditionalExpression
services/attendanceService.js:23:7
-     if (month < 1 || month > 12 || day < 1 || day > 31) return false;
+     if (false || day < 1 || day > 31) return false;
Tests ran:
    attendanceService - full tests row mapping and date utils isValidDateISO
    attendanceService - full tests row mapping and date utils dateRange inclusive
    attendanceService - full tests markStatus insert new row
  and 3 more tests!

[Survived] ConditionalExpression
services/attendanceService.js:23:7
-     if (month < 1 || month > 12 || day < 1 || day > 31) return false;
+     if (false || month > 12 || day < 1 || day > 31) return false;
Tests ran:
    attendanceService - full tests row mapping and date utils isValidDateISO
    attendanceService - full tests row mapping and date utils dateRange inclusive
    attendanceService - full tests markStatus insert new row
  and 3 more tests!

[Survived] LogicalOperator
services/attendanceService.js:23:7
-     if (month < 1 || month > 12 || day < 1 || day > 31) return false;
+     if (month < 1 && month > 12 || day < 1 || day > 31) return false;
Tests ran:
    attendanceService - full tests row mapping and date utils isValidDateISO
    attendanceService - full tests row mapping and date utils dateRange inclusive
    attendanceService - full tests markStatus insert new row
  and 3 more tests!

[Survived] EqualityOperator
services/attendanceService.js:23:7
-     if (month < 1 || month > 12 || day < 1 || day > 31) return false;
+     if (month <= 1 || month > 12 || day < 1 || day > 31) return false;
Tests ran:
    attendanceService - full tests row mapping and date utils isValidDateISO
    attendanceService - full tests row mapping and date utils dateRange inclusive
    attendanceService - full tests markStatus insert new row
  and 3 more tests!

[Survived] ConditionalExpression
services/attendanceService.js:23:20
-     if (month < 1 || month > 12 || day < 1 || day > 31) return false;
+     if (month < 1 || false || day < 1 || day > 31) return false;
Tests ran:
    attendanceService - full tests row mapping and date utils isValidDateISO
    attendanceService - full tests row mapping and date utils dateRange inclusive
    attendanceService - full tests markStatus insert new row
  and 3 more tests!

[Survived] EqualityOperator
services/attendanceService.js:23:20
-     if (month < 1 || month > 12 || day < 1 || day > 31) return false;
+     if (month < 1 || month >= 12 || day < 1 || day > 31) return false;
Tests ran:
    attendanceService - full tests row mapping and date utils isValidDateISO
    attendanceService - full tests row mapping and date utils dateRange inclusive
    attendanceService - full tests markStatus insert new row
  and 3 more tests!

[Survived] ConditionalExpression
services/attendanceService.js:23:34
-     if (month < 1 || month > 12 || day < 1 || day > 31) return false;
+     if (month < 1 || month > 12 || false || day > 31) return false;
Tests ran:
    attendanceService - full tests row mapping and date utils isValidDateISO
    attendanceService - full tests row mapping and date utils dateRange inclusive
    attendanceService - full tests markStatus insert new row
  and 3 more tests!

[Survived] ConditionalExpression
services/attendanceService.js:23:45
-     if (month < 1 || month > 12 || day < 1 || day > 31) return false;
+     if (month < 1 || month > 12 || day < 1 || false) return false;
Tests ran:
    attendanceService - full tests row mapping and date utils isValidDateISO
    attendanceService - full tests row mapping and date utils dateRange inclusive
    attendanceService - full tests markStatus insert new row
  and 3 more tests!

[Survived] EqualityOperator
services/attendanceService.js:23:45
-     if (month < 1 || month > 12 || day < 1 || day > 31) return false;
+     if (month < 1 || month > 12 || day < 1 || day >= 31) return false;
Tests ran:
    attendanceService - full tests row mapping and date utils isValidDateISO
    attendanceService - full tests row mapping and date utils dateRange inclusive
    attendanceService - full tests markStatus insert new row
  and 3 more tests!

[Survived] StringLiteral
services/attendanceService.js:25:52
-     const d = new Date(`${year.toString().padStart(4,'0')}-${String(month).padStart(2,'0')}-${String(day).padStart(2,'0')}T00:00:00Z`);
+     const d = new Date(`${year.toString().padStart(4,"")}-${String(month).padStart(2,'0')}-${String(day).padStart(2,'0')}T00:00:00Z`);
Tests ran:
    attendanceService - full tests row mapping and date utils isValidDateISO
    attendanceService - full tests row mapping and date utils dateRange inclusive
    attendanceService - full tests markStatus insert new row
  and 3 more tests!

[Survived] ConditionalExpression
services/attendanceService.js:26:7
-     if (Number.isNaN(d.getTime())) return false;
+     if (false) return false;
Tests ran:
    attendanceService - full tests row mapping and date utils isValidDateISO
    attendanceService - full tests row mapping and date utils dateRange inclusive
    attendanceService - full tests markStatus insert new row
  and 3 more tests!

[Survived] LogicalOperator
services/attendanceService.js:29:10
-     return uy === year && um === month && ud === day;
+     return uy === year && um === month || ud === day;
Tests ran:
    attendanceService - full tests row mapping and date utils isValidDateISO
    attendanceService - full tests row mapping and date utils dateRange inclusive
    attendanceService - full tests markStatus insert new row
  and 3 more tests!

[Survived] ConditionalExpression
services/attendanceService.js:29:10
-     return uy === year && um === month && ud === day;
+     return true && ud === day;
Tests ran:
    attendanceService - full tests row mapping and date utils isValidDateISO
    attendanceService - full tests row mapping and date utils dateRange inclusive
    attendanceService - full tests markStatus insert new row
  and 3 more tests!
