[Survived] ConditionalExpression
services/attendanceService.js:29:10
-     return uy === year && um === month && ud === day;
+     return true && um === month && ud === day;
Tests ran:
    attendanceService - full tests row mapping and date utils isValidDateISO
    attendanceService - full tests row mapping and date utils dateRange inclusive
    attendanceService - full tests markStatus insert new row
  and 3 more tests!

[Survived] LogicalOperator
services/attendanceService.js:29:10
-     return uy === year && um === month && ud === day;
+     return uy === year || um === month && ud === day;
Tests ran:
    attendanceService - full tests row mapping and date utils isValidDateISO
    attendanceService - full tests row mapping and date utils dateRange inclusive
    attendanceService - full tests markStatus insert new row
  and 3 more tests!

[Survived] ConditionalExpression
services/attendanceService.js:29:25
-     return uy === year && um === month && ud === day;
+     return uy === year && true && ud === day;
Tests ran:
    attendanceService - full tests row mapping and date utils isValidDateISO
    attendanceService - full tests row mapping and date utils dateRange inclusive
    attendanceService - full tests markStatus insert new row
  and 3 more tests!

[Survived] ConditionalExpression
services/attendanceService.js:29:41
-     return uy === year && um === month && ud === day;
+     return uy === year && um === month && true;
Tests ran:
    attendanceService - full tests row mapping and date utils isValidDateISO
    attendanceService - full tests row mapping and date utils dateRange inclusive
    attendanceService - full tests markStatus insert new row
  and 3 more tests!

[Survived] ConditionalExpression
services/attendanceService.js:36:7
-     if (!isValidDateISO(from) || !isValidDateISO(to)) return [];
+     if (false) return [];
Tests ran:
    attendanceService - full tests row mapping and date utils dateRange inclusive
    attendanceService - full tests summaries & streaks consecutiveAbsences

[Survived] LogicalOperator
services/attendanceService.js:36:7
-     if (!isValidDateISO(from) || !isValidDateISO(to)) return [];
+     if (!isValidDateISO(from) && !isValidDateISO(to)) return [];
Tests ran:
    attendanceService - full tests row mapping and date utils dateRange inclusive
    attendanceService - full tests summaries & streaks consecutiveAbsences

[Survived] StringLiteral
services/attendanceService.js:37:33
-     const start = new Date(from + 'T00:00:00Z');
+     const start = new Date(from + "");
Tests ran:
    attendanceService - full tests row mapping and date utils dateRange inclusive
    attendanceService - full tests summaries & streaks consecutiveAbsences

[Survived] StringLiteral
services/attendanceService.js:38:29
-     const end = new Date(to + 'T00:00:00Z');
+     const end = new Date(to + "");
Tests ran:
    attendanceService - full tests row mapping and date utils dateRange inclusive
    attendanceService - full tests summaries & streaks consecutiveAbsences

[Survived] ConditionalExpression
services/attendanceService.js:39:7
-     if (start > end) return [];
+     if (false) return [];
Tests ran:
    attendanceService - full tests row mapping and date utils dateRange inclusive
    attendanceService - full tests summaries & streaks consecutiveAbsences

[Survived] EqualityOperator
services/attendanceService.js:39:7
-     if (start > end) return [];
+     if (start >= end) return [];
Tests ran:
    attendanceService - full tests row mapping and date utils dateRange inclusive
    attendanceService - full tests summaries & streaks consecutiveAbsences

[Survived] StringLiteral
services/attendanceService.js:43:55
-       const m = String(d.getUTCMonth() + 1).padStart(2, '0');
+       const m = String(d.getUTCMonth() + 1).padStart(2, "");
Tests ran:
    attendanceService - full tests row mapping and date utils dateRange inclusive
    attendanceService - full tests summaries & streaks consecutiveAbsences

[Survived] ArrayDeclaration
services/attendanceService.js:59:16
-     const rows = [];
+     const rows = ["Stryker was here"];
Tests ran:
    attendanceService - full tests CSV parsing and percentage parseCsv returns parsed rows and errors

[Survived] ArrayDeclaration
services/attendanceService.js:58:18
-     const errors = [];
+     const errors = ["Stryker was here"];
Tests ran:
    attendanceService - full tests CSV parsing and percentage parseCsv returns parsed rows and errors

[Survived] ConditionalExpression
services/attendanceService.js:60:7
-     if (!csvText || !csvText.trim()) {
+     if (true) {
Tests ran:
    attendanceService - full tests CSV parsing and percentage parseCsv returns parsed rows and errors

[Survived] ConditionalExpression
services/attendanceService.js:60:7
-     if (!csvText || !csvText.trim()) {
+     if (false) {
Tests ran:
    attendanceService - full tests CSV parsing and percentage parseCsv returns parsed rows and errors

[Survived] LogicalOperator
services/attendanceService.js:60:7
-     if (!csvText || !csvText.trim()) {
+     if (!csvText && !csvText.trim()) {
Tests ran:
    attendanceService - full tests CSV parsing and percentage parseCsv returns parsed rows and errors

[Survived] BooleanLiteral
services/attendanceService.js:60:7
-     if (!csvText || !csvText.trim()) {
+     if (csvText || !csvText.trim()) {
Tests ran:
    attendanceService - full tests CSV parsing and percentage parseCsv returns parsed rows and errors

[Survived] BooleanLiteral
services/attendanceService.js:60:19
-     if (!csvText || !csvText.trim()) {
+     if (!csvText || csvText.trim()) {
Tests ran:
    attendanceService - full tests CSV parsing and percentage parseCsv returns parsed rows and errors

[Survived] MethodExpression
services/attendanceService.js:60:20
-     if (!csvText || !csvText.trim()) {
+     if (!csvText || !csvText) {
Tests ran:
    attendanceService - full tests CSV parsing and percentage parseCsv returns parsed rows and errors

[Survived] Regex
services/attendanceService.js:64:31
-     const lines = csvText.split(/\r?\n/).map(l => l.trim()).filter(Boolean);
+     const lines = csvText.split(/\r\n/).map(l => l.trim()).filter(Boolean);
Tests ran:
    attendanceService - full tests CSV parsing and percentage parseCsv returns parsed rows and errors

[Survived] MethodExpression
services/attendanceService.js:64:17
-     const lines = csvText.split(/\r?\n/).map(l => l.trim()).filter(Boolean);
+     const lines = csvText.split(/\r?\n/).map(l => l.trim());
Tests ran:
    attendanceService - full tests CSV parsing and percentage parseCsv returns parsed rows and errors

[Survived] ArrowFunction
services/attendanceService.js:64:44
-     const lines = csvText.split(/\r?\n/).map(l => l.trim()).filter(Boolean);
+     const lines = csvText.split(/\r?\n/).map(() => undefined).filter(Boolean);
Tests ran:
    attendanceService - full tests CSV parsing and percentage parseCsv returns parsed rows and errors

[Survived] MethodExpression
services/attendanceService.js:64:49
-     const lines = csvText.split(/\r?\n/).map(l => l.trim()).filter(Boolean);
+     const lines = csvText.split(/\r?\n/).map(l => l).filter(Boolean);
Tests ran:
    attendanceService - full tests CSV parsing and percentage parseCsv returns parsed rows and errors

[Survived] ConditionalExpression
services/attendanceService.js:65:7
-     if (lines.length === 0) {
+     if (true) {
Tests ran:
    attendanceService - full tests CSV parsing and percentage parseCsv returns parsed rows and errors

[Survived] ConditionalExpression
services/attendanceService.js:65:7
-     if (lines.length === 0) {
+     if (false) {
Tests ran:
    attendanceService - full tests CSV parsing and percentage parseCsv returns parsed rows and errors

[Survived] EqualityOperator
services/attendanceService.js:65:7
-     if (lines.length === 0) {
+     if (lines.length !== 0) {
Tests ran:
    attendanceService - full tests CSV parsing and percentage parseCsv returns parsed rows and errors

[Survived] ArrowFunction
services/attendanceService.js:72:47
-     const header = splitCsvLine(headerLine).map(h => h.trim());
+     const header = splitCsvLine(headerLine).map(() => undefined);
Tests ran:
    attendanceService - full tests CSV parsing and percentage parseCsv returns parsed rows and errors

[Survived] MethodExpression
services/attendanceService.js:72:52
-     const header = splitCsvLine(headerLine).map(h => h.trim());
+     const header = splitCsvLine(headerLine).map(h => h);
Tests ran:
    attendanceService - full tests CSV parsing and percentage parseCsv returns parsed rows and errors

[Survived] ArrayDeclaration
services/attendanceService.js:73:20
-     const required = ['studentId', 'courseId', 'date', 'status'];
+     const required = [];
Tests ran:
    attendanceService - full tests CSV parsing and percentage parseCsv returns parsed rows and errors

[Survived] StringLiteral
services/attendanceService.js:73:21
-     const required = ['studentId', 'courseId', 'date', 'status'];
+     const required = ["", 'courseId', 'date', 'status'];
Tests ran:
    attendanceService - full tests CSV parsing and percentage parseCsv returns parsed rows and errors

[Survived] StringLiteral
services/attendanceService.js:73:34
-     const required = ['studentId', 'courseId', 'date', 'status'];
+     const required = ['studentId', "", 'date', 'status'];
Tests ran:
    attendanceService - full tests CSV parsing and percentage parseCsv returns parsed rows and errors

[Survived] StringLiteral
services/attendanceService.js:73:46
-     const required = ['studentId', 'courseId', 'date', 'status'];
+     const required = ['studentId', 'courseId', "", 'status'];
Tests ran:
    attendanceService - full tests CSV parsing and percentage parseCsv returns parsed rows and errors

[Survived] StringLiteral
services/attendanceService.js:73:54
-     const required = ['studentId', 'courseId', 'date', 'status'];
+     const required = ['studentId', 'courseId', 'date', ""];
Tests ran:
    attendanceService - full tests CSV parsing and percentage parseCsv returns parsed rows and errors

[Survived] MethodExpression
services/attendanceService.js:74:19
-     const missing = required.filter(r => !header.includes(r));
+     const missing = required;
Tests ran:
    attendanceService - full tests CSV parsing and percentage parseCsv returns parsed rows and errors

[Survived] ArrowFunction
services/attendanceService.js:74:35
-     const missing = required.filter(r => !header.includes(r));
+     const missing = required.filter(() => undefined);
Tests ran:
    attendanceService - full tests CSV parsing and percentage parseCsv returns parsed rows and errors

[Survived] BooleanLiteral
services/attendanceService.js:74:40
-     const missing = required.filter(r => !header.includes(r));
+     const missing = required.filter(r => header.includes(r));
Tests ran:
    attendanceService - full tests CSV parsing and percentage parseCsv returns parsed rows and errors

[Survived] ConditionalExpression
services/attendanceService.js:75:7
-     if (missing.length) {
+     if (true) {
Tests ran:
    attendanceService - full tests CSV parsing and percentage parseCsv returns parsed rows and errors

[Survived] ConditionalExpression
services/attendanceService.js:75:7
-     if (missing.length) {
+     if (false) {
Tests ran:
    attendanceService - full tests CSV parsing and percentage parseCsv returns parsed rows and errors

[Survived] BlockStatement
services/attendanceService.js:75:23
-     if (missing.length) {
-       errors.push(`csv header missing required columns: ${missing.join(',')}`);
-       return { rows: [], errors };
-     }
+     if (missing.length) {}
Tests ran:
    attendanceService - full tests CSV parsing and percentage parseCsv returns parsed rows and errors

[Survived] StringLiteral
services/attendanceService.js:76:17
-       errors.push(`csv header missing required columns: ${missing.join(',')}`);
+       errors.push(``);
Tests ran:
    attendanceService - full tests CSV parsing and percentage parseCsv returns parsed rows and errors

[Survived] StringLiteral
services/attendanceService.js:76:70
-       errors.push(`csv header missing required columns: ${missing.join(',')}`);
+       errors.push(`csv header missing required columns: ${missing.join("")}`);
Tests ran:
    attendanceService - full tests CSV parsing and percentage parseCsv returns parsed rows and errors

[Survived] ArrayDeclaration
services/attendanceService.js:77:20
-       return { rows: [], errors };
+       return { rows: ["Stryker was here"], errors };
Tests ran:
    attendanceService - full tests CSV parsing and percentage parseCsv returns parsed rows and errors

[Survived] ArrayDeclaration
services/attendanceService.js:132:15
-     const res = [];
+     const res = ["Stryker was here"];
Tests ran:
    attendanceService - full tests CSV parsing and percentage parseCsv returns parsed rows and errors

[Survived] StringLiteral
services/attendanceService.js:133:13
-     let cur = '';
+     let cur = "Stryker was here!";
Tests ran:
    attendanceService - full tests CSV parsing and percentage parseCsv returns parsed rows and errors

[Survived] BooleanLiteral
services/attendanceService.js:134:18
-     let inQuotes = false;
+     let inQuotes = true;
Tests ran:
    attendanceService - full tests CSV parsing and percentage parseCsv returns parsed rows and errors

[Survived] EqualityOperator
services/attendanceService.js:135:19
-     for (let i = 0; i < line.length; i++) {
+     for (let i = 0; i <= line.length; i++) {
Tests ran:
    attendanceService - full tests CSV parsing and percentage parseCsv returns parsed rows and errors

[Survived] ConditionalExpression
services/attendanceService.js:135:19
-     for (let i = 0; i < line.length; i++) {
+     for (let i = 0; false; i++) {
Tests ran:
    attendanceService - full tests CSV parsing and percentage parseCsv returns parsed rows and errors

[Survived] EqualityOperator
services/attendanceService.js:135:19
-     for (let i = 0; i < line.length; i++) {
+     for (let i = 0; i >= line.length; i++) {
Tests ran:
    attendanceService - full tests CSV parsing and percentage parseCsv returns parsed rows and errors

[Survived] BlockStatement
services/attendanceService.js:135:41
-     for (let i = 0; i < line.length; i++) {
-       const ch = line[i];
-       if (ch === '"' ) {
-         // handle double double-quotes inside quotes -> produce a single quote char
-         if (inQuotes && i + 1 < line.length && line[i+1] === '"') {
-           cur += '"';
-           i++;
-         } else {
-           inQuotes = !inQuotes;
-         }
-       } else if (ch === ',' && !inQuotes) {
-         res.push(cur);
-         cur = '';
-       } else {
-         cur += ch;
-       }
-     }
+     for (let i = 0; i < line.length; i++) {}
Tests ran:
    attendanceService - full tests CSV parsing and percentage parseCsv returns parsed rows and errors

[Survived] ConditionalExpression
services/attendanceService.js:137:9
-       if (ch === '"' ) {
+       if (true ) {
Tests ran:
    attendanceService - full tests CSV parsing and percentage parseCsv returns parsed rows and errors

[Survived] ConditionalExpression
services/attendanceService.js:137:9
-       if (ch === '"' ) {
+       if (false ) {
Tests ran:
    attendanceService - full tests CSV parsing and percentage parseCsv returns parsed rows and errors

[Survived] EqualityOperator
services/attendanceService.js:137:9
-       if (ch === '"' ) {
+       if (ch !== '"' ) {
Tests ran:
    attendanceService - full tests CSV parsing and percentage parseCsv returns parsed rows and errors

[Survived] StringLiteral
services/attendanceService.js:137:16
-       if (ch === '"' ) {
+       if (ch === "" ) {
Tests ran:
    attendanceService - full tests CSV parsing and percentage parseCsv returns parsed rows and errors

[Survived] ConditionalExpression
services/attendanceService.js:145:16
-       } else if (ch === ',' && !inQuotes) {
+       } else if (true) {
Tests ran:
    attendanceService - full tests CSV parsing and percentage parseCsv returns parsed rows and errors

[Survived] ConditionalExpression
services/attendanceService.js:145:16
-       } else if (ch === ',' && !inQuotes) {
+       } else if (false) {
Tests ran:
    attendanceService - full tests CSV parsing and percentage parseCsv returns parsed rows and errors

[Survived] LogicalOperator
services/attendanceService.js:145:16
-       } else if (ch === ',' && !inQuotes) {
+       } else if (ch === ',' || !inQuotes) {
Tests ran:
    attendanceService - full tests CSV parsing and percentage parseCsv returns parsed rows and errors

[Survived] ConditionalExpression
services/attendanceService.js:145:16
-       } else if (ch === ',' && !inQuotes) {
+       } else if (true && !inQuotes) {
Tests ran:
    attendanceService - full tests CSV parsing and percentage parseCsv returns parsed rows and errors

[Survived] EqualityOperator
services/attendanceService.js:145:16
-       } else if (ch === ',' && !inQuotes) {
+       } else if (ch !== ',' && !inQuotes) {
Tests ran:
    attendanceService - full tests CSV parsing and percentage parseCsv returns parsed rows and errors

[Survived] StringLiteral
services/attendanceService.js:145:23
-       } else if (ch === ',' && !inQuotes) {
+       } else if (ch === "" && !inQuotes) {
Tests ran:
    attendanceService - full tests CSV parsing and percentage parseCsv returns parsed rows and errors

[Survived] BooleanLiteral
services/attendanceService.js:145:30
-       } else if (ch === ',' && !inQuotes) {
+       } else if (ch === ',' && inQuotes) {
Tests ran:
    attendanceService - full tests CSV parsing and percentage parseCsv returns parsed rows and errors

[Survived] BlockStatement
services/attendanceService.js:145:41
-       } else if (ch === ',' && !inQuotes) {
-         res.push(cur);
-         cur = '';
-       } else {
+       } else if (ch === ',' && !inQuotes) {} else {
Tests ran:
    attendanceService - full tests CSV parsing and percentage parseCsv returns parsed rows and errors

[Survived] BlockStatement
services/attendanceService.js:148:12
-       } else {
-         cur += ch;
-       }
+       } else {}
Tests ran:
    attendanceService - full tests CSV parsing and percentage parseCsv returns parsed rows and errors

[Survived] StringLiteral
services/attendanceService.js:147:13
-         cur = '';
+         cur = "Stryker was here!";
Tests ran:
    attendanceService - full tests CSV parsing and percentage parseCsv returns parsed rows and errors

[Survived] LogicalOperator
services/attendanceService.js:160:7
-     if (!totalCount || totalCount === 0) return 0;
+     if (!totalCount && totalCount === 0) return 0;
Tests ran:
    attendanceService - full tests CSV parsing and percentage calculateAttendancePercentage
    attendanceService - full tests summaries & streaks summarizeStudent & summarizeCourse

[Survived] ConditionalExpression
services/attendanceService.js:160:22
-     if (!totalCount || totalCount === 0) return 0;
+     if (!totalCount || false) return 0;
Tests ran:
    attendanceService - full tests CSV parsing and percentage calculateAttendancePercentage
    attendanceService - full tests summaries & streaks summarizeStudent & summarizeCourse

[Survived] ConditionalExpression
services/attendanceService.js:173:7
-     if (!studentId || !courseId || !date) throw new Error('studentId, courseId and date required');
+     if (false) throw new Error('studentId, courseId and date required');
Tests ran:
    attendanceService - full tests markStatus insert new row
    attendanceService - full tests markStatus skip existing when force=false
    attendanceService - full tests markStatus update when force=true

[Survived] LogicalOperator
services/attendanceService.js:173:7
-     if (!studentId || !courseId || !date) throw new Error('studentId, courseId and date required');
+     if ((!studentId || !courseId) && !date) throw new Error('studentId, courseId and date required');
Tests ran:
    attendanceService - full tests markStatus insert new row
    attendanceService - full tests markStatus skip existing when force=false
    attendanceService - full tests markStatus update when force=true

[Survived] ConditionalExpression
services/attendanceService.js:173:7
-     if (!studentId || !courseId || !date) throw new Error('studentId, courseId and date required');
+     if (false || !date) throw new Error('studentId, courseId and date required');
Tests ran:
    attendanceService - full tests markStatus insert new row
    attendanceService - full tests markStatus skip existing when force=false
    attendanceService - full tests markStatus update when force=true

[Survived] LogicalOperator
services/attendanceService.js:173:7
-     if (!studentId || !courseId || !date) throw new Error('studentId, courseId and date required');
+     if (!studentId && !courseId || !date) throw new Error('studentId, courseId and date required');
Tests ran:
    attendanceService - full tests markStatus insert new row
    attendanceService - full tests markStatus skip existing when force=false
    attendanceService - full tests markStatus update when force=true

[Survived] ConditionalExpression
services/attendanceService.js:174:7
-     if (!isValidDateISO(date)) throw new Error('invalid date');
+     if (false) throw new Error('invalid date');
Tests ran:
    attendanceService - full tests markStatus insert new row
    attendanceService - full tests markStatus skip existing when force=false
    attendanceService - full tests markStatus update when force=true

[Survived] ConditionalExpression
services/attendanceService.js:177:7
-     if (!allowed.includes(normStatus)) throw new Error('invalid status');
+     if (false) throw new Error('invalid status');
Tests ran:
    attendanceService - full tests markStatus insert new row
    attendanceService - full tests markStatus skip existing when force=false
    attendanceService - full tests markStatus update when force=true

[Survived] ConditionalExpression
services/attendanceService.js:180:45
-     const existingIndex = rows.findIndex(r => r.studentId === studentId && r.courseId === courseId && r.date === date);
+     const existingIndex = rows.findIndex(r => true);
Tests ran:
    attendanceService - full tests markStatus skip existing when force=false
    attendanceService - full tests markStatus update when force=true

[Survived] LogicalOperator
services/attendanceService.js:180:45
-     const existingIndex = rows.findIndex(r => r.studentId === studentId && r.courseId === courseId && r.date === date);
+     const existingIndex = rows.findIndex(r => r.studentId === studentId && r.courseId === courseId || r.date === date);
Tests ran:
    attendanceService - full tests markStatus skip existing when force=false
    attendanceService - full tests markStatus update when force=true

[Survived] LogicalOperator
services/attendanceService.js:180:45
-     const existingIndex = rows.findIndex(r => r.studentId === studentId && r.courseId === courseId && r.date === date);
+     const existingIndex = rows.findIndex(r => r.studentId === studentId || r.courseId === courseId && r.date === date);
Tests ran:
    attendanceService - full tests markStatus skip existing when force=false
    attendanceService - full tests markStatus update when force=true

[Survived] ConditionalExpression
services/attendanceService.js:180:45
-     const existingIndex = rows.findIndex(r => r.studentId === studentId && r.courseId === courseId && r.date === date);
+     const existingIndex = rows.findIndex(r => true && r.date === date);
Tests ran:
    attendanceService - full tests markStatus skip existing when force=false
    attendanceService - full tests markStatus update when force=true

[Survived] ConditionalExpression
services/attendanceService.js:180:45
-     const existingIndex = rows.findIndex(r => r.studentId === studentId && r.courseId === courseId && r.date === date);
+     const existingIndex = rows.findIndex(r => true && r.courseId === courseId && r.date === date);
Tests ran:
    attendanceService - full tests markStatus skip existing when force=false
    attendanceService - full tests markStatus update when force=true

[Survived] ConditionalExpression
services/attendanceService.js:180:74
-     const existingIndex = rows.findIndex(r => r.studentId === studentId && r.courseId === courseId && r.date === date);
+     const existingIndex = rows.findIndex(r => r.studentId === studentId && true && r.date === date);
Tests ran:
    attendanceService - full tests markStatus skip existing when force=false
    attendanceService - full tests markStatus update when force=true

[Survived] ConditionalExpression
services/attendanceService.js:180:101
-     const existingIndex = rows.findIndex(r => r.studentId === studentId && r.courseId === courseId && r.date === date);
+     const existingIndex = rows.findIndex(r => r.studentId === studentId && r.courseId === courseId && true);
Tests ran:
    attendanceService - full tests markStatus skip existing when force=false
    attendanceService - full tests markStatus update when force=true

[Survived] ObjectLiteral
services/attendanceService.js:182:20
-       const newRow = { studentId, courseId, date, status: normStatus };
+       const newRow = {};
Tests ran:
    attendanceService - full tests markStatus insert new row

[Survived] EqualityOperator
services/attendanceService.js:202:40
-     const present = filtered.filter(r => String(r.status).toLowerCase() === 'present').length;
+     const present = filtered.filter(r => String(r.status).toLowerCase() !== 'present').length;
Tests ran:
    attendanceService - full tests summaries & streaks summarizeStudent & summarizeCourse

[Survived] ArithmeticOperator
services/attendanceService.js:203:18
-     const absent = total - present;
+     const absent = total + present;
Tests ran:
    attendanceService - full tests summaries & streaks summarizeStudent & summarizeCourse

[Survived] MethodExpression
services/attendanceService.js:212:20
-     const filtered = rows.filter(r => r.courseId === courseId);
+     const filtered = rows;
Tests ran:
    attendanceService - full tests summaries & streaks summarizeStudent & summarizeCourse

[Survived] ConditionalExpression
services/attendanceService.js:212:37
-     const filtered = rows.filter(r => r.courseId === courseId);
+     const filtered = rows.filter(r => true);
Tests ran:
    attendanceService - full tests summaries & streaks summarizeStudent & summarizeCourse

[Survived] ArithmeticOperator
services/attendanceService.js:215:18
-     const absent = total - present;
+     const absent = total + present;
Tests ran:
    attendanceService - full tests summaries & streaks summarizeStudent & summarizeCourse

[Survived] MethodExpression
services/attendanceService.js:224:32
-     const presentDates = new Set(rows.filter(r => r.studentId === studentId).map(r => r.date));
+     const presentDates = new Set(rows.map(r => r.date));
Tests ran:
    attendanceService - full tests summaries & streaks findMissingDates

[Survived] ConditionalExpression
services/attendanceService.js:224:49
-     const presentDates = new Set(rows.filter(r => r.studentId === studentId).map(r => r.date));
+     const presentDates = new Set(rows.filter(r => true).map(r => r.date));
Tests ran:
    attendanceService - full tests summaries & streaks findMissingDates

[Survived] MethodExpression
services/attendanceService.js:233:23
-     const studentRows = rows.filter(r => r.studentId === studentId && isValidDateISO(r.date));
+     const studentRows = rows;
Tests ran:
    attendanceService - full tests summaries & streaks consecutiveAbsences

[Survived] ConditionalExpression
services/attendanceService.js:233:40
-     const studentRows = rows.filter(r => r.studentId === studentId && isValidDateISO(r.date));
+     const studentRows = rows.filter(r => true);
Tests ran:
    attendanceService - full tests summaries & streaks consecutiveAbsences

[Survived] LogicalOperator
services/attendanceService.js:233:40
-     const studentRows = rows.filter(r => r.studentId === studentId && isValidDateISO(r.date));
+     const studentRows = rows.filter(r => r.studentId === studentId || isValidDateISO(r.date));
Tests ran:
    attendanceService - full tests summaries & streaks consecutiveAbsences

[Survived] ConditionalExpression
services/attendanceService.js:233:40
-     const studentRows = rows.filter(r => r.studentId === studentId && isValidDateISO(r.date));
+     const studentRows = rows.filter(r => true && isValidDateISO(r.date));
Tests ran:
    attendanceService - full tests summaries & streaks consecutiveAbsences

[Survived] MethodExpression
services/attendanceService.js:235:3
-     studentRows.sort((a,b) => a.date.localeCompare(b.date));
+     studentRows;
Tests ran:
    attendanceService - full tests summaries & streaks consecutiveAbsences

[Survived] ArrowFunction
services/attendanceService.js:235:20
-     studentRows.sort((a,b) => a.date.localeCompare(b.date));
+     studentRows.sort(() => undefined);
Tests ran:
    attendanceService - full tests summaries & streaks consecutiveAbsences

[Survived] ConditionalExpression
services/attendanceService.js:240:11
-         if (prevDate === null) {
+         if (false) {
Tests ran:
    attendanceService - full tests summaries & streaks consecutiveAbsences

[Survived] StringLiteral
services/attendanceService.js:246:40
-           const pd = new Date(prevDate + 'T00:00:00Z');
+           const pd = new Date(prevDate + "");
Tests ran:
    attendanceService - full tests summaries & streaks consecutiveAbsences
