[Survived] StringLiteral
services/attendanceService.js:249:57
-           const m = String(pd.getUTCMonth()+1).padStart(2,'0');
+           const m = String(pd.getUTCMonth()+1).padStart(2,"");
Tests ran:
    attendanceService - full tests summaries & streaks consecutiveAbsences

[Survived] ConditionalExpression
services/attendanceService.js:252:13
-           if (r.date === nextStr) {
+           if (true) {
Tests ran:
    attendanceService - full tests summaries & streaks consecutiveAbsences

[Survived] EqualityOperator
services/attendanceService.js:258:11
-         if (curStreak > maxStreak) maxStreak = curStreak;
+         if (curStreak >= maxStreak) maxStreak = curStreak;
Tests ran:
    attendanceService - full tests summaries & streaks consecutiveAbsences

[Survived] ConditionalExpression
services/attendanceService.js:273:9
-       if (courseId && String(r.courseId) !== String(courseId)) continue;
+       if (false) continue;
Tests ran:
    attendanceService - full tests summaries & streaks attendanceHeatmap aggregates

[Survived] ConditionalExpression
services/attendanceService.js:275:9
-       if (!map[d]) map[d] = { present: 0, absent: 0 };
+       if (true) map[d] = { present: 0, absent: 0 };
Tests ran:
    attendanceService - full tests summaries & streaks attendanceHeatmap aggregates

[Survived] ObjectLiteral
services/attendanceService.js:275:27
-       if (!map[d]) map[d] = { present: 0, absent: 0 };
+       if (!map[d]) map[d] = {};
Tests ran:
    attendanceService - full tests summaries & streaks attendanceHeatmap aggregates

[Survived] ConditionalExpression
services/attendanceService.js:277:9
-       if (status === 'present') map[d].present++;
+       if (true) map[d].present++;
Tests ran:
    attendanceService - full tests summaries & streaks attendanceHeatmap aggregates

[Survived] MethodExpression
services/attendanceService.js:276:20
-       const status = String(r.status).toLowerCase();
+       const status = String(r.status).toUpperCase();
Tests ran:
    attendanceService - full tests summaries & streaks attendanceHeatmap aggregates

[Survived] ConditionalExpression
services/attendanceService.js:277:9
-       if (status === 'present') map[d].present++;
+       if (false) map[d].present++;
Tests ran:
    attendanceService - full tests summaries & streaks attendanceHeatmap aggregates

[Survived] EqualityOperator
services/attendanceService.js:277:9
-       if (status === 'present') map[d].present++;
+       if (status !== 'present') map[d].present++;
Tests ran:
    attendanceService - full tests summaries & streaks attendanceHeatmap aggregates

[Survived] StringLiteral
services/attendanceService.js:277:20
-       if (status === 'present') map[d].present++;
+       if (status === "") map[d].present++;
Tests ran:
    attendanceService - full tests summaries & streaks attendanceHeatmap aggregates

[Survived] UpdateOperator
services/attendanceService.js:277:31
-       if (status === 'present') map[d].present++;
+       if (status === 'present') map[d].present--;
Tests ran:
    attendanceService - full tests summaries & streaks attendanceHeatmap aggregates

[Survived] ConditionalExpression
services/attendanceService.js:278:14
-       else if (status === 'absent') map[d].absent++;
+       else if (true) map[d].absent++;
Tests ran:
    attendanceService - full tests summaries & streaks attendanceHeatmap aggregates

[Survived] ConditionalExpression
services/attendanceService.js:278:14
-       else if (status === 'absent') map[d].absent++;
+       else if (false) map[d].absent++;
Tests ran:
    attendanceService - full tests summaries & streaks attendanceHeatmap aggregates

[Survived] EqualityOperator
services/attendanceService.js:278:14
-       else if (status === 'absent') map[d].absent++;
+       else if (status !== 'absent') map[d].absent++;
Tests ran:
    attendanceService - full tests summaries & streaks attendanceHeatmap aggregates

[Survived] StringLiteral
services/attendanceService.js:278:25
-       else if (status === 'absent') map[d].absent++;
+       else if (status === "") map[d].absent++;
Tests ran:
    attendanceService - full tests summaries & streaks attendanceHeatmap aggregates

[Survived] UpdateOperator
services/attendanceService.js:278:35
-       else if (status === 'absent') map[d].absent++;
+       else if (status === 'absent') map[d].absent--;
Tests ran:
    attendanceService - full tests summaries & streaks attendanceHeatmap aggregates

[NoCoverage] BlockStatement
services/courseService.js:3:30
-   function rowToCourse(r = {}) {
-     return {
-       id: r.id,
-       code: r.code || "",
-       name: r.name || "",
-       instructor: r.instructor || "",
-       credits: r.credits || 0,
-     };
-   }
+   function rowToCourse(r = {}) {}

[NoCoverage] ObjectLiteral
services/courseService.js:4:10
-     return {
-       id: r.id,
-       code: r.code || "",
-       name: r.name || "",
-       instructor: r.instructor || "",
-       credits: r.credits || 0,
-     };
+     return {};

[NoCoverage] ConditionalExpression
services/courseService.js:6:11
-       code: r.code || "",
+       code: true,

[NoCoverage] ConditionalExpression
services/courseService.js:6:11
-       code: r.code || "",
+       code: false,

[NoCoverage] LogicalOperator
services/courseService.js:6:11
-       code: r.code || "",
+       code: r.code && "",

[NoCoverage] StringLiteral
services/courseService.js:6:21
-       code: r.code || "",
+       code: r.code || "Stryker was here!",

[NoCoverage] ConditionalExpression
services/courseService.js:7:11
-       name: r.name || "",
+       name: true,

[NoCoverage] ConditionalExpression
services/courseService.js:7:11
-       name: r.name || "",
+       name: false,

[NoCoverage] LogicalOperator
services/courseService.js:7:11
-       name: r.name || "",
+       name: r.name && "",

[NoCoverage] StringLiteral
services/courseService.js:7:21
-       name: r.name || "",
+       name: r.name || "Stryker was here!",

[NoCoverage] ConditionalExpression
services/courseService.js:8:17
-       instructor: r.instructor || "",
+       instructor: true,

[NoCoverage] ConditionalExpression
services/courseService.js:8:17
-       instructor: r.instructor || "",
+       instructor: false,

[NoCoverage] LogicalOperator
services/courseService.js:8:17
-       instructor: r.instructor || "",
+       instructor: r.instructor && "",

[NoCoverage] StringLiteral
services/courseService.js:8:33
-       instructor: r.instructor || "",
+       instructor: r.instructor || "Stryker was here!",

[NoCoverage] ConditionalExpression
services/courseService.js:9:14
-       credits: r.credits || 0,
+       credits: true,

[NoCoverage] ConditionalExpression
services/courseService.js:9:14
-       credits: r.credits || 0,
+       credits: false,

[NoCoverage] LogicalOperator
services/courseService.js:9:14
-       credits: r.credits || 0,
+       credits: r.credits && 0,

[NoCoverage] StringLiteral
services/courseService.js:13:37
-   function normalizeCourseCode(code = "") {
+   function normalizeCourseCode(code = "Stryker was here!") {

[NoCoverage] BlockStatement
services/courseService.js:13:41
-   function normalizeCourseCode(code = "") {
-     return code.toUpperCase().replace(/\s+/g, "");
-   }
+   function normalizeCourseCode(code = "") {}

[NoCoverage] MethodExpression
services/courseService.js:14:10
-     return code.toUpperCase().replace(/\s+/g, "");
+     return code.toLowerCase().replace(/\s+/g, "");

[NoCoverage] Regex
services/courseService.js:14:37
-     return code.toUpperCase().replace(/\s+/g, "");
+     return code.toUpperCase().replace(/\s/g, "");

[NoCoverage] Regex
services/courseService.js:14:37
-     return code.toUpperCase().replace(/\s+/g, "");
+     return code.toUpperCase().replace(/\S+/g, "");

[NoCoverage] StringLiteral
services/courseService.js:14:45
-     return code.toUpperCase().replace(/\s+/g, "");
+     return code.toUpperCase().replace(/\s+/g, "Stryker was here!");

[NoCoverage] StringLiteral
services/courseService.js:18:38
-   function abbreviateCourseName(name = "", len = 20) {
+   function abbreviateCourseName(name = "Stryker was here!", len = 20) {

[NoCoverage] BlockStatement
services/courseService.js:18:52
-   function abbreviateCourseName(name = "", len = 20) {
-     return name.length <= len ? name : name.slice(0, len - 3) + "...";
-   }
+   function abbreviateCourseName(name = "", len = 20) {}

[NoCoverage] ConditionalExpression
services/courseService.js:19:10
-     return name.length <= len ? name : name.slice(0, len - 3) + "...";
+     return true ? name : name.slice(0, len - 3) + "...";

[NoCoverage] ConditionalExpression
services/courseService.js:19:10
-     return name.length <= len ? name : name.slice(0, len - 3) + "...";
+     return false ? name : name.slice(0, len - 3) + "...";

[NoCoverage] EqualityOperator
services/courseService.js:19:10
-     return name.length <= len ? name : name.slice(0, len - 3) + "...";
+     return name.length < len ? name : name.slice(0, len - 3) + "...";

[NoCoverage] EqualityOperator
services/courseService.js:19:10
-     return name.length <= len ? name : name.slice(0, len - 3) + "...";
+     return name.length > len ? name : name.slice(0, len - 3) + "...";

[NoCoverage] MethodExpression
services/courseService.js:19:38
-     return name.length <= len ? name : name.slice(0, len - 3) + "...";
+     return name.length <= len ? name : name + "...";

[NoCoverage] ArithmeticOperator
services/courseService.js:19:52
-     return name.length <= len ? name : name.slice(0, len - 3) + "...";
+     return name.length <= len ? name : name.slice(0, len + 3) + "...";

[NoCoverage] StringLiteral
services/courseService.js:19:63
-     return name.length <= len ? name : name.slice(0, len - 3) + "...";
+     return name.length <= len ? name : name.slice(0, len - 3) + "";

[NoCoverage] StringLiteral
services/courseService.js:23:33
-   function parseCourseCode(code = "") {
+   function parseCourseCode(code = "Stryker was here!") {

[NoCoverage] BlockStatement
services/courseService.js:23:37
-   function parseCourseCode(code = "") {
-     const m = code.toUpperCase().match(/^([A-Z]+)(\d+)$/);
-     return m ? { subject: m[1], number: m[2] } : { subject: code, number: "" };
-   }
+   function parseCourseCode(code = "") {}

[NoCoverage] MethodExpression
services/courseService.js:24:13
-     const m = code.toUpperCase().match(/^([A-Z]+)(\d+)$/);
+     const m = code.toLowerCase().match(/^([A-Z]+)(\d+)$/);

[NoCoverage] Regex
services/courseService.js:24:38
-     const m = code.toUpperCase().match(/^([A-Z]+)(\d+)$/);
+     const m = code.toUpperCase().match(/([A-Z]+)(\d+)$/);

[NoCoverage] Regex
services/courseService.js:24:38
-     const m = code.toUpperCase().match(/^([A-Z]+)(\d+)$/);
+     const m = code.toUpperCase().match(/^([A-Z]+)(\d+)/);

[NoCoverage] Regex
services/courseService.js:24:38
-     const m = code.toUpperCase().match(/^([A-Z]+)(\d+)$/);
+     const m = code.toUpperCase().match(/^([A-Z])(\d+)$/);

[NoCoverage] Regex
services/courseService.js:24:38
-     const m = code.toUpperCase().match(/^([A-Z]+)(\d+)$/);
+     const m = code.toUpperCase().match(/^([^A-Z]+)(\d+)$/);

[NoCoverage] Regex
services/courseService.js:24:38
-     const m = code.toUpperCase().match(/^([A-Z]+)(\d+)$/);
+     const m = code.toUpperCase().match(/^([A-Z]+)(\d)$/);

[NoCoverage] Regex
services/courseService.js:24:38
-     const m = code.toUpperCase().match(/^([A-Z]+)(\d+)$/);
+     const m = code.toUpperCase().match(/^([A-Z]+)(\D+)$/);

[NoCoverage] ObjectLiteral
services/courseService.js:25:14
-     return m ? { subject: m[1], number: m[2] } : { subject: code, number: "" };
+     return m ? {} : { subject: code, number: "" };

[NoCoverage] ObjectLiteral
services/courseService.js:25:48
-     return m ? { subject: m[1], number: m[2] } : { subject: code, number: "" };
+     return m ? { subject: m[1], number: m[2] } : {};

[NoCoverage] StringLiteral
services/courseService.js:25:73
-     return m ? { subject: m[1], number: m[2] } : { subject: code, number: "" };
+     return m ? { subject: m[1], number: m[2] } : { subject: code, number: "Stryker was here!" };

[NoCoverage] StringLiteral
services/courseService.js:28:33
-   function syllabusSnippet(text = "", words = 20) {
+   function syllabusSnippet(text = "Stryker was here!", words = 20) {

[NoCoverage] BlockStatement
services/courseService.js:28:49
-   function syllabusSnippet(text = "", words = 20) {
-     const parts = text.trim().split(/\s+/);
-     return parts.length <= words ? text : parts.slice(0, words).join(" ") + "...";
-   }
+   function syllabusSnippet(text = "", words = 20) {}

[NoCoverage] MethodExpression
services/courseService.js:29:17
-     const parts = text.trim().split(/\s+/);
+     const parts = text.split(/\s+/);

[NoCoverage] Regex
services/courseService.js:29:35
-     const parts = text.trim().split(/\s+/);
+     const parts = text.trim().split(/\s/);

[NoCoverage] Regex
services/courseService.js:29:35
-     const parts = text.trim().split(/\s+/);
+     const parts = text.trim().split(/\S+/);

[NoCoverage] ConditionalExpression
services/courseService.js:30:10
-     return parts.length <= words ? text : parts.slice(0, words).join(" ") + "...";
+     return true ? text : parts.slice(0, words).join(" ") + "...";

[NoCoverage] ConditionalExpression
services/courseService.js:30:10
-     return parts.length <= words ? text : parts.slice(0, words).join(" ") + "...";
+     return false ? text : parts.slice(0, words).join(" ") + "...";

[NoCoverage] EqualityOperator
services/courseService.js:30:10
-     return parts.length <= words ? text : parts.slice(0, words).join(" ") + "...";
+     return parts.length < words ? text : parts.slice(0, words).join(" ") + "...";

[NoCoverage] EqualityOperator
services/courseService.js:30:10
-     return parts.length <= words ? text : parts.slice(0, words).join(" ") + "...";
+     return parts.length > words ? text : parts.slice(0, words).join(" ") + "...";

[NoCoverage] MethodExpression
services/courseService.js:30:41
-     return parts.length <= words ? text : parts.slice(0, words).join(" ") + "...";
+     return parts.length <= words ? text : parts.join(" ") + "...";

[NoCoverage] StringLiteral
services/courseService.js:30:68
-     return parts.length <= words ? text : parts.slice(0, words).join(" ") + "...";
+     return parts.length <= words ? text : parts.slice(0, words).join("") + "...";

[NoCoverage] StringLiteral
services/courseService.js:30:75
-     return parts.length <= words ? text : parts.slice(0, words).join(" ") + "...";
+     return parts.length <= words ? text : parts.slice(0, words).join(" ") + "";

[NoCoverage] StringLiteral
services/courseService.js:33:40
-   function validateInstructorName(name = "") {
+   function validateInstructorName(name = "Stryker was here!") {

[NoCoverage] BlockStatement
services/courseService.js:33:44
-   function validateInstructorName(name = "") {
-     return /^[A-Za-z .'-]{2,100}$/.test(name.trim());
-   }
+   function validateInstructorName(name = "") {}

[NoCoverage] Regex
services/courseService.js:34:10
-     return /^[A-Za-z .'-]{2,100}$/.test(name.trim());
+     return /[A-Za-z .'-]{2,100}$/.test(name.trim());

[NoCoverage] Regex
services/courseService.js:34:10
-     return /^[A-Za-z .'-]{2,100}$/.test(name.trim());
+     return /^[A-Za-z .'-]{2,100}/.test(name.trim());

[NoCoverage] Regex
services/courseService.js:34:10
-     return /^[A-Za-z .'-]{2,100}$/.test(name.trim());
+     return /^[A-Za-z .'-]$/.test(name.trim());

[NoCoverage] Regex
services/courseService.js:34:10
-     return /^[A-Za-z .'-]{2,100}$/.test(name.trim());
+     return /^[^A-Za-z .'-]{2,100}$/.test(name.trim());

[NoCoverage] MethodExpression
services/courseService.js:34:39
-     return /^[A-Za-z .'-]{2,100}$/.test(name.trim());
+     return /^[A-Za-z .'-]{2,100}$/.test(name);

[NoCoverage] BlockStatement
services/courseService.js:37:28
-   function isValidCredits(c) {
-     return Number(c) >= 0 && Number(c) <= 10;
-   }
+   function isValidCredits(c) {}

[NoCoverage] ConditionalExpression
services/courseService.js:38:10
-     return Number(c) >= 0 && Number(c) <= 10;
+     return true;

[NoCoverage] ConditionalExpression
services/courseService.js:38:10
-     return Number(c) >= 0 && Number(c) <= 10;
+     return false;

[NoCoverage] LogicalOperator
services/courseService.js:38:10
-     return Number(c) >= 0 && Number(c) <= 10;
+     return Number(c) >= 0 || Number(c) <= 10;

[NoCoverage] ConditionalExpression
services/courseService.js:38:10
-     return Number(c) >= 0 && Number(c) <= 10;
+     return true && Number(c) <= 10;

[NoCoverage] EqualityOperator
services/courseService.js:38:10
-     return Number(c) >= 0 && Number(c) <= 10;
+     return Number(c) > 0 && Number(c) <= 10;

[NoCoverage] EqualityOperator
services/courseService.js:38:10
-     return Number(c) >= 0 && Number(c) <= 10;
+     return Number(c) < 0 && Number(c) <= 10;

[NoCoverage] ConditionalExpression
services/courseService.js:38:28
-     return Number(c) >= 0 && Number(c) <= 10;
+     return Number(c) >= 0 && true;

[NoCoverage] EqualityOperator
services/courseService.js:38:28
-     return Number(c) >= 0 && Number(c) <= 10;
+     return Number(c) >= 0 && Number(c) < 10;

[NoCoverage] EqualityOperator
services/courseService.js:38:28
-     return Number(c) >= 0 && Number(c) <= 10;
+     return Number(c) >= 0 && Number(c) > 10;

[NoCoverage] BlockStatement
services/courseService.js:41:40
-   function validateCoursePayload(p = {}) {
-     if (!p.code || !p.name) return { ok: false };
-     if (p.credits && !isValidCredits(p.credits)) return { ok: false };
-     return { ok: true };
-   }
+   function validateCoursePayload(p = {}) {}

[NoCoverage] ConditionalExpression
services/courseService.js:42:7
-     if (!p.code || !p.name) return { ok: false };
+     if (true) return { ok: false };

[NoCoverage] ConditionalExpression
services/courseService.js:42:7
-     if (!p.code || !p.name) return { ok: false };
+     if (false) return { ok: false };

[NoCoverage] LogicalOperator
services/courseService.js:42:7
-     if (!p.code || !p.name) return { ok: false };
+     if (!p.code && !p.name) return { ok: false };

[NoCoverage] BooleanLiteral
services/courseService.js:42:7
-     if (!p.code || !p.name) return { ok: false };
+     if (p.code || !p.name) return { ok: false };

[NoCoverage] BooleanLiteral
services/courseService.js:42:18
-     if (!p.code || !p.name) return { ok: false };
+     if (!p.code || p.name) return { ok: false };

[NoCoverage] ObjectLiteral
services/courseService.js:42:34
-     if (!p.code || !p.name) return { ok: false };
+     if (!p.code || !p.name) return {};

[NoCoverage] BooleanLiteral
services/courseService.js:42:40
-     if (!p.code || !p.name) return { ok: false };
+     if (!p.code || !p.name) return { ok: true };

[NoCoverage] ConditionalExpression
services/courseService.js:43:7
-     if (p.credits && !isValidCredits(p.credits)) return { ok: false };
+     if (true) return { ok: false };

[NoCoverage] ConditionalExpression
services/courseService.js:43:7
-     if (p.credits && !isValidCredits(p.credits)) return { ok: false };
+     if (false) return { ok: false };

[NoCoverage] LogicalOperator
services/courseService.js:43:7
-     if (p.credits && !isValidCredits(p.credits)) return { ok: false };
+     if (p.credits || !isValidCredits(p.credits)) return { ok: false };

[NoCoverage] BooleanLiteral
services/courseService.js:43:20
-     if (p.credits && !isValidCredits(p.credits)) return { ok: false };
+     if (p.credits && isValidCredits(p.credits)) return { ok: false };

[NoCoverage] ObjectLiteral
services/courseService.js:43:55
-     if (p.credits && !isValidCredits(p.credits)) return { ok: false };
+     if (p.credits && !isValidCredits(p.credits)) return {};

[NoCoverage] BooleanLiteral
services/courseService.js:43:61
-     if (p.credits && !isValidCredits(p.credits)) return { ok: false };
+     if (p.credits && !isValidCredits(p.credits)) return { ok: true };

[NoCoverage] ObjectLiteral
services/courseService.js:44:10
-     return { ok: true };
+     return {};

[NoCoverage] BooleanLiteral
services/courseService.js:44:16
-     return { ok: true };
+     return { ok: false };

[NoCoverage] StringLiteral
services/courseService.js:47:27
-   function matchesQuery(q = "", course = {}) {
+   function matchesQuery(q = "Stryker was here!", course = {}) {

[NoCoverage] BlockStatement
services/courseService.js:47:44
-   function matchesQuery(q = "", course = {}) {
-     q = q.toLowerCase();
-     return (
-       course.code?.toLowerCase().includes(q) ||
-       course.name?.toLowerCase().includes(q) ||
-       course.instructor?.toLowerCase().includes(q)
-     );
-   }
+   function matchesQuery(q = "", course = {}) {}

[NoCoverage] MethodExpression
services/courseService.js:48:7
-     q = q.toLowerCase();
+     q = q.toUpperCase();

[NoCoverage] ConditionalExpression
services/courseService.js:50:5
-       course.code?.toLowerCase().includes(q) ||
-       course.name?.toLowerCase().includes(q) ||
-       course.instructor?.toLowerCase().includes(q)
+       true

[NoCoverage] ConditionalExpression
services/courseService.js:50:5
-       course.code?.toLowerCase().includes(q) ||
-       course.name?.toLowerCase().includes(q) ||
-       course.instructor?.toLowerCase().includes(q)
+       false

[NoCoverage] LogicalOperator
services/courseService.js:50:5
-       course.code?.toLowerCase().includes(q) ||
-       course.name?.toLowerCase().includes(q) ||
-       course.instructor?.toLowerCase().includes(q)
+       (course.code?.toLowerCase().includes(q) || course.name?.toLowerCase().includes(q)) && course.instructor?.toLowerCase().includes(q)

[NoCoverage] ConditionalExpression
services/courseService.js:50:5
-       course.code?.toLowerCase().includes(q) ||
-       course.name?.toLowerCase().includes(q) ||
+       false ||

[NoCoverage] LogicalOperator
services/courseService.js:50:5
-       course.code?.toLowerCase().includes(q) ||
-       course.name?.toLowerCase().includes(q) ||
+       course.code?.toLowerCase().includes(q) && course.name?.toLowerCase().includes(q) ||

[NoCoverage] MethodExpression
services/courseService.js:50:5
-       course.code?.toLowerCase().includes(q) ||
+       course.code?.toUpperCase().includes(q) ||

[NoCoverage] OptionalChaining
services/courseService.js:50:5
-       course.code?.toLowerCase().includes(q) ||
+       course.code.toLowerCase().includes(q) ||

[NoCoverage] MethodExpression
services/courseService.js:51:5
-       course.name?.toLowerCase().includes(q) ||
+       course.name?.toUpperCase().includes(q) ||

[NoCoverage] OptionalChaining
services/courseService.js:51:5
-       course.name?.toLowerCase().includes(q) ||
+       course.name.toLowerCase().includes(q) ||

[NoCoverage] MethodExpression
services/courseService.js:52:5
-       course.instructor?.toLowerCase().includes(q)
+       course.instructor?.toUpperCase().includes(q)

[NoCoverage] OptionalChaining
services/courseService.js:52:5
-       course.instructor?.toLowerCase().includes(q)
+       course.instructor.toLowerCase().includes(q)

[NoCoverage] ObjectLiteral
services/courseService.js:56:18
-   module.exports = {
-     rowToCourse,
-     normalizeCourseCode,
-     abbreviateCourseName,
-     parseCourseCode,
-     syllabusSnippet,
-     validateInstructorName,
-     isValidCredits,
-     validateCoursePayload,
-     matchesQuery,
-   };
+   module.exports = {};

[NoCoverage] ArrayDeclaration
services/enrollmentService.js:27:27
-   function canEnroll(list = [], studentId, courseId) {
+   function canEnroll(list = ["Stryker was here"], studentId, courseId) {

[NoCoverage] ArrayDeclaration
services/enrollmentService.js:31:40
-   function buildEnrollmentRecords(list = []) {
+   function buildEnrollmentRecords(list = ["Stryker was here"]) {

[NoCoverage] ArrayDeclaration
services/enrollmentService.js:43:37
-   function removeEnrollmentById(arr = [], id) {
+   function removeEnrollmentById(arr = ["Stryker was here"], id) {

[Survived] LogicalOperator
services/enrollmentService.js:4:7
-     if (!payload.studentId || !payload.courseId)
+     if (!payload.studentId && !payload.courseId)
Tests ran:
    enrollmentService - full tests validation & keys validateEnrollment returns ok for good payload

[Survived] LogicalOperator
services/enrollmentService.js:10:7
-     if (!p.studentId || !p.courseId) throw new Error("Missing IDs");
+     if (!p.studentId && !p.courseId) throw new Error("Missing IDs");
Tests ran:
    enrollmentService - full tests record creation and duplicates buildEnrollmentRecord throws when missing
    enrollmentService - full tests record creation and duplicates buildEnrollmentRecord returns object when valid
    enrollmentService - full tests bulk helpers buildEnrollmentRecords filters invalid entries

[Survived] StringLiteral
services/enrollmentService.js:10:52
-     if (!p.studentId || !p.courseId) throw new Error("Missing IDs");
+     if (!p.studentId || !p.courseId) throw new Error("");
Tests ran:
    enrollmentService - full tests record creation and duplicates buildEnrollmentRecord throws when missing
    enrollmentService - full tests bulk helpers buildEnrollmentRecords filters invalid entries

[Survived] MethodExpression
services/enrollmentService.js:28:11
-     return !list.some((e) => e.studentId === studentId && e.courseId === courseId);
+     return !list.every(e => e.studentId === studentId && e.courseId === courseId);
Tests ran:
    enrollmentService - full tests record creation and duplicates canEnroll returns false when duplicate

[Survived] ConditionalExpression
services/enrollmentService.js:28:28
-     return !list.some((e) => e.studentId === studentId && e.courseId === courseId);
+     return !list.some((e) => true && e.courseId === courseId);
Tests ran:
    enrollmentService - full tests record creation and duplicates canEnroll returns false when duplicate

[Survived] MethodExpression
services/enrollmentService.js:32:10
-     return list
-       .map((p) => {
-         try {
-           return buildEnrollmentRecord(p);
-         } catch {
-           return null;
-         }
-       })
-       .filter(Boolean);
+     return list.map(p => {
+     try {
+       return buildEnrollmentRecord(p);
+     } catch {
+       return null;
+     }
+   });
Tests ran:
    enrollmentService - full tests bulk helpers buildEnrollmentRecords filters invalid entries

[Survived] BlockStatement
services/enrollmentService.js:36:15
-         } catch {
-           return null;
-         }
+         } catch {}
Tests ran:
    enrollmentService - full tests bulk helpers buildEnrollmentRecords filters invalid entries

[NoCoverage] StringLiteral
services/studentService.js:10:31
-   function normalizeName(name = "") {
+   function normalizeName(name = "Stryker was here!") {

[NoCoverage] StringLiteral
services/studentService.js:24:33
-   function normalizeEmail(email = "") {
+   function normalizeEmail(email = "Stryker was here!") {

[NoCoverage] StringLiteral
services/studentService.js:25:26
-     return String(email || "").trim().toLowerCase();
+     return String(email || "Stryker was here!").trim().toLowerCase();

[NoCoverage] StringLiteral
services/studentService.js:29:28
-   function maskEmail(email = "") {
+   function maskEmail(email = "Stryker was here!") {

[NoCoverage] StringLiteral
services/studentService.js:37:32
-   function validatePhone(phone = "") {
+   function validatePhone(phone = "Stryker was here!") {

[NoCoverage] BlockStatement
services/studentService.js:49:73
-     if (today < new Date(today.getFullYear(), d.getMonth(), d.getDate())) {
-       age--;
-     }
+     if (today < new Date(today.getFullYear(), d.getMonth(), d.getDate())) {}

[NoCoverage] UpdateOperator
services/studentService.js:50:5
-       age--;
+       age++;

[NoCoverage] StringLiteral
services/studentService.js:69:67
-     if (payload.phone && !validatePhone(payload.phone)) errors.push("invalid phone");
+     if (payload.phone && !validatePhone(payload.phone)) errors.push("");

[NoCoverage] StringLiteral
services/studentService.js:78:37
-       firstName: payload.firstName || "",
+       firstName: payload.firstName || "Stryker was here!",

[NoCoverage] StringLiteral
services/studentService.js:79:35
-       lastName: payload.lastName || "",
+       lastName: payload.lastName || "Stryker was here!",

[NoCoverage] StringLiteral
services/studentService.js:81:44
-       email: normalizeEmail(payload.email || ""),
+       email: normalizeEmail(payload.email || "Stryker was here!"),

[NoCoverage] StringLiteral
services/studentService.js:108:29
-     const la = (a.lastName || "").toLowerCase();
+     const la = (a.lastName || "Stryker was here!").toLowerCase();

[NoCoverage] StringLiteral
services/studentService.js:109:29
-     const lb = (b.lastName || "").toLowerCase();
+     const lb = (b.lastName || "Stryker was here!").toLowerCase();

[NoCoverage] StringLiteral
services/studentService.js:112:26
-     return (a.firstName || "").localeCompare(b.firstName || "");
+     return (a.firstName || "Stryker was here!").localeCompare(b.firstName || "");

[NoCoverage] StringLiteral
services/studentService.js:112:59
-     return (a.firstName || "").localeCompare(b.firstName || "");
+     return (a.firstName || "").localeCompare(b.firstName || "Stryker was here!");

[Survived] MethodExpression
services/studentService.js:4:25
-     const f = firstName ? String(firstName).trim() : "";
+     const f = firstName ? String(firstName) : "";
Tests ran:
    studentService - full tests name helpers formatFullName: joins properly
    studentService - full tests payload validation & builders rowToStudent null-safety and mapping
