[Survived] MethodExpression
services/studentService.js:5:24
-     const l = lastName ? String(lastName).trim() : "";
+     const l = lastName ? String(lastName) : "";
Tests ran:
    studentService - full tests name helpers formatFullName: joins properly
    studentService - full tests payload validation & builders rowToStudent null-safety and mapping

[Survived] Regex
services/studentService.js:13:12
-       .split(/\s+/)
+       .split(/\s/)
Tests ran:
    studentService - full tests name helpers normalizeName: capitalizes parts and trims

[Survived] BooleanLiteral
services/studentService.js:31:7
-     if (!e.includes("@")) return e;
+     if (e.includes("@")) return e;
Tests ran:
    studentService - full tests admission & email helpers normalizeEmail and maskEmail
    studentService - full tests payload validation & builders rowToStudent null-safety and mapping

[Survived] ConditionalExpression
services/studentService.js:31:7
-     if (!e.includes("@")) return e;
+     if (true) return e;
Tests ran:
    studentService - full tests admission & email helpers normalizeEmail and maskEmail
    studentService - full tests payload validation & builders rowToStudent null-safety and mapping

[Survived] ConditionalExpression
services/studentService.js:31:7
-     if (!e.includes("@")) return e;
+     if (false) return e;
Tests ran:
    studentService - full tests admission & email helpers normalizeEmail and maskEmail
    studentService - full tests payload validation & builders rowToStudent null-safety and mapping

[Survived] StringLiteral
services/studentService.js:31:19
-     if (!e.includes("@")) return e;
+     if (!e.includes("")) return e;
Tests ran:
    studentService - full tests admission & email helpers normalizeEmail and maskEmail
    studentService - full tests payload validation & builders rowToStudent null-safety and mapping

[Survived] EqualityOperator
services/studentService.js:33:7
-     if (local.length <= 2) return `*@${domain}`;
+     if (local.length < 2) return `*@${domain}`;
Tests ran:
    studentService - full tests admission & email helpers normalizeEmail and maskEmail
    studentService - full tests payload validation & builders rowToStudent null-safety and mapping

[Survived] StringLiteral
services/studentService.js:33:33
-     if (local.length <= 2) return `*@${domain}`;
+     if (local.length <= 2) return ``;
Tests ran:
    studentService - full tests payload validation & builders rowToStudent null-safety and mapping

[Survived] StringLiteral
services/studentService.js:34:24
-     return `${local[0]}${"*".repeat(local.length - 2)}${local[local.length - 1]}@${domain}`;
+     return `${local[0]}${"".repeat(local.length - 2)}${local[local.length - 1]}@${domain}`;
Tests ran:
    studentService - full tests admission & email helpers normalizeEmail and maskEmail

[Survived] ArithmeticOperator
services/studentService.js:34:35
-     return `${local[0]}${"*".repeat(local.length - 2)}${local[local.length - 1]}@${domain}`;
+     return `${local[0]}${"*".repeat(local.length + 2)}${local[local.length - 1]}@${domain}`;
Tests ran:
    studentService - full tests admission & email helpers normalizeEmail and maskEmail

[Survived] ArithmeticOperator
services/studentService.js:34:61
-     return `${local[0]}${"*".repeat(local.length - 2)}${local[local.length - 1]}@${domain}`;
+     return `${local[0]}${"*".repeat(local.length - 2)}${local[local.length + 1]}@${domain}`;
Tests ran:
    studentService - full tests admission & email helpers normalizeEmail and maskEmail

[Survived] Regex
services/studentService.js:39:10
-     return /^\+?\d{6,15}$/.test(cleaned);
+     return /\+?\d{6,15}$/.test(cleaned);
Tests ran:
    studentService - full tests phone and age validatePhone accepts common patterns and rejects invalid
    studentService - full tests payload validation & builders validateStudentPayload rejects invalid emails and missing names

[Survived] Regex
services/studentService.js:39:10
-     return /^\+?\d{6,15}$/.test(cleaned);
+     return /^\+?\d{6,15}/.test(cleaned);
Tests ran:
    studentService - full tests phone and age validatePhone accepts common patterns and rejects invalid
    studentService - full tests payload validation & builders validateStudentPayload rejects invalid emails and missing names

[Survived] ConditionalExpression
services/studentService.js:44:7
-     if (!dob) return null;
+     if (false) return null;
Tests ran:
    studentService - full tests phone and age calculateAge and isAdult behavior

[Survived] ConditionalExpression
services/studentService.js:49:7
-     if (today < new Date(today.getFullYear(), d.getMonth(), d.getDate())) {
+     if (true) {
Tests ran:
    studentService - full tests phone and age calculateAge and isAdult behavior

[Survived] ConditionalExpression
services/studentService.js:49:7
-     if (today < new Date(today.getFullYear(), d.getMonth(), d.getDate())) {
+     if (false) {
Tests ran:
    studentService - full tests phone and age calculateAge and isAdult behavior

[Survived] EqualityOperator
services/studentService.js:49:7
-     if (today < new Date(today.getFullYear(), d.getMonth(), d.getDate())) {
+     if (today <= new Date(today.getFullYear(), d.getMonth(), d.getDate())) {
Tests ran:
    studentService - full tests phone and age calculateAge and isAdult behavior

[Survived] EqualityOperator
services/studentService.js:49:7
-     if (today < new Date(today.getFullYear(), d.getMonth(), d.getDate())) {
+     if (today >= new Date(today.getFullYear(), d.getMonth(), d.getDate())) {
Tests ran:
    studentService - full tests phone and age calculateAge and isAdult behavior

[Survived] ConditionalExpression
services/studentService.js:57:10
-     return age !== null && age >= limit;
+     return true && age >= limit;
Tests ran:
    studentService - full tests phone and age calculateAge and isAdult behavior

[Survived] EqualityOperator
services/studentService.js:57:26
-     return age !== null && age >= limit;
+     return age !== null && age > limit;
Tests ran:
    studentService - full tests phone and age calculateAge and isAdult behavior

[Survived] ConditionalExpression
services/studentService.js:63:7
-     if (!payload.firstName) errors.push("firstName required");
+     if (false) errors.push("firstName required");
Tests ran:
    studentService - full tests payload validation & builders validateStudentPayload rejects invalid emails and missing names

[Survived] StringLiteral
services/studentService.js:63:39
-     if (!payload.firstName) errors.push("firstName required");
+     if (!payload.firstName) errors.push("");
Tests ran:
    studentService - full tests payload validation & builders validateStudentPayload rejects invalid emails and missing names

[Survived] ConditionalExpression
services/studentService.js:64:7
-     if (!payload.lastName) errors.push("lastName required");
+     if (false) errors.push("lastName required");
Tests ran:
    studentService - full tests payload validation & builders validateStudentPayload rejects invalid emails and missing names

[Survived] StringLiteral
services/studentService.js:64:38
-     if (!payload.lastName) errors.push("lastName required");
+     if (!payload.lastName) errors.push("");
Tests ran:
    studentService - full tests payload validation & builders validateStudentPayload rejects invalid emails and missing names

[Survived] ConditionalExpression
services/studentService.js:65:7
-     if (payload.email) {
+     if (true) {
Tests ran:
    studentService - full tests payload validation & builders validateStudentPayload rejects invalid emails and missing names

[Survived] Regex
services/studentService.js:66:16
-       const re = /^[^\s@]+@[^\s@]+\.[^\s@]+$/;
+       const re = /[^\s@]+@[^\s@]+\.[^\s@]+$/;
Tests ran:
    studentService - full tests payload validation & builders validateStudentPayload rejects invalid emails and missing names

[Survived] Regex
services/studentService.js:66:16
-       const re = /^[^\s@]+@[^\s@]+\.[^\s@]+$/;
+       const re = /^[^\s@]+@[^\s@]+\.[^\s@]+/;
Tests ran:
    studentService - full tests payload validation & builders validateStudentPayload rejects invalid emails and missing names

[Survived] Regex
services/studentService.js:66:16
-       const re = /^[^\s@]+@[^\s@]+\.[^\s@]+$/;
+       const re = /^[^\s@]@[^\s@]+\.[^\s@]+$/;
Tests ran:
    studentService - full tests payload validation & builders validateStudentPayload rejects invalid emails and missing names

[Survived] Regex
services/studentService.js:66:16
-       const re = /^[^\s@]+@[^\s@]+\.[^\s@]+$/;
+       const re = /^[^\s@]+@[^\s@]\.[^\s@]+$/;
Tests ran:
    studentService - full tests payload validation & builders validateStudentPayload rejects invalid emails and missing names

[Survived] StringLiteral
services/studentService.js:67:46
-       if (!re.test(payload.email)) errors.push("invalid email");
+       if (!re.test(payload.email)) errors.push("");
Tests ran:
    studentService - full tests payload validation & builders validateStudentPayload rejects invalid emails and missing names

[Survived] ConditionalExpression
services/studentService.js:69:7
-     if (payload.phone && !validatePhone(payload.phone)) errors.push("invalid phone");
+     if (false) errors.push("invalid phone");
Tests ran:
    studentService - full tests payload validation & builders validateStudentPayload rejects invalid emails and missing names

[Survived] ConditionalExpression
services/studentService.js:77:18
-       admissionNo: payload.admissionNo || "",
+       admissionNo: true,
Tests ran:
    studentService - full tests payload validation & builders buildStudentRecord sets expected defaults and timestamps

[Survived] ConditionalExpression
services/studentService.js:77:18
-       admissionNo: payload.admissionNo || "",
+       admissionNo: false,
Tests ran:
    studentService - full tests payload validation & builders buildStudentRecord sets expected defaults and timestamps

[Survived] LogicalOperator
services/studentService.js:77:18
-       admissionNo: payload.admissionNo || "",
+       admissionNo: payload.admissionNo && "",
Tests ran:
    studentService - full tests payload validation & builders buildStudentRecord sets expected defaults and timestamps

[Survived] StringLiteral
services/studentService.js:77:41
-       admissionNo: payload.admissionNo || "",
+       admissionNo: payload.admissionNo || "Stryker was here!",
Tests ran:
    studentService - full tests payload validation & builders buildStudentRecord sets expected defaults and timestamps

[Survived] ConditionalExpression
services/studentService.js:80:10
-       dob: payload.dob || "",
+       dob: true,
Tests ran:
    studentService - full tests payload validation & builders buildStudentRecord sets expected defaults and timestamps

[Survived] ConditionalExpression
services/studentService.js:80:10
-       dob: payload.dob || "",
+       dob: false,
Tests ran:
    studentService - full tests payload validation & builders buildStudentRecord sets expected defaults and timestamps

[Survived] StringLiteral
services/studentService.js:80:25
-       dob: payload.dob || "",
+       dob: payload.dob || "Stryker was here!",
Tests ran:
    studentService - full tests payload validation & builders buildStudentRecord sets expected defaults and timestamps

[Survived] LogicalOperator
services/studentService.js:80:10
-       dob: payload.dob || "",
+       dob: payload.dob && "",
Tests ran:
    studentService - full tests payload validation & builders buildStudentRecord sets expected defaults and timestamps

[Survived] ConditionalExpression
services/studentService.js:82:12
-       phone: payload.phone || "",
+       phone: false,
Tests ran:
    studentService - full tests payload validation & builders buildStudentRecord sets expected defaults and timestamps

[Survived] ConditionalExpression
services/studentService.js:82:12
-       phone: payload.phone || "",
+       phone: true,
Tests ran:
    studentService - full tests payload validation & builders buildStudentRecord sets expected defaults and timestamps

[Survived] LogicalOperator
services/studentService.js:82:12
-       phone: payload.phone || "",
+       phone: payload.phone && "",
Tests ran:
    studentService - full tests payload validation & builders buildStudentRecord sets expected defaults and timestamps

[Survived] StringLiteral
services/studentService.js:82:29
-       phone: payload.phone || "",
+       phone: payload.phone || "Stryker was here!",
Tests ran:
    studentService - full tests payload validation & builders buildStudentRecord sets expected defaults and timestamps

[Survived] ConditionalExpression
services/studentService.js:83:14
-       address: payload.address || "",
+       address: true,
Tests ran:
    studentService - full tests payload validation & builders buildStudentRecord sets expected defaults and timestamps

[Survived] ConditionalExpression
services/studentService.js:83:14
-       address: payload.address || "",
+       address: false,
Tests ran:
    studentService - full tests payload validation & builders buildStudentRecord sets expected defaults and timestamps

[Survived] LogicalOperator
services/studentService.js:83:14
-       address: payload.address || "",
+       address: payload.address && "",
Tests ran:
    studentService - full tests payload validation & builders buildStudentRecord sets expected defaults and timestamps

[Survived] ConditionalExpression
services/studentService.js:84:11
-       year: payload.year || "",
+       year: true,
Tests ran:
    studentService - full tests payload validation & builders buildStudentRecord sets expected defaults and timestamps

[Survived] StringLiteral
services/studentService.js:83:33
-       address: payload.address || "",
+       address: payload.address || "Stryker was here!",
Tests ran:
    studentService - full tests payload validation & builders buildStudentRecord sets expected defaults and timestamps

[Survived] ConditionalExpression
services/studentService.js:84:11
-       year: payload.year || "",
+       year: false,
Tests ran:
    studentService - full tests payload validation & builders buildStudentRecord sets expected defaults and timestamps

[Survived] LogicalOperator
services/studentService.js:84:11
-       year: payload.year || "",
+       year: payload.year && "",
Tests ran:
    studentService - full tests payload validation & builders buildStudentRecord sets expected defaults and timestamps

[Survived] StringLiteral
services/studentService.js:84:27
-       year: payload.year || "",
+       year: payload.year || "Stryker was here!",
Tests ran:
    studentService - full tests payload validation & builders buildStudentRecord sets expected defaults and timestamps

[Survived] ConditionalExpression
services/studentService.js:85:12
-       notes: payload.notes || "",
+       notes: true,
Tests ran:
    studentService - full tests payload validation & builders buildStudentRecord sets expected defaults and timestamps

[Survived] LogicalOperator
services/studentService.js:85:12
-       notes: payload.notes || "",
+       notes: payload.notes && "",
Tests ran:
    studentService - full tests payload validation & builders buildStudentRecord sets expected defaults and timestamps

[Survived] ConditionalExpression
services/studentService.js:85:12
-       notes: payload.notes || "",
+       notes: false,
Tests ran:
    studentService - full tests payload validation & builders buildStudentRecord sets expected defaults and timestamps

[Survived] StringLiteral
services/studentService.js:85:29
-       notes: payload.notes || "",
+       notes: payload.notes || "Stryker was here!",
Tests ran:
    studentService - full tests payload validation & builders buildStudentRecord sets expected defaults and timestamps

[Survived] ConditionalExpression
services/studentService.js:111:7
-     if (la > lb) return 1;
+     if (true) return 1;
Tests ran:
    studentService - full tests payload validation & builders compareStudents sorts by last then first

[Survived] EqualityOperator
services/studentService.js:111:7
-     if (la > lb) return 1;
+     if (la >= lb) return 1;
Tests ran:
    studentService - full tests payload validation & builders compareStudents sorts by last then first

[Survived] LogicalOperator
services/studentService.js:112:44
-     return (a.firstName || "").localeCompare(b.firstName || "");
+     return (a.firstName || "").localeCompare(b.firstName && "");
Tests ran:
    studentService - full tests payload validation & builders compareStudents sorts by last then first
